gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
extern volatile PG2SPCIHBITS PG2SPCIHbits __attribute__((__sfr__));

#define PG2LEBL PG2LEBL
extern volatile uint16_t  PG2LEBL __attribute__((__sfr__));
#define PG2LEBH PG2LEBH
extern volatile uint16_t  PG2LEBH __attribute__((__sfr__));
typedef struct tagPG2LEBHBITS {
  uint16_t PLF:1;
  uint16_t PLR:1;
  uint16_t PHF:1;
  uint16_t PHR:1;
  uint16_t :4;
  uint16_t PWMPCI:3;
} PG2LEBHBITS;
extern volatile PG2LEBHBITS PG2LEBHbits __attribute__((__sfr__));

#define PG2PHASE PG2PHASE
extern volatile uint16_t  PG2PHASE __attribute__((__sfr__));
#define PG2DC PG2DC
extern volatile uint16_t  PG2DC __attribute__((__sfr__));
#define PG2DCA PG2DCA
extern volatile uint16_t  PG2DCA __attribute__((__sfr__));
typedef struct tagPG2DCABITS {
  uint16_t DCA:8;
} PG2DCABITS;
extern volatile PG2DCABITS PG2DCAbits __attribute__((__sfr__));

#define PG2PER PG2PER
extern volatile uint16_t  PG2PER __attribute__((__sfr__));
#define PG2TRIGA PG2TRIGA
extern volatile uint16_t  PG2TRIGA __attribute__((__sfr__));
#define PG2TRIGB PG2TRIGB
extern volatile uint16_t  PG2TRIGB __attribute__((__sfr__));
#define PG2TRIGC PG2TRIGC
extern volatile uint16_t  PG2TRIGC __attribute__((__sfr__));
#define PG2DTL PG2DTL
extern volatile uint16_t  PG2DTL __attribute__((__sfr__));
typedef struct tagPG2DTLBITS {
  uint16_t DTL:14;
} PG2DTLBITS;
extern volatile PG2DTLBITS PG2DTLbits __attribute__((__sfr__));

#define PG2DTH PG2DTH
extern volatile uint16_t  PG2DTH __attribute__((__sfr__));
typedef struct tagPG2DTHBITS {
  uint16_t DTH:14;
} PG2DTHBITS;
extern volatile PG2DTHBITS PG2DTHbits __attribute__((__sfr__));

#define PG2CAP PG2CAP
extern volatile uint16_t  PG2CAP __attribute__((__sfr__));
#define PG3CONL PG3CONL
extern volatile uint16_t  PG3CONL __attribute__((__sfr__));
typedef struct tagPG3CONLBITS {
  uint16_t MODSEL:3;
  uint16_t CLKSEL:2;
  uint16_t :2;
  uint16_t HREN:1;
  uint16_t TRGCNT:3;
  uint16_t :4;
  uint16_t ON:1;
} PG3CONLBITS;
extern volatile PG3CONLBITS PG3CONLbits __attribute__((__sfr__));

#define PG3CONH PG3CONH
extern volatile uint16_t  PG3CONH __attribute__((__sfr__));
typedef struct tagPG3CONHBITS {
  uint16_t SOCS:4;
  uint16_t :2;
  uint16_t TRGMOD:1;
  uint16_t :1;
  uint16_t UPDMOD:3;
  uint16_t MSTEN:1;
  uint16_t :1;
  uint16_t MPHSEL:1;
  uint16_t MPERSEL:1;
  uint16_t MDCSEL:1;
} PG3CONHBITS;
extern volatile PG3CONHBITS PG3CONHbits __attribute__((__sfr__));

#define PG3STAT PG3STAT
extern volatile uint16_t  PG3STAT __attribute__((__sfr__));
typedef struct tagPG3STATBITS {
  uint16_t TRIG:1;
  uint16_t CAHALF:1;
  uint16_t STEER:1;
  uint16_t UPDREQ:1;
  uint16_t UPDATE:1;
  uint16_t CAP:1;
  uint16_t TRCLR:1;
  uint16_t TRSET:1;
  uint16_t FFACT:1;
  uint16_t CLACT:1;
  uint16_t FLTACT:1;
  uint16_t SACT:1;
  uint16_t FFEVT:1;
  uint16_t CLEVT:1;
  uint16_t FLTEVT:1;
  uint16_t SEVT:1;
} PG3STATBITS;
extern volatile PG3STATBITS PG3STATbits __attribute__((__sfr__));

#define PG3IOCONL PG3IOCONL
extern volatile uint16_t  PG3IOCONL __attribute__((__sfr__));
typedef struct tagPG3IOCONLBITS {
  uint16_t DBDAT:2;
  uint16_t FFDAT:2;
  uint16_t CLDAT:2;
  uint16_t FLTDAT:2;
  uint16_t OSYNC:2;
  uint16_t OVRDAT:2;
  uint16_t OVRENL:1;
  uint16_t OVRENH:1;
  uint16_t SWAP:1;
  uint16_t CLMOD:1;
} PG3IOCONLBITS;
extern volatile PG3IOCONLBITS PG3IOCONLbits __attribute__((__sfr__));

#define PG3IOCONH PG3IOCONH
extern volatile uint16_t  PG3IOCONH __attribute__((__sfr__));
typedef struct tagPG3IOCONHBITS {
  uint16_t POLL:1;
  uint16_t POLH:1;
  uint16_t PENL:1;
  uint16_t PENH:1;
  uint16_t PMOD:2;
  uint16_t :2;
  uint16_t DTCMPSEL:1;
  uint16_t :3;
  uint16_t CAPSRC:3;
} PG3IOCONHBITS;
extern volatile PG3IOCONHBITS PG3IOCONHbits __attribute__((__sfr__));

#define PG3EVTL PG3EVTL
extern volatile uint16_t  PG3EVTL __attribute__((__sfr__));
typedef struct tagPG3EVTLBITS {
  uint16_t PGTRGSEL:3;
  uint16_t UPDTRG:2;
  uint16_t :3;
  uint16_t ADTR1EN1:1;
  uint16_t ADTR1EN2:1;
  uint16_t ADTR1EN3:1;
  uint16_t ADTR1PS:5;
} PG3EVTLBITS;
extern volatile PG3EVTLBITS PG3EVTLbits __attribute__((__sfr__));

#define PG3EVTH PG3EVTH
extern volatile uint16_t  PG3EVTH __attribute__((__sfr__));
typedef struct tagPG3EVTHBITS {
  uint16_t ADTR1OFS:5;
  uint16_t ADTR2EN1:1;
  uint16_t ADTR2EN2:1;
  uint16_t ADTR2EN3:1;
  uint16_t IEVTSEL:2;
  uint16_t :2;
  uint16_t SIEN:1;
  uint16_t FFIEN:1;
  uint16_t CLIEN:1;
  uint16_t FLTIEN:1;
} PG3EVTHBITS;
extern volatile PG3EVTHBITS PG3EVTHbits __attribute__((__sfr__));

#define PG3FPCIL PG3FPCIL
extern volatile uint16_t  PG3FPCIL __attribute__((__sfr__));
typedef struct tagPG3FPCILBITS {
  uint16_t PSS:5;
  uint16_t PPS:1;
  uint16_t PSYNC:1;
  uint16_t SWTERM:1;
  uint16_t AQSS:3;
  uint16_t AQPS:1;
  uint16_t TERM:3;
  uint16_t TSYNCDIS:1;
} PG3FPCILBITS;
extern volatile PG3FPCILBITS PG3FPCILbits __attribute__((__sfr__));

#define PG3FPCIH PG3FPCIH
extern volatile uint16_t  PG3FPCIH __attribute__((__sfr__));
__extension__ typedef struct tagPG3FPCIHBITS {
  union {
    struct {
      uint16_t TQSS:3;
      uint16_t TQPS:1;
      uint16_t LATMOD:1;
      uint16_t SWPCIM:2;
      uint16_t SWPCI:1;
      uint16_t ACP:3;
      uint16_t :1;
      uint16_t BPSEL:3;
      uint16_t BPEN:1;
    };
    struct {
      uint16_t :4;
      uint16_t PCIGT:1;
    };
  };
} PG3FPCIHBITS;
extern volatile PG3FPCIHBITS PG3FPCIHbits __attribute__((__sfr__));

#define PG3CLPCIL PG3CLPCIL
extern volatile uint16_t  PG3CLPCIL __attribute__((__sfr__));
typedef struct tagPG3CLPCILBITS {
  uint16_t PSS:5;
  uint16_t PPS:1;
  uint16_t PSYNC:1;
  uint16_t SWTERM:1;
  uint16_t AQSS:3;
  uint16_t AQPS:1;
  uint16_t TERM:3;
  uint16_t TSYNCDIS:1;
} PG3CLPCILBITS;
extern volatile PG3CLPCILBITS PG3CLPCILbits __attribute__((__sfr__));

#define PG3CLPCIH PG3CLPCIH
extern volatile uint16_t  PG3CLPCIH __attribute__((__sfr__));
__extension__ typedef struct tagPG3CLPCIHBITS {
  union {
    struct {
      uint16_t TQSS:3;
      uint16_t TQPS:1;
      uint16_t LATMOD:1;
      uint16_t SWPCIM:2;
      uint16_t SWPCI:1;
      uint16_t ACP:3;
      uint16_t :1;
      uint16_t BPSEL:3;
      uint16_t BPEN:1;
    };
    struct {
      uint16_t :4;
      uint16_t PCIGT:1;
    };
  };
} PG3CLPCIHBITS;
extern volatile PG3CLPCIHBITS PG3CLPCIHbits __attribute__((__sfr__));

