gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
#define PG3FFPCIL PG3FFPCIL
extern volatile uint16_t  PG3FFPCIL __attribute__((__sfr__));
typedef struct tagPG3FFPCILBITS {
  uint16_t PSS:5;
  uint16_t PPS:1;
  uint16_t PSYNC:1;
  uint16_t SWTERM:1;
  uint16_t AQSS:3;
  uint16_t AQPS:1;
  uint16_t TERM:3;
  uint16_t TSYNCDIS:1;
} PG3FFPCILBITS;
extern volatile PG3FFPCILBITS PG3FFPCILbits __attribute__((__sfr__));

#define PG3FFPCIH PG3FFPCIH
extern volatile uint16_t  PG3FFPCIH __attribute__((__sfr__));
__extension__ typedef struct tagPG3FFPCIHBITS {
  union {
    struct {
      uint16_t TQSS:3;
      uint16_t TQPS:1;
      uint16_t LATMOD:1;
      uint16_t SWPCIM:2;
      uint16_t SWPCI:1;
      uint16_t ACP:3;
      uint16_t :1;
      uint16_t BPSEL:3;
      uint16_t BPEN:1;
    };
    struct {
      uint16_t :4;
      uint16_t PCIGT:1;
    };
  };
} PG3FFPCIHBITS;
extern volatile PG3FFPCIHBITS PG3FFPCIHbits __attribute__((__sfr__));

#define PG3SPCIL PG3SPCIL
extern volatile uint16_t  PG3SPCIL __attribute__((__sfr__));
typedef struct tagPG3SPCILBITS {
  uint16_t PSS:5;
  uint16_t PPS:1;
  uint16_t PSYNC:1;
  uint16_t SWTERM:1;
  uint16_t AQSS:3;
  uint16_t AQPS:1;
  uint16_t TERM:3;
  uint16_t TSYNCDIS:1;
} PG3SPCILBITS;
extern volatile PG3SPCILBITS PG3SPCILbits __attribute__((__sfr__));

#define PG3SPCIH PG3SPCIH
extern volatile uint16_t  PG3SPCIH __attribute__((__sfr__));
__extension__ typedef struct tagPG3SPCIHBITS {
  union {
    struct {
      uint16_t TQSS:3;
      uint16_t TQPS:1;
      uint16_t LATMOD:1;
      uint16_t SWPCIM:2;
      uint16_t SWPCI:1;
      uint16_t ACP:3;
      uint16_t :1;
      uint16_t BPSEL:3;
      uint16_t BPEN:1;
    };
    struct {
      uint16_t :4;
      uint16_t PCIGT:1;
    };
  };
} PG3SPCIHBITS;
extern volatile PG3SPCIHBITS PG3SPCIHbits __attribute__((__sfr__));

#define PG3LEBL PG3LEBL
extern volatile uint16_t  PG3LEBL __attribute__((__sfr__));
#define PG3LEBH PG3LEBH
extern volatile uint16_t  PG3LEBH __attribute__((__sfr__));
typedef struct tagPG3LEBHBITS {
  uint16_t PLF:1;
  uint16_t PLR:1;
  uint16_t PHF:1;
  uint16_t PHR:1;
  uint16_t :4;
  uint16_t PWMPCI:3;
} PG3LEBHBITS;
extern volatile PG3LEBHBITS PG3LEBHbits __attribute__((__sfr__));

#define PG3PHASE PG3PHASE
extern volatile uint16_t  PG3PHASE __attribute__((__sfr__));
#define PG3DC PG3DC
extern volatile uint16_t  PG3DC __attribute__((__sfr__));
#define PG3DCA PG3DCA
extern volatile uint16_t  PG3DCA __attribute__((__sfr__));
typedef struct tagPG3DCABITS {
  uint16_t DCA:8;
} PG3DCABITS;
extern volatile PG3DCABITS PG3DCAbits __attribute__((__sfr__));

#define PG3PER PG3PER
extern volatile uint16_t  PG3PER __attribute__((__sfr__));
#define PG3TRIGA PG3TRIGA
extern volatile uint16_t  PG3TRIGA __attribute__((__sfr__));
#define PG3TRIGB PG3TRIGB
extern volatile uint16_t  PG3TRIGB __attribute__((__sfr__));
#define PG3TRIGC PG3TRIGC
extern volatile uint16_t  PG3TRIGC __attribute__((__sfr__));
#define PG3DTL PG3DTL
extern volatile uint16_t  PG3DTL __attribute__((__sfr__));
typedef struct tagPG3DTLBITS {
  uint16_t DTL:14;
} PG3DTLBITS;
extern volatile PG3DTLBITS PG3DTLbits __attribute__((__sfr__));

#define PG3DTH PG3DTH
extern volatile uint16_t  PG3DTH __attribute__((__sfr__));
typedef struct tagPG3DTHBITS {
  uint16_t DTH:14;
} PG3DTHBITS;
extern volatile PG3DTHBITS PG3DTHbits __attribute__((__sfr__));

#define PG3CAP PG3CAP
extern volatile uint16_t  PG3CAP __attribute__((__sfr__));
#define PG4CONL PG4CONL
extern volatile uint16_t  PG4CONL __attribute__((__sfr__));
typedef struct tagPG4CONLBITS {
  uint16_t MODSEL:3;
  uint16_t CLKSEL:2;
  uint16_t :2;
  uint16_t HREN:1;
  uint16_t TRGCNT:3;
  uint16_t :4;
  uint16_t ON:1;
} PG4CONLBITS;
extern volatile PG4CONLBITS PG4CONLbits __attribute__((__sfr__));

#define PG4CONH PG4CONH
extern volatile uint16_t  PG4CONH __attribute__((__sfr__));
typedef struct tagPG4CONHBITS {
  uint16_t SOCS:4;
  uint16_t :2;
  uint16_t TRGMOD:1;
  uint16_t :1;
  uint16_t UPDMOD:3;
  uint16_t MSTEN:1;
  uint16_t :1;
  uint16_t MPHSEL:1;
  uint16_t MPERSEL:1;
  uint16_t MDCSEL:1;
} PG4CONHBITS;
extern volatile PG4CONHBITS PG4CONHbits __attribute__((__sfr__));

#define PG4STAT PG4STAT
extern volatile uint16_t  PG4STAT __attribute__((__sfr__));
typedef struct tagPG4STATBITS {
  uint16_t TRIG:1;
  uint16_t CAHALF:1;
  uint16_t STEER:1;
  uint16_t UPDREQ:1;
  uint16_t UPDATE:1;
  uint16_t CAP:1;
  uint16_t TRCLR:1;
  uint16_t TRSET:1;
  uint16_t FFACT:1;
  uint16_t CLACT:1;
  uint16_t FLTACT:1;
  uint16_t SACT:1;
  uint16_t FFEVT:1;
  uint16_t CLEVT:1;
  uint16_t FLTEVT:1;
  uint16_t SEVT:1;
} PG4STATBITS;
extern volatile PG4STATBITS PG4STATbits __attribute__((__sfr__));

#define PG4IOCONL PG4IOCONL
extern volatile uint16_t  PG4IOCONL __attribute__((__sfr__));
typedef struct tagPG4IOCONLBITS {
  uint16_t DBDAT:2;
  uint16_t FFDAT:2;
  uint16_t CLDAT:2;
  uint16_t FLTDAT:2;
  uint16_t OSYNC:2;
  uint16_t OVRDAT:2;
  uint16_t OVRENL:1;
  uint16_t OVRENH:1;
  uint16_t SWAP:1;
  uint16_t CLMOD:1;
} PG4IOCONLBITS;
extern volatile PG4IOCONLBITS PG4IOCONLbits __attribute__((__sfr__));

#define PG4IOCONH PG4IOCONH
extern volatile uint16_t  PG4IOCONH __attribute__((__sfr__));
typedef struct tagPG4IOCONHBITS {
  uint16_t POLL:1;
  uint16_t POLH:1;
  uint16_t PENL:1;
  uint16_t PENH:1;
  uint16_t PMOD:2;
  uint16_t :2;
  uint16_t DTCMPSEL:1;
  uint16_t :3;
  uint16_t CAPSRC:3;
} PG4IOCONHBITS;
extern volatile PG4IOCONHBITS PG4IOCONHbits __attribute__((__sfr__));

#define PG4EVTL PG4EVTL
extern volatile uint16_t  PG4EVTL __attribute__((__sfr__));
typedef struct tagPG4EVTLBITS {
  uint16_t PGTRGSEL:3;
  uint16_t UPDTRG:2;
  uint16_t :3;
  uint16_t ADTR1EN1:1;
  uint16_t ADTR1EN2:1;
  uint16_t ADTR1EN3:1;
  uint16_t ADTR1PS:5;
} PG4EVTLBITS;
extern volatile PG4EVTLBITS PG4EVTLbits __attribute__((__sfr__));

#define PG4EVTH PG4EVTH
extern volatile uint16_t  PG4EVTH __attribute__((__sfr__));
typedef struct tagPG4EVTHBITS {
  uint16_t ADTR1OFS:5;
  uint16_t ADTR2EN1:1;
  uint16_t ADTR2EN2:1;
  uint16_t ADTR2EN3:1;
  uint16_t IEVTSEL:2;
  uint16_t :2;
  uint16_t SIEN:1;
  uint16_t FFIEN:1;
  uint16_t CLIEN:1;
  uint16_t FLTIEN:1;
} PG4EVTHBITS;
extern volatile PG4EVTHBITS PG4EVTHbits __attribute__((__sfr__));

