gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
#define PG4FPCIL PG4FPCIL
extern volatile uint16_t  PG4FPCIL __attribute__((__sfr__));
typedef struct tagPG4FPCILBITS {
  uint16_t PSS:5;
  uint16_t PPS:1;
  uint16_t PSYNC:1;
  uint16_t SWTERM:1;
  uint16_t AQSS:3;
  uint16_t AQPS:1;
  uint16_t TERM:3;
  uint16_t TSYNCDIS:1;
} PG4FPCILBITS;
extern volatile PG4FPCILBITS PG4FPCILbits __attribute__((__sfr__));

#define PG4FPCIH PG4FPCIH
extern volatile uint16_t  PG4FPCIH __attribute__((__sfr__));
__extension__ typedef struct tagPG4FPCIHBITS {
  union {
    struct {
      uint16_t TQSS:3;
      uint16_t TQPS:1;
      uint16_t LATMOD:1;
      uint16_t SWPCIM:2;
      uint16_t SWPCI:1;
      uint16_t ACP:3;
      uint16_t :1;
      uint16_t BPSEL:3;
      uint16_t BPEN:1;
    };
    struct {
      uint16_t :4;
      uint16_t PCIGT:1;
    };
  };
} PG4FPCIHBITS;
extern volatile PG4FPCIHBITS PG4FPCIHbits __attribute__((__sfr__));

#define PG4CLPCIL PG4CLPCIL
extern volatile uint16_t  PG4CLPCIL __attribute__((__sfr__));
typedef struct tagPG4CLPCILBITS {
  uint16_t PSS:5;
  uint16_t PPS:1;
  uint16_t PSYNC:1;
  uint16_t SWTERM:1;
  uint16_t AQSS:3;
  uint16_t AQPS:1;
  uint16_t TERM:3;
  uint16_t TSYNCDIS:1;
} PG4CLPCILBITS;
extern volatile PG4CLPCILBITS PG4CLPCILbits __attribute__((__sfr__));

#define PG4CLPCIH PG4CLPCIH
extern volatile uint16_t  PG4CLPCIH __attribute__((__sfr__));
__extension__ typedef struct tagPG4CLPCIHBITS {
  union {
    struct {
      uint16_t TQSS:3;
      uint16_t TQPS:1;
      uint16_t LATMOD:1;
      uint16_t SWPCIM:2;
      uint16_t SWPCI:1;
      uint16_t ACP:3;
      uint16_t :1;
      uint16_t BPSEL:3;
      uint16_t BPEN:1;
    };
    struct {
      uint16_t :4;
      uint16_t PCIGT:1;
    };
  };
} PG4CLPCIHBITS;
extern volatile PG4CLPCIHBITS PG4CLPCIHbits __attribute__((__sfr__));

#define PG4FFPCIL PG4FFPCIL
extern volatile uint16_t  PG4FFPCIL __attribute__((__sfr__));
typedef struct tagPG4FFPCILBITS {
  uint16_t PSS:5;
  uint16_t PPS:1;
  uint16_t PSYNC:1;
  uint16_t SWTERM:1;
  uint16_t AQSS:3;
  uint16_t AQPS:1;
  uint16_t TERM:3;
  uint16_t TSYNCDIS:1;
} PG4FFPCILBITS;
extern volatile PG4FFPCILBITS PG4FFPCILbits __attribute__((__sfr__));

#define PG4FFPCIH PG4FFPCIH
extern volatile uint16_t  PG4FFPCIH __attribute__((__sfr__));
__extension__ typedef struct tagPG4FFPCIHBITS {
  union {
    struct {
      uint16_t TQSS:3;
      uint16_t TQPS:1;
      uint16_t LATMOD:1;
      uint16_t SWPCIM:2;
      uint16_t SWPCI:1;
      uint16_t ACP:3;
      uint16_t :1;
      uint16_t BPSEL:3;
      uint16_t BPEN:1;
    };
    struct {
      uint16_t :4;
      uint16_t PCIGT:1;
    };
  };
} PG4FFPCIHBITS;
extern volatile PG4FFPCIHBITS PG4FFPCIHbits __attribute__((__sfr__));

#define PG4SPCIL PG4SPCIL
extern volatile uint16_t  PG4SPCIL __attribute__((__sfr__));
typedef struct tagPG4SPCILBITS {
  uint16_t PSS:5;
  uint16_t PPS:1;
  uint16_t PSYNC:1;
  uint16_t SWTERM:1;
  uint16_t AQSS:3;
  uint16_t AQPS:1;
  uint16_t TERM:3;
  uint16_t TSYNCDIS:1;
} PG4SPCILBITS;
extern volatile PG4SPCILBITS PG4SPCILbits __attribute__((__sfr__));

#define PG4SPCIH PG4SPCIH
extern volatile uint16_t  PG4SPCIH __attribute__((__sfr__));
__extension__ typedef struct tagPG4SPCIHBITS {
  union {
    struct {
      uint16_t TQSS:3;
      uint16_t TQPS:1;
      uint16_t LATMOD:1;
      uint16_t SWPCIM:2;
      uint16_t SWPCI:1;
      uint16_t ACP:3;
      uint16_t :1;
      uint16_t BPSEL:3;
      uint16_t BPEN:1;
    };
    struct {
      uint16_t :4;
      uint16_t PCIGT:1;
    };
  };
} PG4SPCIHBITS;
extern volatile PG4SPCIHBITS PG4SPCIHbits __attribute__((__sfr__));

#define PG4LEBL PG4LEBL
extern volatile uint16_t  PG4LEBL __attribute__((__sfr__));
#define PG4LEBH PG4LEBH
extern volatile uint16_t  PG4LEBH __attribute__((__sfr__));
typedef struct tagPG4LEBHBITS {
  uint16_t PLF:1;
  uint16_t PLR:1;
  uint16_t PHF:1;
  uint16_t PHR:1;
  uint16_t :4;
  uint16_t PWMPCI:3;
} PG4LEBHBITS;
extern volatile PG4LEBHBITS PG4LEBHbits __attribute__((__sfr__));

#define PG4PHASE PG4PHASE
extern volatile uint16_t  PG4PHASE __attribute__((__sfr__));
#define PG4DC PG4DC
extern volatile uint16_t  PG4DC __attribute__((__sfr__));
#define PG4DCA PG4DCA
extern volatile uint16_t  PG4DCA __attribute__((__sfr__));
typedef struct tagPG4DCABITS {
  uint16_t DCA:8;
} PG4DCABITS;
extern volatile PG4DCABITS PG4DCAbits __attribute__((__sfr__));

#define PG4PER PG4PER
extern volatile uint16_t  PG4PER __attribute__((__sfr__));
#define PG4TRIGA PG4TRIGA
extern volatile uint16_t  PG4TRIGA __attribute__((__sfr__));
#define PG4TRIGB PG4TRIGB
extern volatile uint16_t  PG4TRIGB __attribute__((__sfr__));
#define PG4TRIGC PG4TRIGC
extern volatile uint16_t  PG4TRIGC __attribute__((__sfr__));
#define PG4DTL PG4DTL
extern volatile uint16_t  PG4DTL __attribute__((__sfr__));
typedef struct tagPG4DTLBITS {
  uint16_t DTL:14;
} PG4DTLBITS;
extern volatile PG4DTLBITS PG4DTLbits __attribute__((__sfr__));

#define PG4DTH PG4DTH
extern volatile uint16_t  PG4DTH __attribute__((__sfr__));
typedef struct tagPG4DTHBITS {
  uint16_t DTH:14;
} PG4DTHBITS;
extern volatile PG4DTHBITS PG4DTHbits __attribute__((__sfr__));

#define PG4CAP PG4CAP
extern volatile uint16_t  PG4CAP __attribute__((__sfr__));
#define PG5CONL PG5CONL
extern volatile uint16_t  PG5CONL __attribute__((__sfr__));
typedef struct tagPG5CONLBITS {
  uint16_t MODSEL:3;
  uint16_t CLKSEL:2;
  uint16_t :2;
  uint16_t HREN:1;
  uint16_t TRGCNT:3;
  uint16_t :4;
  uint16_t ON:1;
} PG5CONLBITS;
extern volatile PG5CONLBITS PG5CONLbits __attribute__((__sfr__));

#define PG5CONH PG5CONH
extern volatile uint16_t  PG5CONH __attribute__((__sfr__));
typedef struct tagPG5CONHBITS {
  uint16_t SOCS:4;
  uint16_t :2;
  uint16_t TRGMOD:1;
  uint16_t :1;
  uint16_t UPDMOD:3;
  uint16_t MSTEN:1;
  uint16_t :1;
  uint16_t MPHSEL:1;
  uint16_t MPERSEL:1;
  uint16_t MDCSEL:1;
} PG5CONHBITS;
extern volatile PG5CONHBITS PG5CONHbits __attribute__((__sfr__));

#define PG5STAT PG5STAT
extern volatile uint16_t  PG5STAT __attribute__((__sfr__));
typedef struct tagPG5STATBITS {
  uint16_t TRIG:1;
  uint16_t CAHALF:1;
  uint16_t STEER:1;
  uint16_t UPDREQ:1;
  uint16_t UPDATE:1;
  uint16_t CAP:1;
  uint16_t TRCLR:1;
  uint16_t TRSET:1;
  uint16_t FFACT:1;
  uint16_t CLACT:1;
  uint16_t FLTACT:1;
  uint16_t SACT:1;
  uint16_t FFEVT:1;
  uint16_t CLEVT:1;
  uint16_t FLTEVT:1;
  uint16_t SEVT:1;
} PG5STATBITS;
extern volatile PG5STATBITS PG5STATbits __attribute__((__sfr__));

#define PG5IOCONL PG5IOCONL
extern volatile uint16_t  PG5IOCONL __attribute__((__sfr__));
typedef struct tagPG5IOCONLBITS {
  uint16_t DBDAT:2;
  uint16_t FFDAT:2;
  uint16_t CLDAT:2;
  uint16_t FLTDAT:2;
  uint16_t OSYNC:2;
  uint16_t OVRDAT:2;
  uint16_t OVRENL:1;
  uint16_t OVRENH:1;
  uint16_t SWAP:1;
  uint16_t CLMOD:1;
} PG5IOCONLBITS;
