gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
extern volatile PG5IOCONLBITS PG5IOCONLbits __attribute__((__sfr__));

#define PG5IOCONH PG5IOCONH
extern volatile uint16_t  PG5IOCONH __attribute__((__sfr__));
typedef struct tagPG5IOCONHBITS {
  uint16_t POLL:1;
  uint16_t POLH:1;
  uint16_t PENL:1;
  uint16_t PENH:1;
  uint16_t PMOD:2;
  uint16_t :2;
  uint16_t DTCMPSEL:1;
  uint16_t :3;
  uint16_t CAPSRC:3;
} PG5IOCONHBITS;
extern volatile PG5IOCONHBITS PG5IOCONHbits __attribute__((__sfr__));

#define PG5EVTL PG5EVTL
extern volatile uint16_t  PG5EVTL __attribute__((__sfr__));
typedef struct tagPG5EVTLBITS {
  uint16_t PGTRGSEL:3;
  uint16_t UPDTRG:2;
  uint16_t :3;
  uint16_t ADTR1EN1:1;
  uint16_t ADTR1EN2:1;
  uint16_t ADTR1EN3:1;
  uint16_t ADTR1PS:5;
} PG5EVTLBITS;
extern volatile PG5EVTLBITS PG5EVTLbits __attribute__((__sfr__));

#define PG5EVTH PG5EVTH
extern volatile uint16_t  PG5EVTH __attribute__((__sfr__));
typedef struct tagPG5EVTHBITS {
  uint16_t ADTR1OFS:5;
  uint16_t ADTR2EN1:1;
  uint16_t ADTR2EN2:1;
  uint16_t ADTR2EN3:1;
  uint16_t IEVTSEL:2;
  uint16_t :2;
  uint16_t SIEN:1;
  uint16_t FFIEN:1;
  uint16_t CLIEN:1;
  uint16_t FLTIEN:1;
} PG5EVTHBITS;
extern volatile PG5EVTHBITS PG5EVTHbits __attribute__((__sfr__));

#define PG5FPCIL PG5FPCIL
extern volatile uint16_t  PG5FPCIL __attribute__((__sfr__));
typedef struct tagPG5FPCILBITS {
  uint16_t PSS:5;
  uint16_t PPS:1;
  uint16_t PSYNC:1;
  uint16_t SWTERM:1;
  uint16_t AQSS:3;
  uint16_t AQPS:1;
  uint16_t TERM:3;
  uint16_t TSYNCDIS:1;
} PG5FPCILBITS;
extern volatile PG5FPCILBITS PG5FPCILbits __attribute__((__sfr__));

#define PG5FPCIH PG5FPCIH
extern volatile uint16_t  PG5FPCIH __attribute__((__sfr__));
__extension__ typedef struct tagPG5FPCIHBITS {
  union {
    struct {
      uint16_t TQSS:3;
      uint16_t TQPS:1;
      uint16_t LATMOD:1;
      uint16_t SWPCIM:2;
      uint16_t SWPCI:1;
      uint16_t ACP:3;
      uint16_t :1;
      uint16_t BPSEL:3;
      uint16_t BPEN:1;
    };
    struct {
      uint16_t :4;
      uint16_t PCIGT:1;
    };
  };
} PG5FPCIHBITS;
extern volatile PG5FPCIHBITS PG5FPCIHbits __attribute__((__sfr__));

#define PG5CLPCIL PG5CLPCIL
extern volatile uint16_t  PG5CLPCIL __attribute__((__sfr__));
typedef struct tagPG5CLPCILBITS {
  uint16_t PSS:5;
  uint16_t PPS:1;
  uint16_t PSYNC:1;
  uint16_t SWTERM:1;
  uint16_t AQSS:3;
  uint16_t AQPS:1;
  uint16_t TERM:3;
  uint16_t TSYNCDIS:1;
} PG5CLPCILBITS;
extern volatile PG5CLPCILBITS PG5CLPCILbits __attribute__((__sfr__));

#define PG5CLPCIH PG5CLPCIH
extern volatile uint16_t  PG5CLPCIH __attribute__((__sfr__));
__extension__ typedef struct tagPG5CLPCIHBITS {
  union {
    struct {
      uint16_t TQSS:3;
      uint16_t TQPS:1;
      uint16_t LATMOD:1;
      uint16_t SWPCIM:2;
      uint16_t SWPCI:1;
      uint16_t ACP:3;
      uint16_t :1;
      uint16_t BPSEL:3;
      uint16_t BPEN:1;
    };
    struct {
      uint16_t :4;
      uint16_t PCIGT:1;
    };
  };
} PG5CLPCIHBITS;
extern volatile PG5CLPCIHBITS PG5CLPCIHbits __attribute__((__sfr__));

#define PG5FFPCIL PG5FFPCIL
extern volatile uint16_t  PG5FFPCIL __attribute__((__sfr__));
typedef struct tagPG5FFPCILBITS {
  uint16_t PSS:5;
  uint16_t PPS:1;
  uint16_t PSYNC:1;
  uint16_t SWTERM:1;
  uint16_t AQSS:3;
  uint16_t AQPS:1;
  uint16_t TERM:3;
  uint16_t TSYNCDIS:1;
} PG5FFPCILBITS;
extern volatile PG5FFPCILBITS PG5FFPCILbits __attribute__((__sfr__));

#define PG5FFPCIH PG5FFPCIH
extern volatile uint16_t  PG5FFPCIH __attribute__((__sfr__));
__extension__ typedef struct tagPG5FFPCIHBITS {
  union {
    struct {
      uint16_t TQSS:3;
      uint16_t TQPS:1;
      uint16_t LATMOD:1;
      uint16_t SWPCIM:2;
      uint16_t SWPCI:1;
      uint16_t ACP:3;
      uint16_t :1;
      uint16_t BPSEL:3;
      uint16_t BPEN:1;
    };
    struct {
      uint16_t :4;
      uint16_t PCIGT:1;
    };
  };
} PG5FFPCIHBITS;
extern volatile PG5FFPCIHBITS PG5FFPCIHbits __attribute__((__sfr__));

#define PG5SPCIL PG5SPCIL
extern volatile uint16_t  PG5SPCIL __attribute__((__sfr__));
typedef struct tagPG5SPCILBITS {
  uint16_t PSS:5;
  uint16_t PPS:1;
  uint16_t PSYNC:1;
  uint16_t SWTERM:1;
  uint16_t AQSS:3;
  uint16_t AQPS:1;
  uint16_t TERM:3;
  uint16_t TSYNCDIS:1;
} PG5SPCILBITS;
extern volatile PG5SPCILBITS PG5SPCILbits __attribute__((__sfr__));

#define PG5SPCIH PG5SPCIH
extern volatile uint16_t  PG5SPCIH __attribute__((__sfr__));
__extension__ typedef struct tagPG5SPCIHBITS {
  union {
    struct {
      uint16_t TQSS:3;
      uint16_t TQPS:1;
      uint16_t LATMOD:1;
      uint16_t SWPCIM:2;
      uint16_t SWPCI:1;
      uint16_t ACP:3;
      uint16_t :1;
      uint16_t BPSEL:3;
      uint16_t BPEN:1;
    };
    struct {
      uint16_t :4;
      uint16_t PCIGT:1;
    };
  };
} PG5SPCIHBITS;
extern volatile PG5SPCIHBITS PG5SPCIHbits __attribute__((__sfr__));

#define PG5LEBL PG5LEBL
extern volatile uint16_t  PG5LEBL __attribute__((__sfr__));
#define PG5LEBH PG5LEBH
extern volatile uint16_t  PG5LEBH __attribute__((__sfr__));
typedef struct tagPG5LEBHBITS {
  uint16_t PLF:1;
  uint16_t PLR:1;
  uint16_t PHF:1;
  uint16_t PHR:1;
  uint16_t :4;
  uint16_t PWMPCI:3;
} PG5LEBHBITS;
extern volatile PG5LEBHBITS PG5LEBHbits __attribute__((__sfr__));

#define PG5PHASE PG5PHASE
extern volatile uint16_t  PG5PHASE __attribute__((__sfr__));
#define PG5DC PG5DC
extern volatile uint16_t  PG5DC __attribute__((__sfr__));
#define PG5DCA PG5DCA
extern volatile uint16_t  PG5DCA __attribute__((__sfr__));
typedef struct tagPG5DCABITS {
  uint16_t DCA:8;
} PG5DCABITS;
extern volatile PG5DCABITS PG5DCAbits __attribute__((__sfr__));

#define PG5PER PG5PER
extern volatile uint16_t  PG5PER __attribute__((__sfr__));
#define PG5TRIGA PG5TRIGA
extern volatile uint16_t  PG5TRIGA __attribute__((__sfr__));
#define PG5TRIGB PG5TRIGB
extern volatile uint16_t  PG5TRIGB __attribute__((__sfr__));
#define PG5TRIGC PG5TRIGC
extern volatile uint16_t  PG5TRIGC __attribute__((__sfr__));
#define PG5DTL PG5DTL
extern volatile uint16_t  PG5DTL __attribute__((__sfr__));
typedef struct tagPG5DTLBITS {
  uint16_t DTL:14;
} PG5DTLBITS;
extern volatile PG5DTLBITS PG5DTLbits __attribute__((__sfr__));

#define PG5DTH PG5DTH
extern volatile uint16_t  PG5DTH __attribute__((__sfr__));
typedef struct tagPG5DTHBITS {
  uint16_t DTH:14;
} PG5DTHBITS;
extern volatile PG5DTHBITS PG5DTHbits __attribute__((__sfr__));

#define PG5CAP PG5CAP
extern volatile uint16_t  PG5CAP __attribute__((__sfr__));
#define PG6CONL PG6CONL
extern volatile uint16_t  PG6CONL __attribute__((__sfr__));
typedef struct tagPG6CONLBITS {
  uint16_t MODSEL:3;
  uint16_t CLKSEL:2;
  uint16_t :2;
  uint16_t HREN:1;
  uint16_t TRGCNT:3;
  uint16_t :4;
  uint16_t ON:1;
} PG6CONLBITS;
extern volatile PG6CONLBITS PG6CONLbits __attribute__((__sfr__));

#define PG6CONH PG6CONH
extern volatile uint16_t  PG6CONH __attribute__((__sfr__));
typedef struct tagPG6CONHBITS {
  uint16_t SOCS:4;
  uint16_t :2;
  uint16_t TRGMOD:1;
  uint16_t :1;
  uint16_t UPDMOD:3;
  uint16_t MSTEN:1;
  uint16_t :1;
  uint16_t MPHSEL:1;
  uint16_t MPERSEL:1;
  uint16_t MDCSEL:1;
} PG6CONHBITS;
extern volatile PG6CONHBITS PG6CONHbits __attribute__((__sfr__));

#define PG6STAT PG6STAT
extern volatile uint16_t  PG6STAT __attribute__((__sfr__));
typedef struct tagPG6STATBITS {
  uint16_t TRIG:1;
  uint16_t CAHALF:1;
  uint16_t STEER:1;
  uint16_t UPDREQ:1;
  uint16_t UPDATE:1;
  uint16_t CAP:1;
  uint16_t TRCLR:1;
  uint16_t TRSET:1;
  uint16_t FFACT:1;
  uint16_t CLACT:1;
  uint16_t FLTACT:1;
  uint16_t SACT:1;
  uint16_t FFEVT:1;
  uint16_t CLEVT:1;
  uint16_t FLTEVT:1;
  uint16_t SEVT:1;
} PG6STATBITS;
extern volatile PG6STATBITS PG6STATbits __attribute__((__sfr__));

#define PG6IOCONL PG6IOCONL
extern volatile uint16_t  PG6IOCONL __attribute__((__sfr__));
typedef struct tagPG6IOCONLBITS {
  uint16_t DBDAT:2;
  uint16_t FFDAT:2;
  uint16_t CLDAT:2;
  uint16_t FLTDAT:2;
  uint16_t OSYNC:2;
  uint16_t OVRDAT:2;
  uint16_t OVRENL:1;
  uint16_t OVRENH:1;
  uint16_t SWAP:1;
  uint16_t CLMOD:1;
} PG6IOCONLBITS;
