gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
extern volatile C1TBCLBITS C1TBCLbits __attribute__((__sfr__));

#define C1TBCH C1TBCH
extern volatile uint16_t  C1TBCH __attribute__((__sfr__));
__extension__ typedef struct tagC1TBCHBITS {
  union {
    struct {
      uint16_t TBC:16;
    };
    struct {
      uint16_t TBC16:1;
      uint16_t TBC17:1;
      uint16_t TBC18:1;
      uint16_t TBC19:1;
      uint16_t TBC20:1;
      uint16_t TBC21:1;
      uint16_t TBC22:1;
      uint16_t TBC23:1;
      uint16_t TBC24:1;
      uint16_t TBC25:1;
      uint16_t TBC26:1;
      uint16_t TBC27:1;
      uint16_t TBC28:1;
      uint16_t TBC29:1;
      uint16_t TBC30:1;
      uint16_t TBC31:1;
    };
  };
} C1TBCHBITS;
extern volatile C1TBCHBITS C1TBCHbits __attribute__((__sfr__));

#define C1TSCONL C1TSCONL
extern volatile uint16_t  C1TSCONL __attribute__((__sfr__));
__extension__ typedef struct tagC1TSCONLBITS {
  union {
    struct {
      uint16_t TBCPRE:10;
    };
    struct {
      uint16_t TBCPRE0:1;
      uint16_t TBCPRE1:1;
      uint16_t TBCPRE2:1;
      uint16_t TBCPRE3:1;
      uint16_t TBCPRE4:1;
      uint16_t TBCPRE5:1;
      uint16_t TBCPRE6:1;
      uint16_t TBCPRE7:1;
      uint16_t TBCPRE8:1;
      uint16_t TBCPRE9:1;
    };
  };
} C1TSCONLBITS;
extern volatile C1TSCONLBITS C1TSCONLbits __attribute__((__sfr__));

#define C1TSCONH C1TSCONH
extern volatile uint16_t  C1TSCONH __attribute__((__sfr__));
typedef struct tagC1TSCONHBITS {
  uint16_t TBCEN:1;
  uint16_t TSEOF:1;
  uint16_t TSRES:1;
} C1TSCONHBITS;
extern volatile C1TSCONHBITS C1TSCONHbits __attribute__((__sfr__));

#define C1VECL C1VECL
extern volatile uint16_t  C1VECL __attribute__((__sfr__));
__extension__ typedef struct tagC1VECLBITS {
  union {
    struct {
      uint16_t ICODE:7;
      uint16_t :1;
      uint16_t FILHIT:5;
    };
    struct {
      uint16_t ICODE0:1;
      uint16_t ICODE1:1;
      uint16_t ICODE2:1;
      uint16_t ICODE3:1;
      uint16_t ICODE4:1;
      uint16_t ICODE5:1;
      uint16_t ICODE6:1;
      uint16_t :1;
      uint16_t FILHIT0:1;
      uint16_t FILHIT1:1;
      uint16_t FILHIT2:1;
      uint16_t FILHIT3:1;
      uint16_t FILHIT4:1;
    };
  };
} C1VECLBITS;
extern volatile C1VECLBITS C1VECLbits __attribute__((__sfr__));

#define C1VECH C1VECH
extern volatile uint16_t  C1VECH __attribute__((__sfr__));
__extension__ typedef struct tagC1VECHBITS {
  union {
    struct {
      uint16_t TXCODE:7;
      uint16_t :1;
      uint16_t RXCODE:7;
    };
    struct {
      uint16_t TXCODE0:1;
      uint16_t TXCODE1:1;
      uint16_t TXCODE2:1;
      uint16_t TXCODE3:1;
      uint16_t TXCODE4:1;
      uint16_t TXCODE5:1;
      uint16_t TXCODE6:1;
      uint16_t :1;
      uint16_t RXCODE0:1;
      uint16_t RXCODE1:1;
      uint16_t RXCODE2:1;
      uint16_t RXCODE3:1;
      uint16_t RXCODE4:1;
      uint16_t RXCODE5:1;
      uint16_t RXCODE6:1;
    };
  };
} C1VECHBITS;
extern volatile C1VECHBITS C1VECHbits __attribute__((__sfr__));

#define C1INTL C1INTL
extern volatile uint16_t  C1INTL __attribute__((__sfr__));
typedef struct tagC1INTLBITS {
  uint16_t TXIF:1;
  uint16_t RXIF:1;
  uint16_t TBCIF:1;
  uint16_t MODIF:1;
  uint16_t TEFIF:1;
  uint16_t :5;
  uint16_t TXATIF:1;
  uint16_t RXOVIF:1;
  uint16_t SERRIF:1;
  uint16_t CERRIF:1;
  uint16_t WAKIF:1;
  uint16_t IVMIF:1;
} C1INTLBITS;
extern volatile C1INTLBITS C1INTLbits __attribute__((__sfr__));

#define C1INTH C1INTH
extern volatile uint16_t  C1INTH __attribute__((__sfr__));
typedef struct tagC1INTHBITS {
  uint16_t TXIE:1;
  uint16_t RXIE:1;
  uint16_t TBCIE:1;
  uint16_t MODIE:1;
  uint16_t TEFIE:1;
  uint16_t :5;
  uint16_t TXATIE:1;
  uint16_t RXOVIE:1;
  uint16_t SERRIE:1;
  uint16_t CERRIE:1;
  uint16_t WAKIE:1;
  uint16_t IVMIE:1;
} C1INTHBITS;
extern volatile C1INTHBITS C1INTHbits __attribute__((__sfr__));

#define C1RXIFL C1RXIFL
extern volatile uint16_t  C1RXIFL __attribute__((__sfr__));
__extension__ typedef struct tagC1RXIFLBITS {
  union {
    struct {
      uint16_t :1;
      uint16_t RFIF:15;
    };
    struct {
      uint16_t :1;
      uint16_t RFIF1:1;
      uint16_t RFIF2:1;
      uint16_t RFIF3:1;
      uint16_t RFIF4:1;
      uint16_t RFIF5:1;
      uint16_t RFIF6:1;
      uint16_t RFIF7:1;
      uint16_t RFIF8:1;
      uint16_t RFIF9:1;
      uint16_t RFIF10:1;
      uint16_t RFIF11:1;
      uint16_t RFIF12:1;
      uint16_t RFIF13:1;
      uint16_t RFIF14:1;
      uint16_t RFIF15:1;
    };
  };
} C1RXIFLBITS;
extern volatile C1RXIFLBITS C1RXIFLbits __attribute__((__sfr__));

#define C1RXIFH C1RXIFH
extern volatile uint16_t  C1RXIFH __attribute__((__sfr__));
__extension__ typedef struct tagC1RXIFHBITS {
  union {
    struct {
      uint16_t RFIF:16;
    };
    struct {
      uint16_t RFIF16:1;
      uint16_t RFIF17:1;
      uint16_t RFIF18:1;
      uint16_t RFIF19:1;
      uint16_t RFIF20:1;
      uint16_t RFIF21:1;
      uint16_t RFIF22:1;
      uint16_t RFIF23:1;
      uint16_t RFIF24:1;
      uint16_t RFIF25:1;
      uint16_t RFIF26:1;
      uint16_t RFIF27:1;
      uint16_t RFIF28:1;
      uint16_t RFIF29:1;
      uint16_t RFIF30:1;
      uint16_t RFIF31:1;
    };
  };
} C1RXIFHBITS;
extern volatile C1RXIFHBITS C1RXIFHbits __attribute__((__sfr__));

#define C1TXIFL C1TXIFL
extern volatile uint16_t  C1TXIFL __attribute__((__sfr__));
__extension__ typedef struct tagC1TXIFLBITS {
  union {
    struct {
      uint16_t TFIF:16;
    };
    struct {
      uint16_t TFIF0:1;
      uint16_t TFIF1:1;
      uint16_t TFIF2:1;
      uint16_t TFIF3:1;
      uint16_t TFIF4:1;
      uint16_t TFIF5:1;
      uint16_t TFIF6:1;
      uint16_t TFIF7:1;
      uint16_t TFIF8:1;
      uint16_t TFIF9:1;
      uint16_t TFIF10:1;
      uint16_t TFIF11:1;
      uint16_t TFIF12:1;
      uint16_t TFIF13:1;
      uint16_t TFIF14:1;
      uint16_t TFIF15:1;
    };
  };
} C1TXIFLBITS;
extern volatile C1TXIFLBITS C1TXIFLbits __attribute__((__sfr__));

#define C1TXIFH C1TXIFH
extern volatile uint16_t  C1TXIFH __attribute__((__sfr__));
__extension__ typedef struct tagC1TXIFHBITS {
  union {
    struct {
      uint16_t TFIF:16;
    };
    struct {
      uint16_t TFIF16:1;
      uint16_t TFIF17:1;
      uint16_t TFIF18:1;
      uint16_t TFIF19:1;
      uint16_t TFIF20:1;
      uint16_t TFIF21:1;
      uint16_t TFIF22:1;
      uint16_t TFIF23:1;
      uint16_t TFIF24:1;
      uint16_t TFIF25:1;
      uint16_t TFIF26:1;
      uint16_t TFIF27:1;
      uint16_t TFIF28:1;
      uint16_t TFIF29:1;
      uint16_t TFIF30:1;
      uint16_t TFIF31:1;
    };
  };
} C1TXIFHBITS;
extern volatile C1TXIFHBITS C1TXIFHbits __attribute__((__sfr__));

#define C1RXOVIFL C1RXOVIFL
extern volatile uint16_t  C1RXOVIFL __attribute__((__sfr__));
__extension__ typedef struct tagC1RXOVIFLBITS {
  union {
    struct {
      uint16_t :1;
      uint16_t RFOVIF:15;
    };
    struct {
      uint16_t :1;
      uint16_t RFOVIF1:1;
      uint16_t RFOVIF2:1;
      uint16_t RFOVIF3:1;
      uint16_t RFOVIF4:1;
      uint16_t RFOVIF5:1;
      uint16_t RFOVIF6:1;
      uint16_t RFOVIF7:1;
      uint16_t RFOVIF8:1;
      uint16_t RFOVIF9:1;
      uint16_t RFOVIF10:1;
      uint16_t RFOVIF11:1;
      uint16_t RFOVIF12:1;
      uint16_t RFOVIF13:1;
      uint16_t RFOVIF14:1;
      uint16_t RFOVIF15:1;
    };
  };
} C1RXOVIFLBITS;
