gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
extern volatile C1RXOVIFLBITS C1RXOVIFLbits __attribute__((__sfr__));

#define C1RXOVIFH C1RXOVIFH
extern volatile uint16_t  C1RXOVIFH __attribute__((__sfr__));
__extension__ typedef struct tagC1RXOVIFHBITS {
  union {
    struct {
      uint16_t RFOVIF:16;
    };
    struct {
      uint16_t RFOVIF16:1;
      uint16_t RFOVIF17:1;
      uint16_t RFOVIF18:1;
      uint16_t RFOVIF19:1;
      uint16_t RFOVIF20:1;
      uint16_t RFOVIF21:1;
      uint16_t RFOVIF22:1;
      uint16_t RFOVIF23:1;
      uint16_t RFOVIF24:1;
      uint16_t RFOVIF25:1;
      uint16_t RFOVIF26:1;
      uint16_t RFOVIF27:1;
      uint16_t RFOVIF28:1;
      uint16_t RFOVIF29:1;
      uint16_t RFOVIF30:1;
      uint16_t RFOVIF31:1;
    };
  };
} C1RXOVIFHBITS;
extern volatile C1RXOVIFHBITS C1RXOVIFHbits __attribute__((__sfr__));

#define C1TXATIFL C1TXATIFL
extern volatile uint16_t  C1TXATIFL __attribute__((__sfr__));
__extension__ typedef struct tagC1TXATIFLBITS {
  union {
    struct {
      uint16_t TFATIF:16;
    };
    struct {
      uint16_t TFATIF0:1;
      uint16_t TFATIF1:1;
      uint16_t TFATIF2:1;
      uint16_t TFATIF3:1;
      uint16_t TFATIF4:1;
      uint16_t TFATIF5:1;
      uint16_t TFATIF6:1;
      uint16_t TFATIF7:1;
      uint16_t TFATIF8:1;
      uint16_t TFATIF9:1;
      uint16_t TFATIF10:1;
      uint16_t TFATIF11:1;
      uint16_t TFATIF12:1;
      uint16_t TFATIF13:1;
      uint16_t TFATIF14:1;
      uint16_t TFATIF15:1;
    };
  };
} C1TXATIFLBITS;
extern volatile C1TXATIFLBITS C1TXATIFLbits __attribute__((__sfr__));

#define C1TXATIFH C1TXATIFH
extern volatile uint16_t  C1TXATIFH __attribute__((__sfr__));
__extension__ typedef struct tagC1TXATIFHBITS {
  union {
    struct {
      uint16_t TFATIF:16;
    };
    struct {
      uint16_t TFATIF16:1;
      uint16_t TFATIF17:1;
      uint16_t TFATIF18:1;
      uint16_t TFATIF19:1;
      uint16_t TFATIF20:1;
      uint16_t TFATIF21:1;
      uint16_t TFATIF22:1;
      uint16_t TFATIF23:1;
      uint16_t TFATIF24:1;
      uint16_t TFATIF25:1;
      uint16_t TFATIF26:1;
      uint16_t TFATIF27:1;
      uint16_t TFATIF28:1;
      uint16_t TFATIF29:1;
      uint16_t TFATIF30:1;
      uint16_t TFATIF31:1;
    };
  };
} C1TXATIFHBITS;
extern volatile C1TXATIFHBITS C1TXATIFHbits __attribute__((__sfr__));

#define C1TXREQL C1TXREQL
extern volatile uint16_t  C1TXREQL __attribute__((__sfr__));
__extension__ typedef struct tagC1TXREQLBITS {
  union {
    struct {
      uint16_t TXREQ:16;
    };
    struct {
      uint16_t TXREQ0:1;
      uint16_t TXREQ1:1;
      uint16_t TXREQ2:1;
      uint16_t TXREQ3:1;
      uint16_t TXREQ4:1;
      uint16_t TXREQ5:1;
      uint16_t TXREQ6:1;
      uint16_t TXREQ7:1;
      uint16_t TXREQ8:1;
      uint16_t TXREQ9:1;
      uint16_t TXREQ10:1;
      uint16_t TXREQ11:1;
      uint16_t TXREQ12:1;
      uint16_t TXREQ13:1;
      uint16_t TXREQ14:1;
      uint16_t TXREQ15:1;
    };
  };
} C1TXREQLBITS;
extern volatile C1TXREQLBITS C1TXREQLbits __attribute__((__sfr__));

#define C1TXREQH C1TXREQH
extern volatile uint16_t  C1TXREQH __attribute__((__sfr__));
__extension__ typedef struct tagC1TXREQHBITS {
  union {
    struct {
      uint16_t TXREQ:16;
    };
    struct {
      uint16_t TXREQ16:1;
      uint16_t TXREQ17:1;
      uint16_t TXREQ18:1;
      uint16_t TXREQ19:1;
      uint16_t TXREQ20:1;
      uint16_t TXREQ21:1;
      uint16_t TXREQ22:1;
      uint16_t TXREQ23:1;
      uint16_t TXREQ24:1;
      uint16_t TXREQ25:1;
      uint16_t TXREQ26:1;
      uint16_t TXREQ27:1;
      uint16_t TXREQ28:1;
      uint16_t TXREQ29:1;
      uint16_t TXREQ30:1;
      uint16_t TXREQ31:1;
    };
  };
} C1TXREQHBITS;
extern volatile C1TXREQHBITS C1TXREQHbits __attribute__((__sfr__));

#define C1TRECL C1TRECL
extern volatile uint16_t  C1TRECL __attribute__((__sfr__));
__extension__ typedef struct tagC1TRECLBITS {
  union {
    struct {
      uint16_t RERRCNT:8;
      uint16_t TERRCNT:8;
    };
    struct {
      uint16_t RERRCNT0:1;
      uint16_t RERRCNT1:1;
      uint16_t RERRCNT2:1;
      uint16_t RERRCNT3:1;
      uint16_t RERRCNT4:1;
      uint16_t RERRCNT5:1;
      uint16_t RERRCNT6:1;
      uint16_t RERRCNT7:1;
      uint16_t TERRCNT0:1;
      uint16_t TERRCNT1:1;
      uint16_t TERRCNT2:1;
      uint16_t TERRCNT3:1;
      uint16_t TERRCNT4:1;
      uint16_t TERRCNT5:1;
      uint16_t TERRCNT6:1;
      uint16_t TERRCNT7:1;
    };
  };
} C1TRECLBITS;
extern volatile C1TRECLBITS C1TRECLbits __attribute__((__sfr__));

#define C1TRECH C1TRECH
extern volatile uint16_t  C1TRECH __attribute__((__sfr__));
typedef struct tagC1TRECHBITS {
  uint16_t EWARN:1;
  uint16_t RXWARN:1;
  uint16_t TXWARN:1;
  uint16_t RXBP:1;
  uint16_t TXBP:1;
  uint16_t TXBO:1;
} C1TRECHBITS;
extern volatile C1TRECHBITS C1TRECHbits __attribute__((__sfr__));

#define C1BDIAG0L C1BDIAG0L
extern volatile uint16_t  C1BDIAG0L __attribute__((__sfr__));
__extension__ typedef struct tagC1BDIAG0LBITS {
  union {
    struct {
      uint16_t NRERRCNT:8;
      uint16_t NTERRCNT:8;
    };
    struct {
      uint16_t NRERRCNT0:1;
      uint16_t NRERRCNT1:1;
      uint16_t NRERRCNT2:1;
      uint16_t NRERRCNT3:1;
      uint16_t NRERRCNT4:1;
      uint16_t NRERRCNT5:1;
      uint16_t NRERRCNT6:1;
      uint16_t NRERRCNT7:1;
      uint16_t NTERRCNT0:1;
      uint16_t NTERRCNT1:1;
      uint16_t NTERRCNT2:1;
      uint16_t NTERRCNT3:1;
      uint16_t NTERRCNT4:1;
      uint16_t NTERRCNT5:1;
      uint16_t NTERRCNT6:1;
      uint16_t NTERRCNT7:1;
    };
  };
} C1BDIAG0LBITS;
extern volatile C1BDIAG0LBITS C1BDIAG0Lbits __attribute__((__sfr__));

#define C1BDIAG0H C1BDIAG0H
extern volatile uint16_t  C1BDIAG0H __attribute__((__sfr__));
__extension__ typedef struct tagC1BDIAG0HBITS {
  union {
    struct {
      uint16_t DRERRCNT:8;
      uint16_t DTERRCNT:8;
    };
    struct {
      uint16_t DRERRCNT0:1;
      uint16_t DRERRCNT1:1;
      uint16_t DRERRCNT2:1;
      uint16_t DRERRCNT3:1;
      uint16_t DRERRCNT4:1;
      uint16_t DRERRCNT5:1;
      uint16_t DRERRCNT6:1;
      uint16_t DRERRCNT7:1;
      uint16_t DTERRCNT0:1;
      uint16_t DTERRCNT1:1;
      uint16_t DTERRCNT2:1;
      uint16_t DTERRCNT3:1;
      uint16_t DTERRCNT4:1;
      uint16_t DTERRCNT5:1;
      uint16_t DTERRCNT6:1;
      uint16_t DTERRCNT7:1;
    };
  };
} C1BDIAG0HBITS;
extern volatile C1BDIAG0HBITS C1BDIAG0Hbits __attribute__((__sfr__));

