gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
extern volatile C1TXQCONHBITS C1TXQCONHbits __attribute__((__sfr__));

#define C1TXQSTA C1TXQSTA
extern volatile uint16_t  C1TXQSTA __attribute__((__sfr__));
__extension__ typedef struct tagC1TXQSTABITS {
  union {
    struct {
      uint16_t TXQNIF:1;
      uint16_t :1;
      uint16_t TXQEIF:1;
      uint16_t :1;
      uint16_t TXATIF:1;
      uint16_t TXERR:1;
      uint16_t TXLARB:1;
      uint16_t TXABT:1;
      uint16_t TXQCI:5;
    };
    struct {
      uint16_t :8;
      uint16_t TXQCI0:1;
      uint16_t TXQCI1:1;
      uint16_t TXQCI2:1;
      uint16_t TXQCI3:1;
      uint16_t TXQCI4:1;
    };
  };
} C1TXQSTABITS;
extern volatile C1TXQSTABITS C1TXQSTAbits __attribute__((__sfr__));

#define C1TXQUAL C1TXQUAL
extern volatile uint16_t  C1TXQUAL __attribute__((__sfr__));
__extension__ typedef struct tagC1TXQUALBITS {
  union {
    struct {
      uint16_t TXQUA:16;
    };
    struct {
      uint16_t TXQUA0:1;
      uint16_t TXQUA1:1;
      uint16_t TXQUA2:1;
      uint16_t TXQUA3:1;
      uint16_t TXQUA4:1;
      uint16_t TXQUA5:1;
      uint16_t TXQUA6:1;
      uint16_t TXQUA7:1;
      uint16_t TXQUA8:1;
      uint16_t TXQUA9:1;
      uint16_t TXQUA10:1;
      uint16_t TXQUA11:1;
      uint16_t TXQUA12:1;
      uint16_t TXQUA13:1;
      uint16_t TXQUA14:1;
      uint16_t TXQUA15:1;
    };
  };
} C1TXQUALBITS;
extern volatile C1TXQUALBITS C1TXQUALbits __attribute__((__sfr__));

#define C1TXQUAH C1TXQUAH
extern volatile uint16_t  C1TXQUAH __attribute__((__sfr__));
__extension__ typedef struct tagC1TXQUAHBITS {
  union {
    struct {
      uint16_t TXQUA:16;
    };
    struct {
      uint16_t TXQUA16:1;
      uint16_t TXQUA17:1;
      uint16_t TXQUA18:1;
      uint16_t TXQUA19:1;
      uint16_t TXQUA20:1;
      uint16_t TXQUA21:1;
      uint16_t TXQUA22:1;
      uint16_t TXQUA23:1;
      uint16_t TXQUA24:1;
      uint16_t TXQUA25:1;
      uint16_t TXQUA26:1;
      uint16_t TXQUA27:1;
      uint16_t TXQUA28:1;
      uint16_t TXQUA29:1;
      uint16_t TXQUA30:1;
      uint16_t TXQUA31:1;
    };
  };
} C1TXQUAHBITS;
extern volatile C1TXQUAHBITS C1TXQUAHbits __attribute__((__sfr__));

#define C1FIFOCON1L C1FIFOCON1L
extern volatile uint16_t  C1FIFOCON1L __attribute__((__sfr__));
typedef struct tagC1FIFOCON1LBITS {
  uint16_t TFNRFNIE:1;
  uint16_t TFHRFHIE:1;
  uint16_t TFERFFIE:1;
  uint16_t RXOVIE:1;
  uint16_t TXATIE:1;
  uint16_t RXTSEN:1;
  uint16_t RTREN:1;
  uint16_t TXEN:1;
  uint16_t UINC:1;
  uint16_t TXREQ:1;
  uint16_t FRESET:1;
} C1FIFOCON1LBITS;
extern volatile C1FIFOCON1LBITS C1FIFOCON1Lbits __attribute__((__sfr__));

#define C1FIFOCON1H C1FIFOCON1H
extern volatile uint16_t  C1FIFOCON1H __attribute__((__sfr__));
__extension__ typedef struct tagC1FIFOCON1HBITS {
  union {
    struct {
      uint16_t TXPRI:5;
      uint16_t TXAT:2;
      uint16_t :1;
      uint16_t FSIZE:5;
      uint16_t PLSIZE:3;
    };
    struct {
      uint16_t TXPRI0:1;
      uint16_t TXPRI1:1;
      uint16_t TXPRI2:1;
      uint16_t TXPRI3:1;
      uint16_t TXPRI4:1;
      uint16_t TXAT0:1;
      uint16_t TXAT1:1;
      uint16_t :1;
      uint16_t FSIZE0:1;
      uint16_t FSIZE1:1;
      uint16_t FSIZE2:1;
      uint16_t FSIZE3:1;
      uint16_t FSIZE4:1;
      uint16_t PLSIZE0:1;
      uint16_t PLSIZE1:1;
      uint16_t PLSIZE2:1;
    };
  };
} C1FIFOCON1HBITS;
extern volatile C1FIFOCON1HBITS C1FIFOCON1Hbits __attribute__((__sfr__));

#define C1FIFOSTA1 C1FIFOSTA1
extern volatile uint16_t  C1FIFOSTA1 __attribute__((__sfr__));
__extension__ typedef struct tagC1FIFOSTA1BITS {
  union {
    struct {
      uint16_t TFNRFNIF:1;
      uint16_t TFHRFHIF:1;
      uint16_t TFERFFIF:1;
      uint16_t RXOVIF:1;
      uint16_t TXATIF:1;
      uint16_t TXERR:1;
      uint16_t TXLARB:1;
      uint16_t TXABT:1;
      uint16_t FIFOCI:5;
    };
    struct {
      uint16_t :8;
      uint16_t FIFOCI0:1;
      uint16_t FIFOCI1:1;
      uint16_t FIFOCI2:1;
      uint16_t FIFOCI3:1;
      uint16_t FIFOCI4:1;
    };
  };
} C1FIFOSTA1BITS;
extern volatile C1FIFOSTA1BITS C1FIFOSTA1bits __attribute__((__sfr__));

#define C1FIFOUA1L C1FIFOUA1L
extern volatile uint16_t  C1FIFOUA1L __attribute__((__sfr__));
__extension__ typedef struct tagC1FIFOUA1LBITS {
  union {
    struct {
      uint16_t FIFOUA:16;
    };
    struct {
      uint16_t FIFOUA0:1;
      uint16_t FIFOUA1:1;
      uint16_t FIFOUA2:1;
      uint16_t FIFOUA3:1;
      uint16_t FIFOUA4:1;
      uint16_t FIFOUA5:1;
      uint16_t FIFOUA6:1;
      uint16_t FIFOUA7:1;
      uint16_t FIFOUA8:1;
      uint16_t FIFOUA9:1;
      uint16_t FIFOUA10:1;
      uint16_t FIFOUA11:1;
      uint16_t FIFOUA12:1;
      uint16_t FIFOUA13:1;
      uint16_t FIFOUA14:1;
      uint16_t FIFOUA15:1;
    };
  };
} C1FIFOUA1LBITS;
extern volatile C1FIFOUA1LBITS C1FIFOUA1Lbits __attribute__((__sfr__));

#define C1FIFOUA1H C1FIFOUA1H
extern volatile uint16_t  C1FIFOUA1H __attribute__((__sfr__));
__extension__ typedef struct tagC1FIFOUA1HBITS {
  union {
    struct {
      uint16_t FIFOUA:16;
    };
    struct {
      uint16_t FIFOUA16:1;
      uint16_t FIFOUA17:1;
      uint16_t FIFOUA18:1;
      uint16_t FIFOUA19:1;
      uint16_t FIFOUA20:1;
      uint16_t FIFOUA21:1;
      uint16_t FIFOUA22:1;
      uint16_t FIFOUA23:1;
      uint16_t FIFOUA24:1;
      uint16_t FIFOUA25:1;
      uint16_t FIFOUA26:1;
      uint16_t FIFOUA27:1;
      uint16_t FIFOUA28:1;
      uint16_t FIFOUA29:1;
      uint16_t FIFOUA30:1;
      uint16_t FIFOUA31:1;
    };
  };
} C1FIFOUA1HBITS;
extern volatile C1FIFOUA1HBITS C1FIFOUA1Hbits __attribute__((__sfr__));

#define C1FIFOCON2L C1FIFOCON2L
extern volatile uint16_t  C1FIFOCON2L __attribute__((__sfr__));
typedef struct tagC1FIFOCON2LBITS {
  uint16_t TFNRFNIE:1;
  uint16_t TFHRFHIE:1;
  uint16_t TFERFFIE:1;
  uint16_t RXOVIE:1;
  uint16_t TXATIE:1;
  uint16_t RXTSEN:1;
  uint16_t RTREN:1;
  uint16_t TXEN:1;
  uint16_t UINC:1;
  uint16_t TXREQ:1;
  uint16_t FRESET:1;
} C1FIFOCON2LBITS;
extern volatile C1FIFOCON2LBITS C1FIFOCON2Lbits __attribute__((__sfr__));

#define C1FIFOCON2H C1FIFOCON2H
extern volatile uint16_t  C1FIFOCON2H __attribute__((__sfr__));
__extension__ typedef struct tagC1FIFOCON2HBITS {
  union {
    struct {
      uint16_t TXPRI:5;
      uint16_t TXAT:2;
      uint16_t :1;
      uint16_t FSIZE:5;
      uint16_t PLSIZE:3;
    };
    struct {
      uint16_t TXPRI0:1;
      uint16_t TXPRI1:1;
      uint16_t TXPRI2:1;
      uint16_t TXPRI3:1;
      uint16_t TXPRI4:1;
      uint16_t TXAT0:1;
      uint16_t TXAT1:1;
      uint16_t :1;
      uint16_t FSIZE0:1;
      uint16_t FSIZE1:1;
      uint16_t FSIZE2:1;
      uint16_t FSIZE3:1;
      uint16_t FSIZE4:1;
      uint16_t PLSIZE0:1;
      uint16_t PLSIZE1:1;
      uint16_t PLSIZE2:1;
    };
  };
} C1FIFOCON2HBITS;
extern volatile C1FIFOCON2HBITS C1FIFOCON2Hbits __attribute__((__sfr__));

