gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
extern volatile C1FIFOCON6LBITS C1FIFOCON6Lbits __attribute__((__sfr__));

#define C1FIFOCON6H C1FIFOCON6H
extern volatile uint16_t  C1FIFOCON6H __attribute__((__sfr__));
__extension__ typedef struct tagC1FIFOCON6HBITS {
  union {
    struct {
      uint16_t TXPRI:5;
      uint16_t TXAT:2;
      uint16_t :1;
      uint16_t FSIZE:5;
      uint16_t PLSIZE:3;
    };
    struct {
      uint16_t TXPRI0:1;
      uint16_t TXPRI1:1;
      uint16_t TXPRI2:1;
      uint16_t TXPRI3:1;
      uint16_t TXPRI4:1;
      uint16_t TXAT0:1;
      uint16_t TXAT1:1;
      uint16_t :1;
      uint16_t FSIZE0:1;
      uint16_t FSIZE1:1;
      uint16_t FSIZE2:1;
      uint16_t FSIZE3:1;
      uint16_t FSIZE4:1;
      uint16_t PLSIZE0:1;
      uint16_t PLSIZE1:1;
      uint16_t PLSIZE2:1;
    };
  };
} C1FIFOCON6HBITS;
extern volatile C1FIFOCON6HBITS C1FIFOCON6Hbits __attribute__((__sfr__));

#define C1FIFOSTA6 C1FIFOSTA6
extern volatile uint16_t  C1FIFOSTA6 __attribute__((__sfr__));
__extension__ typedef struct tagC1FIFOSTA6BITS {
  union {
    struct {
      uint16_t TFNRFNIF:1;
      uint16_t TFHRFHIF:1;
      uint16_t TFERFFIF:1;
      uint16_t RXOVIF:1;
      uint16_t TXATIF:1;
      uint16_t TXERR:1;
      uint16_t TXLARB:1;
      uint16_t TXABT:1;
      uint16_t FIFOCI:5;
    };
    struct {
      uint16_t :8;
      uint16_t FIFOCI0:1;
      uint16_t FIFOCI1:1;
      uint16_t FIFOCI2:1;
      uint16_t FIFOCI3:1;
      uint16_t FIFOCI4:1;
    };
  };
} C1FIFOSTA6BITS;
extern volatile C1FIFOSTA6BITS C1FIFOSTA6bits __attribute__((__sfr__));

#define C1FIFOUA6L C1FIFOUA6L
extern volatile uint16_t  C1FIFOUA6L __attribute__((__sfr__));
__extension__ typedef struct tagC1FIFOUA6LBITS {
  union {
    struct {
      uint16_t FIFOUA:16;
    };
    struct {
      uint16_t FIFOUA0:1;
      uint16_t FIFOUA1:1;
      uint16_t FIFOUA2:1;
      uint16_t FIFOUA3:1;
      uint16_t FIFOUA4:1;
      uint16_t FIFOUA5:1;
      uint16_t FIFOUA6:1;
      uint16_t FIFOUA7:1;
      uint16_t FIFOUA8:1;
      uint16_t FIFOUA9:1;
      uint16_t FIFOUA10:1;
      uint16_t FIFOUA11:1;
      uint16_t FIFOUA12:1;
      uint16_t FIFOUA13:1;
      uint16_t FIFOUA14:1;
      uint16_t FIFOUA15:1;
    };
  };
} C1FIFOUA6LBITS;
extern volatile C1FIFOUA6LBITS C1FIFOUA6Lbits __attribute__((__sfr__));

#define C1FIFOUA6H C1FIFOUA6H
extern volatile uint16_t  C1FIFOUA6H __attribute__((__sfr__));
__extension__ typedef struct tagC1FIFOUA6HBITS {
  union {
    struct {
      uint16_t FIFOUA:16;
    };
    struct {
      uint16_t FIFOUA16:1;
      uint16_t FIFOUA17:1;
      uint16_t FIFOUA18:1;
      uint16_t FIFOUA19:1;
      uint16_t FIFOUA20:1;
      uint16_t FIFOUA21:1;
      uint16_t FIFOUA22:1;
      uint16_t FIFOUA23:1;
      uint16_t FIFOUA24:1;
      uint16_t FIFOUA25:1;
      uint16_t FIFOUA26:1;
      uint16_t FIFOUA27:1;
      uint16_t FIFOUA28:1;
      uint16_t FIFOUA29:1;
      uint16_t FIFOUA30:1;
      uint16_t FIFOUA31:1;
    };
  };
} C1FIFOUA6HBITS;
extern volatile C1FIFOUA6HBITS C1FIFOUA6Hbits __attribute__((__sfr__));

#define C1FIFOCON7L C1FIFOCON7L
extern volatile uint16_t  C1FIFOCON7L __attribute__((__sfr__));
typedef struct tagC1FIFOCON7LBITS {
  uint16_t TFNRFNIE:1;
  uint16_t TFHRFHIE:1;
  uint16_t TFERFFIE:1;
  uint16_t RXOVIE:1;
  uint16_t TXATIE:1;
  uint16_t RXTSEN:1;
  uint16_t RTREN:1;
  uint16_t TXEN:1;
  uint16_t UINC:1;
  uint16_t TXREQ:1;
  uint16_t FRESET:1;
} C1FIFOCON7LBITS;
extern volatile C1FIFOCON7LBITS C1FIFOCON7Lbits __attribute__((__sfr__));

#define C1FIFOCON7H C1FIFOCON7H
extern volatile uint16_t  C1FIFOCON7H __attribute__((__sfr__));
__extension__ typedef struct tagC1FIFOCON7HBITS {
  union {
    struct {
      uint16_t TXPRI:5;
      uint16_t TXAT:2;
      uint16_t :1;
      uint16_t FSIZE:5;
      uint16_t PLSIZE:3;
    };
    struct {
      uint16_t TXPRI0:1;
      uint16_t TXPRI1:1;
      uint16_t TXPRI2:1;
      uint16_t TXPRI3:1;
      uint16_t TXPRI4:1;
      uint16_t TXAT0:1;
      uint16_t TXAT1:1;
      uint16_t :1;
      uint16_t FSIZE0:1;
      uint16_t FSIZE1:1;
      uint16_t FSIZE2:1;
      uint16_t FSIZE3:1;
      uint16_t FSIZE4:1;
      uint16_t PLSIZE0:1;
      uint16_t PLSIZE1:1;
      uint16_t PLSIZE2:1;
    };
  };
} C1FIFOCON7HBITS;
extern volatile C1FIFOCON7HBITS C1FIFOCON7Hbits __attribute__((__sfr__));

#define C1FIFOSTA7 C1FIFOSTA7
extern volatile uint16_t  C1FIFOSTA7 __attribute__((__sfr__));
__extension__ typedef struct tagC1FIFOSTA7BITS {
  union {
    struct {
      uint16_t TFNRFNIF:1;
      uint16_t TFHRFHIF:1;
      uint16_t TFERFFIF:1;
      uint16_t RXOVIF:1;
      uint16_t TXATIF:1;
      uint16_t TXERR:1;
      uint16_t TXLARB:1;
      uint16_t TXABT:1;
      uint16_t FIFOCI:5;
    };
    struct {
      uint16_t :8;
      uint16_t FIFOCI0:1;
      uint16_t FIFOCI1:1;
      uint16_t FIFOCI2:1;
      uint16_t FIFOCI3:1;
      uint16_t FIFOCI4:1;
    };
  };
} C1FIFOSTA7BITS;
extern volatile C1FIFOSTA7BITS C1FIFOSTA7bits __attribute__((__sfr__));

#define C1FIFOUA7L C1FIFOUA7L
extern volatile uint16_t  C1FIFOUA7L __attribute__((__sfr__));
__extension__ typedef struct tagC1FIFOUA7LBITS {
  union {
    struct {
      uint16_t FIFOUA:16;
    };
    struct {
      uint16_t FIFOUA0:1;
      uint16_t FIFOUA1:1;
      uint16_t FIFOUA2:1;
      uint16_t FIFOUA3:1;
      uint16_t FIFOUA4:1;
      uint16_t FIFOUA5:1;
      uint16_t FIFOUA6:1;
      uint16_t FIFOUA7:1;
      uint16_t FIFOUA8:1;
      uint16_t FIFOUA9:1;
      uint16_t FIFOUA10:1;
      uint16_t FIFOUA11:1;
      uint16_t FIFOUA12:1;
      uint16_t FIFOUA13:1;
      uint16_t FIFOUA14:1;
      uint16_t FIFOUA15:1;
    };
  };
} C1FIFOUA7LBITS;
extern volatile C1FIFOUA7LBITS C1FIFOUA7Lbits __attribute__((__sfr__));

#define C1FIFOUA7H C1FIFOUA7H
extern volatile uint16_t  C1FIFOUA7H __attribute__((__sfr__));
__extension__ typedef struct tagC1FIFOUA7HBITS {
  union {
    struct {
      uint16_t FIFOUA:16;
    };
    struct {
      uint16_t FIFOUA16:1;
      uint16_t FIFOUA17:1;
      uint16_t FIFOUA18:1;
      uint16_t FIFOUA19:1;
      uint16_t FIFOUA20:1;
      uint16_t FIFOUA21:1;
      uint16_t FIFOUA22:1;
      uint16_t FIFOUA23:1;
      uint16_t FIFOUA24:1;
      uint16_t FIFOUA25:1;
      uint16_t FIFOUA26:1;
      uint16_t FIFOUA27:1;
      uint16_t FIFOUA28:1;
      uint16_t FIFOUA29:1;
      uint16_t FIFOUA30:1;
      uint16_t FIFOUA31:1;
    };
  };
} C1FIFOUA7HBITS;
extern volatile C1FIFOUA7HBITS C1FIFOUA7Hbits __attribute__((__sfr__));

#define C1FLTCON0L C1FLTCON0L
extern volatile uint16_t  C1FLTCON0L __attribute__((__sfr__));
typedef struct tagC1FLTCON0LBITS {
  uint16_t F0BP:5;
  uint16_t :2;
  uint16_t FLTEN0:1;
  uint16_t F1BP:5;
  uint16_t :2;
  uint16_t FLTEN1:1;
} C1FLTCON0LBITS;
extern volatile C1FLTCON0LBITS C1FLTCON0Lbits __attribute__((__sfr__));

#define C1FLTCON0H C1FLTCON0H
extern volatile uint16_t  C1FLTCON0H __attribute__((__sfr__));
typedef struct tagC1FLTCON0HBITS {
  uint16_t F2BP:5;
  uint16_t :2;
  uint16_t FLTEN2:1;
  uint16_t F3BP:5;
  uint16_t :2;
  uint16_t FLTEN3:1;
} C1FLTCON0HBITS;
