gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
extern volatile C1FLTCON0HBITS C1FLTCON0Hbits __attribute__((__sfr__));

#define C1FLTCON1L C1FLTCON1L
extern volatile uint16_t  C1FLTCON1L __attribute__((__sfr__));
typedef struct tagC1FLTCON1LBITS {
  uint16_t F4BP:5;
  uint16_t :2;
  uint16_t FLTEN4:1;
  uint16_t F5BP:5;
  uint16_t :2;
  uint16_t FLTEN5:1;
} C1FLTCON1LBITS;
extern volatile C1FLTCON1LBITS C1FLTCON1Lbits __attribute__((__sfr__));

#define C1FLTCON1H C1FLTCON1H
extern volatile uint16_t  C1FLTCON1H __attribute__((__sfr__));
typedef struct tagC1FLTCON1HBITS {
  uint16_t F6BP:5;
  uint16_t :2;
  uint16_t FLTEN6:1;
  uint16_t F7BP:5;
  uint16_t :2;
  uint16_t FLTEN7:1;
} C1FLTCON1HBITS;
extern volatile C1FLTCON1HBITS C1FLTCON1Hbits __attribute__((__sfr__));

#define C1FLTCON2L C1FLTCON2L
extern volatile uint16_t  C1FLTCON2L __attribute__((__sfr__));
typedef struct tagC1FLTCON2LBITS {
  uint16_t F8BP:5;
  uint16_t :2;
  uint16_t FLTEN8:1;
  uint16_t F9BP:5;
  uint16_t :2;
  uint16_t FLTEN9:1;
} C1FLTCON2LBITS;
extern volatile C1FLTCON2LBITS C1FLTCON2Lbits __attribute__((__sfr__));

#define C1FLTCON2H C1FLTCON2H
extern volatile uint16_t  C1FLTCON2H __attribute__((__sfr__));
typedef struct tagC1FLTCON2HBITS {
  uint16_t F10BP:5;
  uint16_t :2;
  uint16_t FLTEN10:1;
  uint16_t F11BP:5;
  uint16_t :2;
  uint16_t FLTEN11:1;
} C1FLTCON2HBITS;
extern volatile C1FLTCON2HBITS C1FLTCON2Hbits __attribute__((__sfr__));

#define C1FLTCON3L C1FLTCON3L
extern volatile uint16_t  C1FLTCON3L __attribute__((__sfr__));
typedef struct tagC1FLTCON3LBITS {
  uint16_t F12BP:5;
  uint16_t :2;
  uint16_t FLTEN12:1;
  uint16_t F13BP:5;
  uint16_t :2;
  uint16_t FLTEN13:1;
} C1FLTCON3LBITS;
extern volatile C1FLTCON3LBITS C1FLTCON3Lbits __attribute__((__sfr__));

#define C1FLTCON3H C1FLTCON3H
extern volatile uint16_t  C1FLTCON3H __attribute__((__sfr__));
typedef struct tagC1FLTCON3HBITS {
  uint16_t F14BP:5;
  uint16_t :2;
  uint16_t FLTEN14:1;
  uint16_t F15BP:5;
  uint16_t :2;
  uint16_t FLTEN15:1;
} C1FLTCON3HBITS;
extern volatile C1FLTCON3HBITS C1FLTCON3Hbits __attribute__((__sfr__));

#define C1FLTOBJ0L C1FLTOBJ0L
extern volatile uint16_t  C1FLTOBJ0L __attribute__((__sfr__));
__extension__ typedef struct tagC1FLTOBJ0LBITS {
  union {
    struct {
      uint16_t SID:11;
      uint16_t EID:5;
    };
    struct {
      uint16_t SID0:1;
      uint16_t SID1:1;
      uint16_t SID2:1;
      uint16_t SID3:1;
      uint16_t SID4:1;
      uint16_t SID5:1;
      uint16_t SID6:1;
      uint16_t SID7:1;
      uint16_t SID8:1;
      uint16_t SID9:1;
      uint16_t SID10:1;
      uint16_t EID0:1;
      uint16_t EID1:1;
      uint16_t EID2:1;
      uint16_t EID3:1;
      uint16_t EID4:1;
    };
  };
} C1FLTOBJ0LBITS;
extern volatile C1FLTOBJ0LBITS C1FLTOBJ0Lbits __attribute__((__sfr__));

#define C1FLTOBJ0H C1FLTOBJ0H
extern volatile uint16_t  C1FLTOBJ0H __attribute__((__sfr__));
__extension__ typedef struct tagC1FLTOBJ0HBITS {
  union {
    struct {
      uint16_t EID:13;
      uint16_t SID11:1;
      uint16_t EXIDE:1;
    };
    struct {
      uint16_t EID5:1;
      uint16_t EID6:1;
      uint16_t EID7:1;
      uint16_t EID8:1;
      uint16_t EID9:1;
      uint16_t EID10:1;
      uint16_t EID11:1;
      uint16_t EID12:1;
      uint16_t EID13:1;
      uint16_t EID14:1;
      uint16_t EID15:1;
      uint16_t EID16:1;
      uint16_t EID17:1;
    };
  };
} C1FLTOBJ0HBITS;
extern volatile C1FLTOBJ0HBITS C1FLTOBJ0Hbits __attribute__((__sfr__));

#define C1MASK0L C1MASK0L
extern volatile uint16_t  C1MASK0L __attribute__((__sfr__));
__extension__ typedef struct tagC1MASK0LBITS {
  union {
    struct {
      uint16_t MSID:11;
      uint16_t MEID:5;
    };
    struct {
      uint16_t MSID0:1;
      uint16_t MSID1:1;
      uint16_t MSID2:1;
      uint16_t MSID3:1;
      uint16_t MSID4:1;
      uint16_t MSID5:1;
      uint16_t MSID6:1;
      uint16_t MSID7:1;
      uint16_t MSID8:1;
      uint16_t MSID9:1;
      uint16_t MSID10:1;
      uint16_t MEID0:1;
      uint16_t MEID1:1;
      uint16_t MEID2:1;
      uint16_t MEID3:1;
      uint16_t MEID4:1;
    };
  };
} C1MASK0LBITS;
extern volatile C1MASK0LBITS C1MASK0Lbits __attribute__((__sfr__));

#define C1MASK0H C1MASK0H
extern volatile uint16_t  C1MASK0H __attribute__((__sfr__));
__extension__ typedef struct tagC1MASK0HBITS {
  union {
    struct {
      uint16_t MEID:13;
      uint16_t MSID11:1;
      uint16_t MIDE:1;
    };
    struct {
      uint16_t MEID5:1;
      uint16_t MEID6:1;
      uint16_t MEID7:1;
      uint16_t MEID8:1;
      uint16_t MEID9:1;
      uint16_t MEID10:1;
      uint16_t MEID11:1;
      uint16_t MEID12:1;
      uint16_t MEID13:1;
      uint16_t MEID14:1;
      uint16_t MEID15:1;
      uint16_t MEID16:1;
      uint16_t MEID17:1;
    };
  };
} C1MASK0HBITS;
extern volatile C1MASK0HBITS C1MASK0Hbits __attribute__((__sfr__));

#define C1FLTOBJ1L C1FLTOBJ1L
extern volatile uint16_t  C1FLTOBJ1L __attribute__((__sfr__));
__extension__ typedef struct tagC1FLTOBJ1LBITS {
  union {
    struct {
      uint16_t SID:11;
      uint16_t EID:5;
    };
    struct {
      uint16_t SID0:1;
      uint16_t SID1:1;
      uint16_t SID2:1;
      uint16_t SID3:1;
      uint16_t SID4:1;
      uint16_t SID5:1;
      uint16_t SID6:1;
      uint16_t SID7:1;
      uint16_t SID8:1;
      uint16_t SID9:1;
      uint16_t SID10:1;
      uint16_t EID0:1;
      uint16_t EID1:1;
      uint16_t EID2:1;
      uint16_t EID3:1;
      uint16_t EID4:1;
    };
  };
} C1FLTOBJ1LBITS;
extern volatile C1FLTOBJ1LBITS C1FLTOBJ1Lbits __attribute__((__sfr__));

#define C1FLTOBJ1H C1FLTOBJ1H
extern volatile uint16_t  C1FLTOBJ1H __attribute__((__sfr__));
__extension__ typedef struct tagC1FLTOBJ1HBITS {
  union {
    struct {
      uint16_t EID:13;
      uint16_t SID11:1;
      uint16_t EXIDE:1;
    };
    struct {
      uint16_t EID5:1;
      uint16_t EID6:1;
      uint16_t EID7:1;
      uint16_t EID8:1;
      uint16_t EID9:1;
      uint16_t EID10:1;
      uint16_t EID11:1;
      uint16_t EID12:1;
      uint16_t EID13:1;
      uint16_t EID14:1;
      uint16_t EID15:1;
      uint16_t EID16:1;
      uint16_t EID17:1;
    };
  };
} C1FLTOBJ1HBITS;
