gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
extern volatile C1FLTOBJ1HBITS C1FLTOBJ1Hbits __attribute__((__sfr__));

#define C1MASK1L C1MASK1L
extern volatile uint16_t  C1MASK1L __attribute__((__sfr__));
__extension__ typedef struct tagC1MASK1LBITS {
  union {
    struct {
      uint16_t MSID:11;
      uint16_t MEID:5;
    };
    struct {
      uint16_t MSID0:1;
      uint16_t MSID1:1;
      uint16_t MSID2:1;
      uint16_t MSID3:1;
      uint16_t MSID4:1;
      uint16_t MSID5:1;
      uint16_t MSID6:1;
      uint16_t MSID7:1;
      uint16_t MSID8:1;
      uint16_t MSID9:1;
      uint16_t MSID10:1;
      uint16_t MEID0:1;
      uint16_t MEID1:1;
      uint16_t MEID2:1;
      uint16_t MEID3:1;
      uint16_t MEID4:1;
    };
  };
} C1MASK1LBITS;
extern volatile C1MASK1LBITS C1MASK1Lbits __attribute__((__sfr__));

#define C1MASK1H C1MASK1H
extern volatile uint16_t  C1MASK1H __attribute__((__sfr__));
__extension__ typedef struct tagC1MASK1HBITS {
  union {
    struct {
      uint16_t MEID:13;
      uint16_t MSID11:1;
      uint16_t MIDE:1;
    };
    struct {
      uint16_t MEID5:1;
      uint16_t MEID6:1;
      uint16_t MEID7:1;
      uint16_t MEID8:1;
      uint16_t MEID9:1;
      uint16_t MEID10:1;
      uint16_t MEID11:1;
      uint16_t MEID12:1;
      uint16_t MEID13:1;
      uint16_t MEID14:1;
      uint16_t MEID15:1;
      uint16_t MEID16:1;
      uint16_t MEID17:1;
    };
  };
} C1MASK1HBITS;
extern volatile C1MASK1HBITS C1MASK1Hbits __attribute__((__sfr__));

#define C1FLTOBJ2L C1FLTOBJ2L
extern volatile uint16_t  C1FLTOBJ2L __attribute__((__sfr__));
__extension__ typedef struct tagC1FLTOBJ2LBITS {
  union {
    struct {
      uint16_t SID:11;
      uint16_t EID:5;
    };
    struct {
      uint16_t SID0:1;
      uint16_t SID1:1;
      uint16_t SID2:1;
      uint16_t SID3:1;
      uint16_t SID4:1;
      uint16_t SID5:1;
      uint16_t SID6:1;
      uint16_t SID7:1;
      uint16_t SID8:1;
      uint16_t SID9:1;
      uint16_t SID10:1;
      uint16_t EID0:1;
      uint16_t EID1:1;
      uint16_t EID2:1;
      uint16_t EID3:1;
      uint16_t EID4:1;
    };
  };
} C1FLTOBJ2LBITS;
extern volatile C1FLTOBJ2LBITS C1FLTOBJ2Lbits __attribute__((__sfr__));

#define C1FLTOBJ2H C1FLTOBJ2H
extern volatile uint16_t  C1FLTOBJ2H __attribute__((__sfr__));
__extension__ typedef struct tagC1FLTOBJ2HBITS {
  union {
    struct {
      uint16_t EID:13;
      uint16_t SID11:1;
      uint16_t EXIDE:1;
    };
    struct {
      uint16_t EID5:1;
      uint16_t EID6:1;
      uint16_t EID7:1;
      uint16_t EID8:1;
      uint16_t EID9:1;
      uint16_t EID10:1;
      uint16_t EID11:1;
      uint16_t EID12:1;
      uint16_t EID13:1;
      uint16_t EID14:1;
      uint16_t EID15:1;
      uint16_t EID16:1;
      uint16_t EID17:1;
    };
  };
} C1FLTOBJ2HBITS;
extern volatile C1FLTOBJ2HBITS C1FLTOBJ2Hbits __attribute__((__sfr__));

#define C1MASK2L C1MASK2L
extern volatile uint16_t  C1MASK2L __attribute__((__sfr__));
__extension__ typedef struct tagC1MASK2LBITS {
  union {
    struct {
      uint16_t MSID:11;
      uint16_t MEID:5;
    };
    struct {
      uint16_t MSID0:1;
      uint16_t MSID1:1;
      uint16_t MSID2:1;
      uint16_t MSID3:1;
      uint16_t MSID4:1;
      uint16_t MSID5:1;
      uint16_t MSID6:1;
      uint16_t MSID7:1;
      uint16_t MSID8:1;
      uint16_t MSID9:1;
      uint16_t MSID10:1;
      uint16_t MEID0:1;
      uint16_t MEID1:1;
      uint16_t MEID2:1;
      uint16_t MEID3:1;
      uint16_t MEID4:1;
    };
  };
} C1MASK2LBITS;
extern volatile C1MASK2LBITS C1MASK2Lbits __attribute__((__sfr__));

#define C1MASK2H C1MASK2H
extern volatile uint16_t  C1MASK2H __attribute__((__sfr__));
__extension__ typedef struct tagC1MASK2HBITS {
  union {
    struct {
      uint16_t MEID:13;
      uint16_t MSID11:1;
      uint16_t MIDE:1;
    };
    struct {
      uint16_t MEID5:1;
      uint16_t MEID6:1;
      uint16_t MEID7:1;
      uint16_t MEID8:1;
      uint16_t MEID9:1;
      uint16_t MEID10:1;
      uint16_t MEID11:1;
      uint16_t MEID12:1;
      uint16_t MEID13:1;
      uint16_t MEID14:1;
      uint16_t MEID15:1;
      uint16_t MEID16:1;
      uint16_t MEID17:1;
    };
  };
} C1MASK2HBITS;
extern volatile C1MASK2HBITS C1MASK2Hbits __attribute__((__sfr__));

#define C1FLTOBJ3L C1FLTOBJ3L
extern volatile uint16_t  C1FLTOBJ3L __attribute__((__sfr__));
__extension__ typedef struct tagC1FLTOBJ3LBITS {
  union {
    struct {
      uint16_t SID:11;
      uint16_t EID:5;
    };
    struct {
      uint16_t SID0:1;
      uint16_t SID1:1;
      uint16_t SID2:1;
      uint16_t SID3:1;
      uint16_t SID4:1;
      uint16_t SID5:1;
      uint16_t SID6:1;
      uint16_t SID7:1;
      uint16_t SID8:1;
      uint16_t SID9:1;
      uint16_t SID10:1;
      uint16_t EID0:1;
      uint16_t EID1:1;
      uint16_t EID2:1;
      uint16_t EID3:1;
      uint16_t EID4:1;
    };
  };
} C1FLTOBJ3LBITS;
extern volatile C1FLTOBJ3LBITS C1FLTOBJ3Lbits __attribute__((__sfr__));

#define C1FLTOBJ3H C1FLTOBJ3H
extern volatile uint16_t  C1FLTOBJ3H __attribute__((__sfr__));
__extension__ typedef struct tagC1FLTOBJ3HBITS {
  union {
    struct {
      uint16_t EID:13;
      uint16_t SID11:1;
      uint16_t EXIDE:1;
    };
    struct {
      uint16_t EID5:1;
      uint16_t EID6:1;
      uint16_t EID7:1;
      uint16_t EID8:1;
      uint16_t EID9:1;
      uint16_t EID10:1;
      uint16_t EID11:1;
      uint16_t EID12:1;
      uint16_t EID13:1;
      uint16_t EID14:1;
      uint16_t EID15:1;
      uint16_t EID16:1;
      uint16_t EID17:1;
    };
  };
} C1FLTOBJ3HBITS;
extern volatile C1FLTOBJ3HBITS C1FLTOBJ3Hbits __attribute__((__sfr__));

#define C1MASK3L C1MASK3L
extern volatile uint16_t  C1MASK3L __attribute__((__sfr__));
__extension__ typedef struct tagC1MASK3LBITS {
  union {
    struct {
      uint16_t MSID:11;
      uint16_t MEID:5;
    };
    struct {
      uint16_t MSID0:1;
      uint16_t MSID1:1;
      uint16_t MSID2:1;
      uint16_t MSID3:1;
      uint16_t MSID4:1;
      uint16_t MSID5:1;
      uint16_t MSID6:1;
      uint16_t MSID7:1;
      uint16_t MSID8:1;
      uint16_t MSID9:1;
      uint16_t MSID10:1;
      uint16_t MEID0:1;
      uint16_t MEID1:1;
      uint16_t MEID2:1;
      uint16_t MEID3:1;
      uint16_t MEID4:1;
    };
  };
} C1MASK3LBITS;
