gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
extern volatile C1MASK3LBITS C1MASK3Lbits __attribute__((__sfr__));

#define C1MASK3H C1MASK3H
extern volatile uint16_t  C1MASK3H __attribute__((__sfr__));
__extension__ typedef struct tagC1MASK3HBITS {
  union {
    struct {
      uint16_t MEID:13;
      uint16_t MSID11:1;
      uint16_t MIDE:1;
    };
    struct {
      uint16_t MEID5:1;
      uint16_t MEID6:1;
      uint16_t MEID7:1;
      uint16_t MEID8:1;
      uint16_t MEID9:1;
      uint16_t MEID10:1;
      uint16_t MEID11:1;
      uint16_t MEID12:1;
      uint16_t MEID13:1;
      uint16_t MEID14:1;
      uint16_t MEID15:1;
      uint16_t MEID16:1;
      uint16_t MEID17:1;
    };
  };
} C1MASK3HBITS;
extern volatile C1MASK3HBITS C1MASK3Hbits __attribute__((__sfr__));

#define C1FLTOBJ4L C1FLTOBJ4L
extern volatile uint16_t  C1FLTOBJ4L __attribute__((__sfr__));
__extension__ typedef struct tagC1FLTOBJ4LBITS {
  union {
    struct {
      uint16_t SID:11;
      uint16_t EID:5;
    };
    struct {
      uint16_t SID0:1;
      uint16_t SID1:1;
      uint16_t SID2:1;
      uint16_t SID3:1;
      uint16_t SID4:1;
      uint16_t SID5:1;
      uint16_t SID6:1;
      uint16_t SID7:1;
      uint16_t SID8:1;
      uint16_t SID9:1;
      uint16_t SID10:1;
      uint16_t EID0:1;
      uint16_t EID1:1;
      uint16_t EID2:1;
      uint16_t EID3:1;
      uint16_t EID4:1;
    };
  };
} C1FLTOBJ4LBITS;
extern volatile C1FLTOBJ4LBITS C1FLTOBJ4Lbits __attribute__((__sfr__));

#define C1FLTOBJ4H C1FLTOBJ4H
extern volatile uint16_t  C1FLTOBJ4H __attribute__((__sfr__));
__extension__ typedef struct tagC1FLTOBJ4HBITS {
  union {
    struct {
      uint16_t EID:13;
      uint16_t SID11:1;
      uint16_t EXIDE:1;
    };
    struct {
      uint16_t EID5:1;
      uint16_t EID6:1;
      uint16_t EID7:1;
      uint16_t EID8:1;
      uint16_t EID9:1;
      uint16_t EID10:1;
      uint16_t EID11:1;
      uint16_t EID12:1;
      uint16_t EID13:1;
      uint16_t EID14:1;
      uint16_t EID15:1;
      uint16_t EID16:1;
      uint16_t EID17:1;
    };
  };
} C1FLTOBJ4HBITS;
extern volatile C1FLTOBJ4HBITS C1FLTOBJ4Hbits __attribute__((__sfr__));

#define C1MASK4L C1MASK4L
extern volatile uint16_t  C1MASK4L __attribute__((__sfr__));
__extension__ typedef struct tagC1MASK4LBITS {
  union {
    struct {
      uint16_t MSID:11;
      uint16_t MEID:5;
    };
    struct {
      uint16_t MSID0:1;
      uint16_t MSID1:1;
      uint16_t MSID2:1;
      uint16_t MSID3:1;
      uint16_t MSID4:1;
      uint16_t MSID5:1;
      uint16_t MSID6:1;
      uint16_t MSID7:1;
      uint16_t MSID8:1;
      uint16_t MSID9:1;
      uint16_t MSID10:1;
      uint16_t MEID0:1;
      uint16_t MEID1:1;
      uint16_t MEID2:1;
      uint16_t MEID3:1;
      uint16_t MEID4:1;
    };
  };
} C1MASK4LBITS;
extern volatile C1MASK4LBITS C1MASK4Lbits __attribute__((__sfr__));

#define C1MASK4H C1MASK4H
extern volatile uint16_t  C1MASK4H __attribute__((__sfr__));
__extension__ typedef struct tagC1MASK4HBITS {
  union {
    struct {
      uint16_t MEID:13;
      uint16_t MSID11:1;
      uint16_t MIDE:1;
    };
    struct {
      uint16_t MEID5:1;
      uint16_t MEID6:1;
      uint16_t MEID7:1;
      uint16_t MEID8:1;
      uint16_t MEID9:1;
      uint16_t MEID10:1;
      uint16_t MEID11:1;
      uint16_t MEID12:1;
      uint16_t MEID13:1;
      uint16_t MEID14:1;
      uint16_t MEID15:1;
      uint16_t MEID16:1;
      uint16_t MEID17:1;
    };
  };
} C1MASK4HBITS;
extern volatile C1MASK4HBITS C1MASK4Hbits __attribute__((__sfr__));

#define C1FLTOBJ5L C1FLTOBJ5L
extern volatile uint16_t  C1FLTOBJ5L __attribute__((__sfr__));
__extension__ typedef struct tagC1FLTOBJ5LBITS {
  union {
    struct {
      uint16_t SID:11;
      uint16_t EID:5;
    };
    struct {
      uint16_t SID0:1;
      uint16_t SID1:1;
      uint16_t SID2:1;
      uint16_t SID3:1;
      uint16_t SID4:1;
      uint16_t SID5:1;
      uint16_t SID6:1;
      uint16_t SID7:1;
      uint16_t SID8:1;
      uint16_t SID9:1;
      uint16_t SID10:1;
      uint16_t EID0:1;
      uint16_t EID1:1;
      uint16_t EID2:1;
      uint16_t EID3:1;
      uint16_t EID4:1;
    };
  };
} C1FLTOBJ5LBITS;
extern volatile C1FLTOBJ5LBITS C1FLTOBJ5Lbits __attribute__((__sfr__));

#define C1FLTOBJ5H C1FLTOBJ5H
extern volatile uint16_t  C1FLTOBJ5H __attribute__((__sfr__));
__extension__ typedef struct tagC1FLTOBJ5HBITS {
  union {
    struct {
      uint16_t EID:13;
      uint16_t SID11:1;
      uint16_t EXIDE:1;
    };
    struct {
      uint16_t EID5:1;
      uint16_t EID6:1;
      uint16_t EID7:1;
      uint16_t EID8:1;
      uint16_t EID9:1;
      uint16_t EID10:1;
      uint16_t EID11:1;
      uint16_t EID12:1;
      uint16_t EID13:1;
      uint16_t EID14:1;
      uint16_t EID15:1;
      uint16_t EID16:1;
      uint16_t EID17:1;
    };
  };
} C1FLTOBJ5HBITS;
extern volatile C1FLTOBJ5HBITS C1FLTOBJ5Hbits __attribute__((__sfr__));

#define C1MASK5L C1MASK5L
extern volatile uint16_t  C1MASK5L __attribute__((__sfr__));
__extension__ typedef struct tagC1MASK5LBITS {
  union {
    struct {
      uint16_t MSID:11;
      uint16_t MEID:5;
    };
    struct {
      uint16_t MSID0:1;
      uint16_t MSID1:1;
      uint16_t MSID2:1;
      uint16_t MSID3:1;
      uint16_t MSID4:1;
      uint16_t MSID5:1;
      uint16_t MSID6:1;
      uint16_t MSID7:1;
      uint16_t MSID8:1;
      uint16_t MSID9:1;
      uint16_t MSID10:1;
      uint16_t MEID0:1;
      uint16_t MEID1:1;
      uint16_t MEID2:1;
      uint16_t MEID3:1;
      uint16_t MEID4:1;
    };
  };
} C1MASK5LBITS;
extern volatile C1MASK5LBITS C1MASK5Lbits __attribute__((__sfr__));

#define C1MASK5H C1MASK5H
extern volatile uint16_t  C1MASK5H __attribute__((__sfr__));
__extension__ typedef struct tagC1MASK5HBITS {
  union {
    struct {
      uint16_t MEID:13;
      uint16_t MSID11:1;
      uint16_t MIDE:1;
    };
    struct {
      uint16_t MEID5:1;
      uint16_t MEID6:1;
      uint16_t MEID7:1;
      uint16_t MEID8:1;
      uint16_t MEID9:1;
      uint16_t MEID10:1;
      uint16_t MEID11:1;
      uint16_t MEID12:1;
      uint16_t MEID13:1;
      uint16_t MEID14:1;
      uint16_t MEID15:1;
      uint16_t MEID16:1;
      uint16_t MEID17:1;
    };
  };
} C1MASK5HBITS;
extern volatile C1MASK5HBITS C1MASK5Hbits __attribute__((__sfr__));

#define C1FLTOBJ6L C1FLTOBJ6L
extern volatile uint16_t  C1FLTOBJ6L __attribute__((__sfr__));
__extension__ typedef struct tagC1FLTOBJ6LBITS {
  union {
    struct {
      uint16_t SID:11;
      uint16_t EID:5;
    };
    struct {
      uint16_t SID0:1;
      uint16_t SID1:1;
      uint16_t SID2:1;
      uint16_t SID3:1;
      uint16_t SID4:1;
      uint16_t SID5:1;
      uint16_t SID6:1;
      uint16_t SID7:1;
      uint16_t SID8:1;
      uint16_t SID9:1;
      uint16_t SID10:1;
      uint16_t EID0:1;
      uint16_t EID1:1;
      uint16_t EID2:1;
      uint16_t EID3:1;
      uint16_t EID4:1;
    };
  };
} C1FLTOBJ6LBITS;
extern volatile C1FLTOBJ6LBITS C1FLTOBJ6Lbits __attribute__((__sfr__));

#define C1FLTOBJ6H C1FLTOBJ6H
extern volatile uint16_t  C1FLTOBJ6H __attribute__((__sfr__));
__extension__ typedef struct tagC1FLTOBJ6HBITS {
  union {
    struct {
      uint16_t EID:13;
      uint16_t SID11:1;
      uint16_t EXIDE:1;
    };
    struct {
      uint16_t EID5:1;
      uint16_t EID6:1;
      uint16_t EID7:1;
      uint16_t EID8:1;
      uint16_t EID9:1;
      uint16_t EID10:1;
      uint16_t EID11:1;
      uint16_t EID12:1;
      uint16_t EID13:1;
      uint16_t EID14:1;
      uint16_t EID15:1;
      uint16_t EID16:1;
      uint16_t EID17:1;
    };
  };
} C1FLTOBJ6HBITS;
extern volatile C1FLTOBJ6HBITS C1FLTOBJ6Hbits __attribute__((__sfr__));

#define C1MASK6L C1MASK6L
extern volatile uint16_t  C1MASK6L __attribute__((__sfr__));
__extension__ typedef struct tagC1MASK6LBITS {
  union {
    struct {
      uint16_t MSID:11;
      uint16_t MEID:5;
    };
    struct {
      uint16_t MSID0:1;
      uint16_t MSID1:1;
      uint16_t MSID2:1;
      uint16_t MSID3:1;
      uint16_t MSID4:1;
      uint16_t MSID5:1;
      uint16_t MSID6:1;
      uint16_t MSID7:1;
      uint16_t MSID8:1;
      uint16_t MSID9:1;
      uint16_t MSID10:1;
      uint16_t MEID0:1;
      uint16_t MEID1:1;
      uint16_t MEID2:1;
      uint16_t MEID3:1;
      uint16_t MEID4:1;
    };
  };
} C1MASK6LBITS;
extern volatile C1MASK6LBITS C1MASK6Lbits __attribute__((__sfr__));

#define C1MASK6H C1MASK6H
extern volatile uint16_t  C1MASK6H __attribute__((__sfr__));
__extension__ typedef struct tagC1MASK6HBITS {
  union {
    struct {
      uint16_t MEID:13;
      uint16_t MSID11:1;
      uint16_t MIDE:1;
    };
    struct {
      uint16_t MEID5:1;
      uint16_t MEID6:1;
      uint16_t MEID7:1;
      uint16_t MEID8:1;
      uint16_t MEID9:1;
      uint16_t MEID10:1;
      uint16_t MEID11:1;
      uint16_t MEID12:1;
      uint16_t MEID13:1;
      uint16_t MEID14:1;
      uint16_t MEID15:1;
      uint16_t MEID16:1;
      uint16_t MEID17:1;
    };
  };
} C1MASK6HBITS;
extern volatile C1MASK6HBITS C1MASK6Hbits __attribute__((__sfr__));

#define C1FLTOBJ7L C1FLTOBJ7L
extern volatile uint16_t  C1FLTOBJ7L __attribute__((__sfr__));
__extension__ typedef struct tagC1FLTOBJ7LBITS {
  union {
    struct {
      uint16_t SID:11;
      uint16_t EID:5;
    };
    struct {
      uint16_t SID0:1;
      uint16_t SID1:1;
      uint16_t SID2:1;
      uint16_t SID3:1;
      uint16_t SID4:1;
      uint16_t SID5:1;
      uint16_t SID6:1;
      uint16_t SID7:1;
      uint16_t SID8:1;
      uint16_t SID9:1;
      uint16_t SID10:1;
      uint16_t EID0:1;
      uint16_t EID1:1;
      uint16_t EID2:1;
      uint16_t EID3:1;
      uint16_t EID4:1;
    };
  };
} C1FLTOBJ7LBITS;
extern volatile C1FLTOBJ7LBITS C1FLTOBJ7Lbits __attribute__((__sfr__));

#define C1FLTOBJ7H C1FLTOBJ7H
extern volatile uint16_t  C1FLTOBJ7H __attribute__((__sfr__));
__extension__ typedef struct tagC1FLTOBJ7HBITS {
  union {
    struct {
      uint16_t EID:13;
      uint16_t SID11:1;
      uint16_t EXIDE:1;
    };
    struct {
      uint16_t EID5:1;
      uint16_t EID6:1;
      uint16_t EID7:1;
      uint16_t EID8:1;
      uint16_t EID9:1;
      uint16_t EID10:1;
      uint16_t EID11:1;
      uint16_t EID12:1;
      uint16_t EID13:1;
      uint16_t EID14:1;
      uint16_t EID15:1;
      uint16_t EID16:1;
      uint16_t EID17:1;
    };
  };
} C1FLTOBJ7HBITS;
