gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
extern volatile C1FLTOBJ7HBITS C1FLTOBJ7Hbits __attribute__((__sfr__));

#define C1MASK7L C1MASK7L
extern volatile uint16_t  C1MASK7L __attribute__((__sfr__));
__extension__ typedef struct tagC1MASK7LBITS {
  union {
    struct {
      uint16_t MSID:11;
      uint16_t MEID:5;
    };
    struct {
      uint16_t MSID0:1;
      uint16_t MSID1:1;
      uint16_t MSID2:1;
      uint16_t MSID3:1;
      uint16_t MSID4:1;
      uint16_t MSID5:1;
      uint16_t MSID6:1;
      uint16_t MSID7:1;
      uint16_t MSID8:1;
      uint16_t MSID9:1;
      uint16_t MSID10:1;
      uint16_t MEID0:1;
      uint16_t MEID1:1;
      uint16_t MEID2:1;
      uint16_t MEID3:1;
      uint16_t MEID4:1;
    };
  };
} C1MASK7LBITS;
extern volatile C1MASK7LBITS C1MASK7Lbits __attribute__((__sfr__));

#define C1MASK7H C1MASK7H
extern volatile uint16_t  C1MASK7H __attribute__((__sfr__));
__extension__ typedef struct tagC1MASK7HBITS {
  union {
    struct {
      uint16_t MEID:13;
      uint16_t MSID11:1;
      uint16_t MIDE:1;
    };
    struct {
      uint16_t MEID5:1;
      uint16_t MEID6:1;
      uint16_t MEID7:1;
      uint16_t MEID8:1;
      uint16_t MEID9:1;
      uint16_t MEID10:1;
      uint16_t MEID11:1;
      uint16_t MEID12:1;
      uint16_t MEID13:1;
      uint16_t MEID14:1;
      uint16_t MEID15:1;
      uint16_t MEID16:1;
      uint16_t MEID17:1;
    };
  };
} C1MASK7HBITS;
extern volatile C1MASK7HBITS C1MASK7Hbits __attribute__((__sfr__));

#define C1FLTOBJ8L C1FLTOBJ8L
extern volatile uint16_t  C1FLTOBJ8L __attribute__((__sfr__));
__extension__ typedef struct tagC1FLTOBJ8LBITS {
  union {
    struct {
      uint16_t SID:11;
      uint16_t EID:5;
    };
    struct {
      uint16_t SID0:1;
      uint16_t SID1:1;
      uint16_t SID2:1;
      uint16_t SID3:1;
      uint16_t SID4:1;
      uint16_t SID5:1;
      uint16_t SID6:1;
      uint16_t SID7:1;
      uint16_t SID8:1;
      uint16_t SID9:1;
      uint16_t SID10:1;
      uint16_t EID0:1;
      uint16_t EID1:1;
      uint16_t EID2:1;
      uint16_t EID3:1;
      uint16_t EID4:1;
    };
  };
} C1FLTOBJ8LBITS;
extern volatile C1FLTOBJ8LBITS C1FLTOBJ8Lbits __attribute__((__sfr__));

#define C1FLTOBJ8H C1FLTOBJ8H
extern volatile uint16_t  C1FLTOBJ8H __attribute__((__sfr__));
__extension__ typedef struct tagC1FLTOBJ8HBITS {
  union {
    struct {
      uint16_t EID:13;
      uint16_t SID11:1;
      uint16_t EXIDE:1;
    };
    struct {
      uint16_t EID5:1;
      uint16_t EID6:1;
      uint16_t EID7:1;
      uint16_t EID8:1;
      uint16_t EID9:1;
      uint16_t EID10:1;
      uint16_t EID11:1;
      uint16_t EID12:1;
      uint16_t EID13:1;
      uint16_t EID14:1;
      uint16_t EID15:1;
      uint16_t EID16:1;
      uint16_t EID17:1;
    };
  };
} C1FLTOBJ8HBITS;
extern volatile C1FLTOBJ8HBITS C1FLTOBJ8Hbits __attribute__((__sfr__));

#define C1MASK8L C1MASK8L
extern volatile uint16_t  C1MASK8L __attribute__((__sfr__));
__extension__ typedef struct tagC1MASK8LBITS {
  union {
    struct {
      uint16_t MSID:11;
      uint16_t MEID:5;
    };
    struct {
      uint16_t MSID0:1;
      uint16_t MSID1:1;
      uint16_t MSID2:1;
      uint16_t MSID3:1;
      uint16_t MSID4:1;
      uint16_t MSID5:1;
      uint16_t MSID6:1;
      uint16_t MSID7:1;
      uint16_t MSID8:1;
      uint16_t MSID9:1;
      uint16_t MSID10:1;
      uint16_t MEID0:1;
      uint16_t MEID1:1;
      uint16_t MEID2:1;
      uint16_t MEID3:1;
      uint16_t MEID4:1;
    };
  };
} C1MASK8LBITS;
extern volatile C1MASK8LBITS C1MASK8Lbits __attribute__((__sfr__));

#define C1MASK8H C1MASK8H
extern volatile uint16_t  C1MASK8H __attribute__((__sfr__));
__extension__ typedef struct tagC1MASK8HBITS {
  union {
    struct {
      uint16_t MEID:13;
      uint16_t MSID11:1;
      uint16_t MIDE:1;
    };
    struct {
      uint16_t MEID5:1;
      uint16_t MEID6:1;
      uint16_t MEID7:1;
      uint16_t MEID8:1;
      uint16_t MEID9:1;
      uint16_t MEID10:1;
      uint16_t MEID11:1;
      uint16_t MEID12:1;
      uint16_t MEID13:1;
      uint16_t MEID14:1;
      uint16_t MEID15:1;
      uint16_t MEID16:1;
      uint16_t MEID17:1;
    };
  };
} C1MASK8HBITS;
extern volatile C1MASK8HBITS C1MASK8Hbits __attribute__((__sfr__));

#define C1FLTOBJ9L C1FLTOBJ9L
extern volatile uint16_t  C1FLTOBJ9L __attribute__((__sfr__));
__extension__ typedef struct tagC1FLTOBJ9LBITS {
  union {
    struct {
      uint16_t SID:11;
      uint16_t EID:5;
    };
    struct {
      uint16_t SID0:1;
      uint16_t SID1:1;
      uint16_t SID2:1;
      uint16_t SID3:1;
      uint16_t SID4:1;
      uint16_t SID5:1;
      uint16_t SID6:1;
      uint16_t SID7:1;
      uint16_t SID8:1;
      uint16_t SID9:1;
      uint16_t SID10:1;
      uint16_t EID0:1;
      uint16_t EID1:1;
      uint16_t EID2:1;
      uint16_t EID3:1;
      uint16_t EID4:1;
    };
  };
} C1FLTOBJ9LBITS;
extern volatile C1FLTOBJ9LBITS C1FLTOBJ9Lbits __attribute__((__sfr__));

#define C1FLTOBJ9H C1FLTOBJ9H
extern volatile uint16_t  C1FLTOBJ9H __attribute__((__sfr__));
__extension__ typedef struct tagC1FLTOBJ9HBITS {
  union {
    struct {
      uint16_t EID:13;
      uint16_t SID11:1;
      uint16_t EXIDE:1;
    };
    struct {
      uint16_t EID5:1;
      uint16_t EID6:1;
      uint16_t EID7:1;
      uint16_t EID8:1;
      uint16_t EID9:1;
      uint16_t EID10:1;
      uint16_t EID11:1;
      uint16_t EID12:1;
      uint16_t EID13:1;
      uint16_t EID14:1;
      uint16_t EID15:1;
      uint16_t EID16:1;
      uint16_t EID17:1;
    };
  };
} C1FLTOBJ9HBITS;
extern volatile C1FLTOBJ9HBITS C1FLTOBJ9Hbits __attribute__((__sfr__));

#define C1MASK9L C1MASK9L
extern volatile uint16_t  C1MASK9L __attribute__((__sfr__));
__extension__ typedef struct tagC1MASK9LBITS {
  union {
    struct {
      uint16_t MSID:11;
      uint16_t MEID:5;
    };
    struct {
      uint16_t MSID0:1;
      uint16_t MSID1:1;
      uint16_t MSID2:1;
      uint16_t MSID3:1;
      uint16_t MSID4:1;
      uint16_t MSID5:1;
      uint16_t MSID6:1;
      uint16_t MSID7:1;
      uint16_t MSID8:1;
      uint16_t MSID9:1;
      uint16_t MSID10:1;
      uint16_t MEID0:1;
      uint16_t MEID1:1;
      uint16_t MEID2:1;
      uint16_t MEID3:1;
      uint16_t MEID4:1;
    };
  };
} C1MASK9LBITS;
extern volatile C1MASK9LBITS C1MASK9Lbits __attribute__((__sfr__));

#define C1MASK9H C1MASK9H
extern volatile uint16_t  C1MASK9H __attribute__((__sfr__));
__extension__ typedef struct tagC1MASK9HBITS {
  union {
    struct {
      uint16_t MEID:13;
      uint16_t MSID11:1;
      uint16_t MIDE:1;
    };
    struct {
      uint16_t MEID5:1;
      uint16_t MEID6:1;
      uint16_t MEID7:1;
      uint16_t MEID8:1;
      uint16_t MEID9:1;
      uint16_t MEID10:1;
      uint16_t MEID11:1;
      uint16_t MEID12:1;
      uint16_t MEID13:1;
      uint16_t MEID14:1;
      uint16_t MEID15:1;
      uint16_t MEID16:1;
      uint16_t MEID17:1;
    };
  };
} C1MASK9HBITS;
extern volatile C1MASK9HBITS C1MASK9Hbits __attribute__((__sfr__));

#define C1FLTOBJ10L C1FLTOBJ10L
extern volatile uint16_t  C1FLTOBJ10L __attribute__((__sfr__));
__extension__ typedef struct tagC1FLTOBJ10LBITS {
  union {
    struct {
      uint16_t SID:11;
      uint16_t EID:5;
    };
    struct {
      uint16_t SID0:1;
      uint16_t SID1:1;
      uint16_t SID2:1;
      uint16_t SID3:1;
      uint16_t SID4:1;
      uint16_t SID5:1;
      uint16_t SID6:1;
      uint16_t SID7:1;
      uint16_t SID8:1;
      uint16_t SID9:1;
      uint16_t SID10:1;
      uint16_t EID0:1;
      uint16_t EID1:1;
      uint16_t EID2:1;
      uint16_t EID3:1;
      uint16_t EID4:1;
    };
  };
} C1FLTOBJ10LBITS;
extern volatile C1FLTOBJ10LBITS C1FLTOBJ10Lbits __attribute__((__sfr__));

#define C1FLTOBJ10H C1FLTOBJ10H
extern volatile uint16_t  C1FLTOBJ10H __attribute__((__sfr__));
__extension__ typedef struct tagC1FLTOBJ10HBITS {
  union {
    struct {
      uint16_t EID:13;
      uint16_t SID11:1;
      uint16_t EXIDE:1;
    };
    struct {
      uint16_t EID5:1;
      uint16_t EID6:1;
      uint16_t EID7:1;
      uint16_t EID8:1;
      uint16_t EID9:1;
      uint16_t EID10:1;
      uint16_t EID11:1;
      uint16_t EID12:1;
      uint16_t EID13:1;
      uint16_t EID14:1;
      uint16_t EID15:1;
      uint16_t EID16:1;
      uint16_t EID17:1;
    };
  };
} C1FLTOBJ10HBITS;
extern volatile C1FLTOBJ10HBITS C1FLTOBJ10Hbits __attribute__((__sfr__));

#define C1MASK10L C1MASK10L
extern volatile uint16_t  C1MASK10L __attribute__((__sfr__));
__extension__ typedef struct tagC1MASK10LBITS {
  union {
    struct {
      uint16_t MSID:11;
      uint16_t MEID:5;
    };
    struct {
      uint16_t MSID0:1;
      uint16_t MSID1:1;
      uint16_t MSID2:1;
      uint16_t MSID3:1;
      uint16_t MSID4:1;
      uint16_t MSID5:1;
      uint16_t MSID6:1;
      uint16_t MSID7:1;
      uint16_t MSID8:1;
      uint16_t MSID9:1;
      uint16_t MSID10:1;
      uint16_t MEID0:1;
      uint16_t MEID1:1;
      uint16_t MEID2:1;
      uint16_t MEID3:1;
      uint16_t MEID4:1;
    };
  };
} C1MASK10LBITS;
extern volatile C1MASK10LBITS C1MASK10Lbits __attribute__((__sfr__));

#define C1MASK10H C1MASK10H
extern volatile uint16_t  C1MASK10H __attribute__((__sfr__));
__extension__ typedef struct tagC1MASK10HBITS {
  union {
    struct {
      uint16_t MEID:13;
      uint16_t MSID11:1;
      uint16_t MIDE:1;
    };
    struct {
      uint16_t MEID5:1;
      uint16_t MEID6:1;
      uint16_t MEID7:1;
      uint16_t MEID8:1;
      uint16_t MEID9:1;
      uint16_t MEID10:1;
      uint16_t MEID11:1;
      uint16_t MEID12:1;
      uint16_t MEID13:1;
      uint16_t MEID14:1;
      uint16_t MEID15:1;
      uint16_t MEID16:1;
      uint16_t MEID17:1;
    };
  };
} C1MASK10HBITS;
extern volatile C1MASK10HBITS C1MASK10Hbits __attribute__((__sfr__));

#define C1FLTOBJ11L C1FLTOBJ11L
extern volatile uint16_t  C1FLTOBJ11L __attribute__((__sfr__));
__extension__ typedef struct tagC1FLTOBJ11LBITS {
  union {
    struct {
      uint16_t SID:11;
      uint16_t EID:5;
    };
    struct {
      uint16_t SID0:1;
      uint16_t SID1:1;
      uint16_t SID2:1;
      uint16_t SID3:1;
      uint16_t SID4:1;
      uint16_t SID5:1;
      uint16_t SID6:1;
      uint16_t SID7:1;
      uint16_t SID8:1;
      uint16_t SID9:1;
      uint16_t SID10:1;
      uint16_t EID0:1;
      uint16_t EID1:1;
      uint16_t EID2:1;
      uint16_t EID3:1;
      uint16_t EID4:1;
    };
  };
} C1FLTOBJ11LBITS;
