gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
extern volatile C1FLTOBJ11LBITS C1FLTOBJ11Lbits __attribute__((__sfr__));

#define C1FLTOBJ11H C1FLTOBJ11H
extern volatile uint16_t  C1FLTOBJ11H __attribute__((__sfr__));
__extension__ typedef struct tagC1FLTOBJ11HBITS {
  union {
    struct {
      uint16_t EID:13;
      uint16_t SID11:1;
      uint16_t EXIDE:1;
    };
    struct {
      uint16_t EID5:1;
      uint16_t EID6:1;
      uint16_t EID7:1;
      uint16_t EID8:1;
      uint16_t EID9:1;
      uint16_t EID10:1;
      uint16_t EID11:1;
      uint16_t EID12:1;
      uint16_t EID13:1;
      uint16_t EID14:1;
      uint16_t EID15:1;
      uint16_t EID16:1;
      uint16_t EID17:1;
    };
  };
} C1FLTOBJ11HBITS;
extern volatile C1FLTOBJ11HBITS C1FLTOBJ11Hbits __attribute__((__sfr__));

#define C1MASK11L C1MASK11L
extern volatile uint16_t  C1MASK11L __attribute__((__sfr__));
__extension__ typedef struct tagC1MASK11LBITS {
  union {
    struct {
      uint16_t MSID:11;
      uint16_t MEID:5;
    };
    struct {
      uint16_t MSID0:1;
      uint16_t MSID1:1;
      uint16_t MSID2:1;
      uint16_t MSID3:1;
      uint16_t MSID4:1;
      uint16_t MSID5:1;
      uint16_t MSID6:1;
      uint16_t MSID7:1;
      uint16_t MSID8:1;
      uint16_t MSID9:1;
      uint16_t MSID10:1;
      uint16_t MEID0:1;
      uint16_t MEID1:1;
      uint16_t MEID2:1;
      uint16_t MEID3:1;
      uint16_t MEID4:1;
    };
  };
} C1MASK11LBITS;
extern volatile C1MASK11LBITS C1MASK11Lbits __attribute__((__sfr__));

#define C1MASK11H C1MASK11H
extern volatile uint16_t  C1MASK11H __attribute__((__sfr__));
__extension__ typedef struct tagC1MASK11HBITS {
  union {
    struct {
      uint16_t MEID:13;
      uint16_t MSID11:1;
      uint16_t MIDE:1;
    };
    struct {
      uint16_t MEID5:1;
      uint16_t MEID6:1;
      uint16_t MEID7:1;
      uint16_t MEID8:1;
      uint16_t MEID9:1;
      uint16_t MEID10:1;
      uint16_t MEID11:1;
      uint16_t MEID12:1;
      uint16_t MEID13:1;
      uint16_t MEID14:1;
      uint16_t MEID15:1;
      uint16_t MEID16:1;
      uint16_t MEID17:1;
    };
  };
} C1MASK11HBITS;
extern volatile C1MASK11HBITS C1MASK11Hbits __attribute__((__sfr__));

#define C1FLTOBJ12L C1FLTOBJ12L
extern volatile uint16_t  C1FLTOBJ12L __attribute__((__sfr__));
__extension__ typedef struct tagC1FLTOBJ12LBITS {
  union {
    struct {
      uint16_t SID:11;
      uint16_t EID:5;
    };
    struct {
      uint16_t SID0:1;
      uint16_t SID1:1;
      uint16_t SID2:1;
      uint16_t SID3:1;
      uint16_t SID4:1;
      uint16_t SID5:1;
      uint16_t SID6:1;
      uint16_t SID7:1;
      uint16_t SID8:1;
      uint16_t SID9:1;
      uint16_t SID10:1;
      uint16_t EID0:1;
      uint16_t EID1:1;
      uint16_t EID2:1;
      uint16_t EID3:1;
      uint16_t EID4:1;
    };
  };
} C1FLTOBJ12LBITS;
extern volatile C1FLTOBJ12LBITS C1FLTOBJ12Lbits __attribute__((__sfr__));

#define C1FLTOBJ12H C1FLTOBJ12H
extern volatile uint16_t  C1FLTOBJ12H __attribute__((__sfr__));
__extension__ typedef struct tagC1FLTOBJ12HBITS {
  union {
    struct {
      uint16_t EID:13;
      uint16_t SID11:1;
      uint16_t EXIDE:1;
    };
    struct {
      uint16_t EID5:1;
      uint16_t EID6:1;
      uint16_t EID7:1;
      uint16_t EID8:1;
      uint16_t EID9:1;
      uint16_t EID10:1;
      uint16_t EID11:1;
      uint16_t EID12:1;
      uint16_t EID13:1;
      uint16_t EID14:1;
      uint16_t EID15:1;
      uint16_t EID16:1;
      uint16_t EID17:1;
    };
  };
} C1FLTOBJ12HBITS;
extern volatile C1FLTOBJ12HBITS C1FLTOBJ12Hbits __attribute__((__sfr__));

#define C1MASK12L C1MASK12L
extern volatile uint16_t  C1MASK12L __attribute__((__sfr__));
__extension__ typedef struct tagC1MASK12LBITS {
  union {
    struct {
      uint16_t MSID:11;
      uint16_t MEID:5;
    };
    struct {
      uint16_t MSID0:1;
      uint16_t MSID1:1;
      uint16_t MSID2:1;
      uint16_t MSID3:1;
      uint16_t MSID4:1;
      uint16_t MSID5:1;
      uint16_t MSID6:1;
      uint16_t MSID7:1;
      uint16_t MSID8:1;
      uint16_t MSID9:1;
      uint16_t MSID10:1;
      uint16_t MEID0:1;
      uint16_t MEID1:1;
      uint16_t MEID2:1;
      uint16_t MEID3:1;
      uint16_t MEID4:1;
    };
  };
} C1MASK12LBITS;
extern volatile C1MASK12LBITS C1MASK12Lbits __attribute__((__sfr__));

#define C1MASK12H C1MASK12H
extern volatile uint16_t  C1MASK12H __attribute__((__sfr__));
__extension__ typedef struct tagC1MASK12HBITS {
  union {
    struct {
      uint16_t MEID:13;
      uint16_t MSID11:1;
      uint16_t MIDE:1;
    };
    struct {
      uint16_t MEID5:1;
      uint16_t MEID6:1;
      uint16_t MEID7:1;
      uint16_t MEID8:1;
      uint16_t MEID9:1;
      uint16_t MEID10:1;
      uint16_t MEID11:1;
      uint16_t MEID12:1;
      uint16_t MEID13:1;
      uint16_t MEID14:1;
      uint16_t MEID15:1;
      uint16_t MEID16:1;
      uint16_t MEID17:1;
    };
  };
} C1MASK12HBITS;
extern volatile C1MASK12HBITS C1MASK12Hbits __attribute__((__sfr__));

#define C1FLTOBJ13L C1FLTOBJ13L
extern volatile uint16_t  C1FLTOBJ13L __attribute__((__sfr__));
__extension__ typedef struct tagC1FLTOBJ13LBITS {
  union {
    struct {
      uint16_t SID:11;
      uint16_t EID:5;
    };
    struct {
      uint16_t SID0:1;
      uint16_t SID1:1;
      uint16_t SID2:1;
      uint16_t SID3:1;
      uint16_t SID4:1;
      uint16_t SID5:1;
      uint16_t SID6:1;
      uint16_t SID7:1;
      uint16_t SID8:1;
      uint16_t SID9:1;
      uint16_t SID10:1;
      uint16_t EID0:1;
      uint16_t EID1:1;
      uint16_t EID2:1;
      uint16_t EID3:1;
      uint16_t EID4:1;
    };
  };
} C1FLTOBJ13LBITS;
extern volatile C1FLTOBJ13LBITS C1FLTOBJ13Lbits __attribute__((__sfr__));

#define C1FLTOBJ13H C1FLTOBJ13H
extern volatile uint16_t  C1FLTOBJ13H __attribute__((__sfr__));
__extension__ typedef struct tagC1FLTOBJ13HBITS {
  union {
    struct {
      uint16_t EID:13;
      uint16_t SID11:1;
      uint16_t EXIDE:1;
    };
    struct {
      uint16_t EID5:1;
      uint16_t EID6:1;
      uint16_t EID7:1;
      uint16_t EID8:1;
      uint16_t EID9:1;
      uint16_t EID10:1;
      uint16_t EID11:1;
      uint16_t EID12:1;
      uint16_t EID13:1;
      uint16_t EID14:1;
      uint16_t EID15:1;
      uint16_t EID16:1;
      uint16_t EID17:1;
    };
  };
} C1FLTOBJ13HBITS;
