gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
extern volatile C1FLTOBJ13HBITS C1FLTOBJ13Hbits __attribute__((__sfr__));

#define C1MASK13L C1MASK13L
extern volatile uint16_t  C1MASK13L __attribute__((__sfr__));
__extension__ typedef struct tagC1MASK13LBITS {
  union {
    struct {
      uint16_t MSID:11;
      uint16_t MEID:5;
    };
    struct {
      uint16_t MSID0:1;
      uint16_t MSID1:1;
      uint16_t MSID2:1;
      uint16_t MSID3:1;
      uint16_t MSID4:1;
      uint16_t MSID5:1;
      uint16_t MSID6:1;
      uint16_t MSID7:1;
      uint16_t MSID8:1;
      uint16_t MSID9:1;
      uint16_t MSID10:1;
      uint16_t MEID0:1;
      uint16_t MEID1:1;
      uint16_t MEID2:1;
      uint16_t MEID3:1;
      uint16_t MEID4:1;
    };
  };
} C1MASK13LBITS;
extern volatile C1MASK13LBITS C1MASK13Lbits __attribute__((__sfr__));

#define C1MASK13H C1MASK13H
extern volatile uint16_t  C1MASK13H __attribute__((__sfr__));
__extension__ typedef struct tagC1MASK13HBITS {
  union {
    struct {
      uint16_t MEID:13;
      uint16_t MSID11:1;
      uint16_t MIDE:1;
    };
    struct {
      uint16_t MEID5:1;
      uint16_t MEID6:1;
      uint16_t MEID7:1;
      uint16_t MEID8:1;
      uint16_t MEID9:1;
      uint16_t MEID10:1;
      uint16_t MEID11:1;
      uint16_t MEID12:1;
      uint16_t MEID13:1;
      uint16_t MEID14:1;
      uint16_t MEID15:1;
      uint16_t MEID16:1;
      uint16_t MEID17:1;
    };
  };
} C1MASK13HBITS;
extern volatile C1MASK13HBITS C1MASK13Hbits __attribute__((__sfr__));

#define C1FLTOBJ14L C1FLTOBJ14L
extern volatile uint16_t  C1FLTOBJ14L __attribute__((__sfr__));
__extension__ typedef struct tagC1FLTOBJ14LBITS {
  union {
    struct {
      uint16_t SID:11;
      uint16_t EID:5;
    };
    struct {
      uint16_t SID0:1;
      uint16_t SID1:1;
      uint16_t SID2:1;
      uint16_t SID3:1;
      uint16_t SID4:1;
      uint16_t SID5:1;
      uint16_t SID6:1;
      uint16_t SID7:1;
      uint16_t SID8:1;
      uint16_t SID9:1;
      uint16_t SID10:1;
      uint16_t EID0:1;
      uint16_t EID1:1;
      uint16_t EID2:1;
      uint16_t EID3:1;
      uint16_t EID4:1;
    };
  };
} C1FLTOBJ14LBITS;
extern volatile C1FLTOBJ14LBITS C1FLTOBJ14Lbits __attribute__((__sfr__));

#define C1FLTOBJ14H C1FLTOBJ14H
extern volatile uint16_t  C1FLTOBJ14H __attribute__((__sfr__));
__extension__ typedef struct tagC1FLTOBJ14HBITS {
  union {
    struct {
      uint16_t EID:13;
      uint16_t SID11:1;
      uint16_t EXIDE:1;
    };
    struct {
      uint16_t EID5:1;
      uint16_t EID6:1;
      uint16_t EID7:1;
      uint16_t EID8:1;
      uint16_t EID9:1;
      uint16_t EID10:1;
      uint16_t EID11:1;
      uint16_t EID12:1;
      uint16_t EID13:1;
      uint16_t EID14:1;
      uint16_t EID15:1;
      uint16_t EID16:1;
      uint16_t EID17:1;
    };
  };
} C1FLTOBJ14HBITS;
extern volatile C1FLTOBJ14HBITS C1FLTOBJ14Hbits __attribute__((__sfr__));

#define C1MASK14L C1MASK14L
extern volatile uint16_t  C1MASK14L __attribute__((__sfr__));
__extension__ typedef struct tagC1MASK14LBITS {
  union {
    struct {
      uint16_t MSID:11;
      uint16_t MEID:5;
    };
    struct {
      uint16_t MSID0:1;
      uint16_t MSID1:1;
      uint16_t MSID2:1;
      uint16_t MSID3:1;
      uint16_t MSID4:1;
      uint16_t MSID5:1;
      uint16_t MSID6:1;
      uint16_t MSID7:1;
      uint16_t MSID8:1;
      uint16_t MSID9:1;
      uint16_t MSID10:1;
      uint16_t MEID0:1;
      uint16_t MEID1:1;
      uint16_t MEID2:1;
      uint16_t MEID3:1;
      uint16_t MEID4:1;
    };
  };
} C1MASK14LBITS;
extern volatile C1MASK14LBITS C1MASK14Lbits __attribute__((__sfr__));

#define C1MASK14H C1MASK14H
extern volatile uint16_t  C1MASK14H __attribute__((__sfr__));
__extension__ typedef struct tagC1MASK14HBITS {
  union {
    struct {
      uint16_t MEID:13;
      uint16_t MSID11:1;
      uint16_t MIDE:1;
    };
    struct {
      uint16_t MEID5:1;
      uint16_t MEID6:1;
      uint16_t MEID7:1;
      uint16_t MEID8:1;
      uint16_t MEID9:1;
      uint16_t MEID10:1;
      uint16_t MEID11:1;
      uint16_t MEID12:1;
      uint16_t MEID13:1;
      uint16_t MEID14:1;
      uint16_t MEID15:1;
      uint16_t MEID16:1;
      uint16_t MEID17:1;
    };
  };
} C1MASK14HBITS;
extern volatile C1MASK14HBITS C1MASK14Hbits __attribute__((__sfr__));

#define C1FLTOBJ15L C1FLTOBJ15L
extern volatile uint16_t  C1FLTOBJ15L __attribute__((__sfr__));
__extension__ typedef struct tagC1FLTOBJ15LBITS {
  union {
    struct {
      uint16_t SID:11;
      uint16_t EID:5;
    };
    struct {
      uint16_t SID0:1;
      uint16_t SID1:1;
      uint16_t SID2:1;
      uint16_t SID3:1;
      uint16_t SID4:1;
      uint16_t SID5:1;
      uint16_t SID6:1;
      uint16_t SID7:1;
      uint16_t SID8:1;
      uint16_t SID9:1;
      uint16_t SID10:1;
      uint16_t EID0:1;
      uint16_t EID1:1;
      uint16_t EID2:1;
      uint16_t EID3:1;
      uint16_t EID4:1;
    };
  };
} C1FLTOBJ15LBITS;
extern volatile C1FLTOBJ15LBITS C1FLTOBJ15Lbits __attribute__((__sfr__));

#define C1FLTOBJ15H C1FLTOBJ15H
extern volatile uint16_t  C1FLTOBJ15H __attribute__((__sfr__));
__extension__ typedef struct tagC1FLTOBJ15HBITS {
  union {
    struct {
      uint16_t EID:13;
      uint16_t SID11:1;
      uint16_t EXIDE:1;
    };
    struct {
      uint16_t EID5:1;
      uint16_t EID6:1;
      uint16_t EID7:1;
      uint16_t EID8:1;
      uint16_t EID9:1;
      uint16_t EID10:1;
      uint16_t EID11:1;
      uint16_t EID12:1;
      uint16_t EID13:1;
      uint16_t EID14:1;
      uint16_t EID15:1;
      uint16_t EID16:1;
      uint16_t EID17:1;
    };
  };
} C1FLTOBJ15HBITS;
extern volatile C1FLTOBJ15HBITS C1FLTOBJ15Hbits __attribute__((__sfr__));

#define C1MASK15L C1MASK15L
extern volatile uint16_t  C1MASK15L __attribute__((__sfr__));
__extension__ typedef struct tagC1MASK15LBITS {
  union {
    struct {
      uint16_t MSID:11;
      uint16_t MEID:5;
    };
    struct {
      uint16_t MSID0:1;
      uint16_t MSID1:1;
      uint16_t MSID2:1;
      uint16_t MSID3:1;
      uint16_t MSID4:1;
      uint16_t MSID5:1;
      uint16_t MSID6:1;
      uint16_t MSID7:1;
      uint16_t MSID8:1;
      uint16_t MSID9:1;
      uint16_t MSID10:1;
      uint16_t MEID0:1;
      uint16_t MEID1:1;
      uint16_t MEID2:1;
      uint16_t MEID3:1;
      uint16_t MEID4:1;
    };
  };
} C1MASK15LBITS;
