gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
extern volatile C1MASK15LBITS C1MASK15Lbits __attribute__((__sfr__));

#define C1MASK15H C1MASK15H
extern volatile uint16_t  C1MASK15H __attribute__((__sfr__));
__extension__ typedef struct tagC1MASK15HBITS {
  union {
    struct {
      uint16_t MEID:13;
      uint16_t MSID11:1;
      uint16_t MIDE:1;
    };
    struct {
      uint16_t MEID5:1;
      uint16_t MEID6:1;
      uint16_t MEID7:1;
      uint16_t MEID8:1;
      uint16_t MEID9:1;
      uint16_t MEID10:1;
      uint16_t MEID11:1;
      uint16_t MEID12:1;
      uint16_t MEID13:1;
      uint16_t MEID14:1;
      uint16_t MEID15:1;
      uint16_t MEID16:1;
      uint16_t MEID17:1;
    };
  };
} C1MASK15HBITS;
extern volatile C1MASK15HBITS C1MASK15Hbits __attribute__((__sfr__));

#define IFS0 IFS0
extern volatile uint16_t  IFS0 __attribute__((__sfr__));
typedef struct tagIFS0BITS {
  uint16_t INT0IF:1;
  uint16_t T1IF:1;
  uint16_t CNAIF:1;
  uint16_t CNBIF:1;
  uint16_t DMA0IF:1;
  uint16_t :1;
  uint16_t CCP1IF:1;
  uint16_t CCT1IF:1;
  uint16_t DMA1IF:1;
  uint16_t SPI1RXIF:1;
  uint16_t SPI1TXIF:1;
  uint16_t U1RXIF:1;
  uint16_t U1TXIF:1;
  uint16_t ECCSBEIF:1;
  uint16_t NVMIF:1;
  uint16_t INT1IF:1;
} IFS0BITS;
extern volatile IFS0BITS IFS0bits __attribute__((__sfr__));

#define IFS1 IFS1
extern volatile uint16_t  IFS1 __attribute__((__sfr__));
typedef struct tagIFS1BITS {
  uint16_t SI2C1IF:1;
  uint16_t MI2C1IF:1;
  uint16_t DMA2IF:1;
  uint16_t CNCIF:1;
  uint16_t INT2IF:1;
  uint16_t DMA3IF:1;
  uint16_t :1;
  uint16_t CCP2IF:1;
  uint16_t CCT2IF:1;
  uint16_t C1IF:1;
  uint16_t INT3IF:1;
  uint16_t U2RXIF:1;
  uint16_t U2TXIF:1;
  uint16_t SPI2RXIF:1;
  uint16_t SPI2TXIF:1;
  uint16_t C1RXIF:1;
} IFS1BITS;
extern volatile IFS1BITS IFS1bits __attribute__((__sfr__));

#define IFS2 IFS2
extern volatile uint16_t  IFS2 __attribute__((__sfr__));
typedef struct tagIFS2BITS {
  uint16_t :3;
  uint16_t CCP3IF:1;
  uint16_t CCT3IF:1;
  uint16_t SI2C2IF:1;
  uint16_t MI2C2IF:1;
  uint16_t :1;
  uint16_t CCP4IF:1;
  uint16_t CCT4IF:1;
  uint16_t :1;
  uint16_t CCP5IF:1;
  uint16_t CCT5IF:1;
  uint16_t DMTIF:1;
  uint16_t CCP6IF:1;
  uint16_t CCT6IF:1;
} IFS2BITS;
extern volatile IFS2BITS IFS2bits __attribute__((__sfr__));

#define IFS3 IFS3
extern volatile uint16_t  IFS3 __attribute__((__sfr__));
typedef struct tagIFS3BITS {
  uint16_t QEI1IF:1;
  uint16_t U1EIF:1;
  uint16_t U2EIF:1;
  uint16_t CRCIF:1;
  uint16_t C1TXIF:1;
  uint16_t :1;
  uint16_t QEI2IF:1;
  uint16_t :1;
  uint16_t U3EIF:1;
  uint16_t U3RXIF:1;
  uint16_t U3TXIF:1;
  uint16_t SPI3RXIF:1;
  uint16_t SPI3TXIF:1;
  uint16_t :1;
  uint16_t JTAGIF:1;
  uint16_t PTGSTEPIF:1;
} IFS3BITS;
extern volatile IFS3BITS IFS3bits __attribute__((__sfr__));

#define IFS4 IFS4
extern volatile uint16_t  IFS4 __attribute__((__sfr__));
typedef struct tagIFS4BITS {
  uint16_t I2C1BCIF:1;
  uint16_t I2C2BCIF:1;
  uint16_t :1;
  uint16_t PWM1IF:1;
  uint16_t PWM2IF:1;
  uint16_t PWM3IF:1;
  uint16_t PWM4IF:1;
  uint16_t PWM5IF:1;
  uint16_t PWM6IF:1;
  uint16_t PWM7IF:1;
  uint16_t PWM8IF:1;
  uint16_t CNDIF:1;
  uint16_t :1;
  uint16_t CMP1IF:1;
  uint16_t CMP2IF:1;
  uint16_t CMP3IF:1;
} IFS4BITS;
extern volatile IFS4BITS IFS4bits __attribute__((__sfr__));

#define IFS5 IFS5
extern volatile uint16_t  IFS5 __attribute__((__sfr__));
typedef struct tagIFS5BITS {
  uint16_t :1;
  uint16_t PTGWDTIF:1;
  uint16_t PTG0IF:1;
  uint16_t PTG1IF:1;
  uint16_t PTG2IF:1;
  uint16_t PTG3IF:1;
  uint16_t SENT1IF:1;
  uint16_t SENT1EIF:1;
  uint16_t SENT2IF:1;
  uint16_t SENT2EIF:1;
  uint16_t ADCIF:1;
  uint16_t ADCAN0IF:1;
  uint16_t ADCAN1IF:1;
  uint16_t ADCAN2IF:1;
  uint16_t ADCAN3IF:1;
  uint16_t ADCAN4IF:1;
} IFS5BITS;
extern volatile IFS5BITS IFS5bits __attribute__((__sfr__));

#define IFS6 IFS6
extern volatile uint16_t  IFS6 __attribute__((__sfr__));
typedef struct tagIFS6BITS {
  uint16_t ADCAN5IF:1;
  uint16_t ADCAN6IF:1;
  uint16_t ADCAN7IF:1;
  uint16_t ADCAN8IF:1;
  uint16_t ADCAN9IF:1;
  uint16_t ADCAN10IF:1;
  uint16_t ADCAN11IF:1;
  uint16_t ADCAN12IF:1;
  uint16_t ADCAN13IF:1;
  uint16_t ADCAN14IF:1;
  uint16_t ADCAN15IF:1;
  uint16_t ADCAN16IF:1;
  uint16_t ADCAN17IF:1;
  uint16_t ADCAN18IF:1;
} IFS6BITS;
extern volatile IFS6BITS IFS6bits __attribute__((__sfr__));

#define IFS7 IFS7
extern volatile uint16_t  IFS7 __attribute__((__sfr__));
typedef struct tagIFS7BITS {
  uint16_t :3;
  uint16_t ADFLTIF:1;
  uint16_t ADCMP0IF:1;
  uint16_t ADCMP1IF:1;
  uint16_t ADCMP2IF:1;
  uint16_t ADCMP3IF:1;
  uint16_t ADFLTR0IF:1;
  uint16_t ADFLTR1IF:1;
  uint16_t ADFLTR2IF:1;
  uint16_t ADFLTR3IF:1;
  uint16_t CLC1PIF:1;
  uint16_t CLC2PIF:1;
  uint16_t SPI1IF:1;
  uint16_t SPI2IF:1;
} IFS7BITS;
extern volatile IFS7BITS IFS7bits __attribute__((__sfr__));

#define IFS8 IFS8
extern volatile uint16_t  IFS8 __attribute__((__sfr__));
typedef struct tagIFS8BITS {
  uint16_t SPI3IF:1;
  uint16_t :13;
  uint16_t SI2C3IF:1;
  uint16_t MI2C3IF:1;
} IFS8BITS;
extern volatile IFS8BITS IFS8bits __attribute__((__sfr__));

#define IFS9 IFS9
extern volatile uint16_t  IFS9 __attribute__((__sfr__));
typedef struct tagIFS9BITS {
  uint16_t I2C3BCIF:1;
  uint16_t :4;
  uint16_t CCP7IF:1;
  uint16_t CCT7IF:1;
  uint16_t :1;
  uint16_t CCP8IF:1;
  uint16_t CCT8IF:1;
} IFS9BITS;
extern volatile IFS9BITS IFS9bits __attribute__((__sfr__));

#define IFS10 IFS10
extern volatile uint16_t  IFS10 __attribute__((__sfr__));
typedef struct tagIFS10BITS {
  uint16_t ADC0EIF:1;
  uint16_t ADC1EIF:1;
  uint16_t :6;
  uint16_t ADFIFOIF:1;
  uint16_t PEVTAIF:1;
  uint16_t PEVTBIF:1;
  uint16_t PEVTCIF:1;
  uint16_t PEVTDIF:1;
  uint16_t PEVTEIF:1;
  uint16_t PEVTFIF:1;
  uint16_t CLC3PIF:1;
} IFS10BITS;
extern volatile IFS10BITS IFS10bits __attribute__((__sfr__));

#define IFS11 IFS11
extern volatile uint16_t  IFS11 __attribute__((__sfr__));
typedef struct tagIFS11BITS {
  uint16_t CLC4PIF:1;
  uint16_t CLC1NIF:1;
  uint16_t CLC2NIF:1;
  uint16_t CLC3NIF:1;
  uint16_t CLC4NIF:1;
  uint16_t CCP9IF:1;
  uint16_t CCT9IF:1;
  uint16_t :6;
  uint16_t U1EVTIF:1;
  uint16_t U2EVTIF:1;
  uint16_t U3EVTIF:1;
} IFS11BITS;
extern volatile IFS11BITS IFS11bits __attribute__((__sfr__));

#define IFS12 IFS12
extern volatile uint16_t  IFS12 __attribute__((__sfr__));
typedef struct tagIFS12BITS {
  uint16_t ADCAN24IF:1;
  uint16_t ADCAN25IF:1;
} IFS12BITS;
extern volatile IFS12BITS IFS12bits __attribute__((__sfr__));

