gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
#define IEC0 IEC0
extern volatile uint16_t  IEC0 __attribute__((__sfr__));
typedef struct tagIEC0BITS {
  uint16_t INT0IE:1;
  uint16_t T1IE:1;
  uint16_t CNAIE:1;
  uint16_t CNBIE:1;
  uint16_t DMA0IE:1;
  uint16_t :1;
  uint16_t CCP1IE:1;
  uint16_t CCT1IE:1;
  uint16_t DMA1IE:1;
  uint16_t SPI1RXIE:1;
  uint16_t SPI1TXIE:1;
  uint16_t U1RXIE:1;
  uint16_t U1TXIE:1;
  uint16_t ECCSBEIE:1;
  uint16_t NVMIE:1;
  uint16_t INT1IE:1;
} IEC0BITS;
extern volatile IEC0BITS IEC0bits __attribute__((__sfr__));

#define IEC1 IEC1
extern volatile uint16_t  IEC1 __attribute__((__sfr__));
typedef struct tagIEC1BITS {
  uint16_t SI2C1IE:1;
  uint16_t MI2C1IE:1;
  uint16_t DMA2IE:1;
  uint16_t CNCIE:1;
  uint16_t INT2IE:1;
  uint16_t DMA3IE:1;
  uint16_t :1;
  uint16_t CCP2IE:1;
  uint16_t CCT2IE:1;
  uint16_t C1IE:1;
  uint16_t INT3IE:1;
  uint16_t U2RXIE:1;
  uint16_t U2TXIE:1;
  uint16_t SPI2RXIE:1;
  uint16_t SPI2TXIE:1;
  uint16_t C1RXIE:1;
} IEC1BITS;
extern volatile IEC1BITS IEC1bits __attribute__((__sfr__));

#define IEC2 IEC2
extern volatile uint16_t  IEC2 __attribute__((__sfr__));
typedef struct tagIEC2BITS {
  uint16_t :3;
  uint16_t CCP3IE:1;
  uint16_t CCT3IE:1;
  uint16_t SI2C2IE:1;
  uint16_t MI2C2IE:1;
  uint16_t :1;
  uint16_t CCP4IE:1;
  uint16_t CCT4IE:1;
  uint16_t :1;
  uint16_t CCP5IE:1;
  uint16_t CCT5IE:1;
  uint16_t DMTIE:1;
  uint16_t CCP6IE:1;
  uint16_t CCT6IE:1;
} IEC2BITS;
extern volatile IEC2BITS IEC2bits __attribute__((__sfr__));

#define IEC3 IEC3
extern volatile uint16_t  IEC3 __attribute__((__sfr__));
typedef struct tagIEC3BITS {
  uint16_t QEI1IE:1;
  uint16_t U1EIE:1;
  uint16_t U2EIE:1;
  uint16_t CRCIE:1;
  uint16_t C1TXIE:1;
  uint16_t :1;
  uint16_t QEI2IE:1;
  uint16_t :1;
  uint16_t U3EIE:1;
  uint16_t U3RXIE:1;
  uint16_t U3TXIE:1;
  uint16_t SPI3RXIE:1;
  uint16_t SPI3TXIE:1;
  uint16_t :1;
  uint16_t JTAGIE:1;
  uint16_t PTGSTEPIE:1;
} IEC3BITS;
extern volatile IEC3BITS IEC3bits __attribute__((__sfr__));

#define IEC4 IEC4
extern volatile uint16_t  IEC4 __attribute__((__sfr__));
typedef struct tagIEC4BITS {
  uint16_t I2C1BCIE:1;
  uint16_t I2C2BCIE:1;
  uint16_t :1;
  uint16_t PWM1IE:1;
  uint16_t PWM2IE:1;
  uint16_t PWM3IE:1;
  uint16_t PWM4IE:1;
  uint16_t PWM5IE:1;
  uint16_t PWM6IE:1;
  uint16_t PWM7IE:1;
  uint16_t PWM8IE:1;
  uint16_t CNDIE:1;
  uint16_t :1;
  uint16_t CMP1IE:1;
  uint16_t CMP2IE:1;
  uint16_t CMP3IE:1;
} IEC4BITS;
extern volatile IEC4BITS IEC4bits __attribute__((__sfr__));

#define IEC5 IEC5
extern volatile uint16_t  IEC5 __attribute__((__sfr__));
typedef struct tagIEC5BITS {
  uint16_t :1;
  uint16_t PTGWDTIE:1;
  uint16_t PTG0IE:1;
  uint16_t PTG1IE:1;
  uint16_t PTG2IE:1;
  uint16_t PTG3IE:1;
  uint16_t SENT1IE:1;
  uint16_t SENT1EIE:1;
  uint16_t SENT2IE:1;
  uint16_t SENT2EIE:1;
  uint16_t ADCIE:1;
  uint16_t ADCAN0IE:1;
  uint16_t ADCAN1IE:1;
  uint16_t ADCAN2IE:1;
  uint16_t ADCAN3IE:1;
  uint16_t ADCAN4IE:1;
} IEC5BITS;
extern volatile IEC5BITS IEC5bits __attribute__((__sfr__));

#define IEC6 IEC6
extern volatile uint16_t  IEC6 __attribute__((__sfr__));
typedef struct tagIEC6BITS {
  uint16_t ADCAN5IE:1;
  uint16_t ADCAN6IE:1;
  uint16_t ADCAN7IE:1;
  uint16_t ADCAN8IE:1;
  uint16_t ADCAN9IE:1;
  uint16_t ADCAN10IE:1;
  uint16_t ADCAN11IE:1;
  uint16_t ADCAN12IE:1;
  uint16_t ADCAN13IE:1;
  uint16_t ADCAN14IE:1;
  uint16_t ADCAN15IE:1;
  uint16_t ADCAN16IE:1;
  uint16_t ADCAN17IE:1;
  uint16_t ADCAN18IE:1;
} IEC6BITS;
extern volatile IEC6BITS IEC6bits __attribute__((__sfr__));

#define IEC7 IEC7
extern volatile uint16_t  IEC7 __attribute__((__sfr__));
typedef struct tagIEC7BITS {
  uint16_t :3;
  uint16_t ADFLTIE:1;
  uint16_t ADCMP0IE:1;
  uint16_t ADCMP1IE:1;
  uint16_t ADCMP2IE:1;
  uint16_t ADCMP3IE:1;
  uint16_t ADFLTR0IE:1;
  uint16_t ADFLTR1IE:1;
  uint16_t ADFLTR2IE:1;
  uint16_t ADFLTR3IE:1;
  uint16_t CLC1PIE:1;
  uint16_t CLC2PIE:1;
  uint16_t SPI1IE:1;
  uint16_t SPI2IE:1;
} IEC7BITS;
extern volatile IEC7BITS IEC7bits __attribute__((__sfr__));

#define IEC8 IEC8
extern volatile uint16_t  IEC8 __attribute__((__sfr__));
typedef struct tagIEC8BITS {
  uint16_t SPI3IE:1;
  uint16_t :13;
  uint16_t SI2C3IE:1;
  uint16_t MI2C3IE:1;
} IEC8BITS;
extern volatile IEC8BITS IEC8bits __attribute__((__sfr__));

#define IEC9 IEC9
extern volatile uint16_t  IEC9 __attribute__((__sfr__));
typedef struct tagIEC9BITS {
  uint16_t I2C3BCIE:1;
  uint16_t :4;
  uint16_t CCP7IE:1;
  uint16_t CCT7IE:1;
  uint16_t :1;
  uint16_t CCP8IE:1;
  uint16_t CCT8IE:1;
} IEC9BITS;
extern volatile IEC9BITS IEC9bits __attribute__((__sfr__));

#define IEC10 IEC10
extern volatile uint16_t  IEC10 __attribute__((__sfr__));
typedef struct tagIEC10BITS {
  uint16_t ADC0EIE:1;
  uint16_t ADC1EIE:1;
  uint16_t :6;
  uint16_t ADFIFOIE:1;
  uint16_t PEVTAIE:1;
  uint16_t PEVTBIE:1;
  uint16_t PEVTCIE:1;
  uint16_t PEVTDIE:1;
  uint16_t PEVTEIE:1;
  uint16_t PEVTFIE:1;
  uint16_t CLC3PIE:1;
} IEC10BITS;
extern volatile IEC10BITS IEC10bits __attribute__((__sfr__));

#define IEC11 IEC11
extern volatile uint16_t  IEC11 __attribute__((__sfr__));
typedef struct tagIEC11BITS {
  uint16_t CLC4PIE:1;
  uint16_t CLC1NIE:1;
  uint16_t CLC2NIE:1;
  uint16_t CLC3NIE:1;
  uint16_t CLC4NIE:1;
  uint16_t CCP9IE:1;
  uint16_t CCT9IE:1;
  uint16_t :6;
  uint16_t U1EVTIE:1;
  uint16_t U2EVTIE:1;
  uint16_t U3EVTIE:1;
} IEC11BITS;
extern volatile IEC11BITS IEC11bits __attribute__((__sfr__));

#define IEC12 IEC12
extern volatile uint16_t  IEC12 __attribute__((__sfr__));
typedef struct tagIEC12BITS {
  uint16_t ADCAN24IE:1;
  uint16_t ADCAN25IE:1;
} IEC12BITS;
extern volatile IEC12BITS IEC12bits __attribute__((__sfr__));

#define IPC0 IPC0
extern volatile uint16_t  IPC0 __attribute__((__sfr__));
typedef struct tagIPC0BITS {
  uint16_t INT0IP:3;
  uint16_t :1;
  uint16_t T1IP:3;
  uint16_t :1;
  uint16_t CNAIP:3;
  uint16_t :1;
  uint16_t CNBIP:3;
} IPC0BITS;
extern volatile IPC0BITS IPC0bits __attribute__((__sfr__));

#define IPC1 IPC1
extern volatile uint16_t  IPC1 __attribute__((__sfr__));
typedef struct tagIPC1BITS {
  uint16_t DMA0IP:3;
  uint16_t :5;
  uint16_t CCP1IP:3;
  uint16_t :1;
  uint16_t CCT1IP:3;
} IPC1BITS;
extern volatile IPC1BITS IPC1bits __attribute__((__sfr__));

#define IPC2 IPC2
extern volatile uint16_t  IPC2 __attribute__((__sfr__));
typedef struct tagIPC2BITS {
  uint16_t DMA1IP:3;
  uint16_t :1;
  uint16_t SPI1RXIP:3;
  uint16_t :1;
  uint16_t SPI1TXIP:3;
  uint16_t :1;
  uint16_t U1RXIP:3;
} IPC2BITS;
