gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
extern volatile INTCON3BITS INTCON3bits __attribute__((__sfr__));

#define INTCON4 INTCON4
extern volatile uint16_t  INTCON4 __attribute__((__sfr__));
typedef struct tagINTCON4BITS {
  uint16_t SGHT:1;
  uint16_t ECCDBE:1;
} INTCON4BITS;
extern volatile INTCON4BITS INTCON4bits __attribute__((__sfr__));

#define INTTREG INTTREG
extern volatile uint16_t  INTTREG __attribute__((__sfr__));
__extension__ typedef struct tagINTTREGBITS {
  union {
    struct {
      uint16_t VECNUM:8;
      uint16_t ILR:4;
      uint16_t :1;
      uint16_t VHOLD:1;
      uint16_t TMODE:1;
      uint16_t IRQCPU:1;
    };
    struct {
      uint16_t VECNUM0:1;
      uint16_t VECNUM1:1;
      uint16_t VECNUM2:1;
      uint16_t VECNUM3:1;
      uint16_t VECNUM4:1;
      uint16_t VECNUM5:1;
      uint16_t VECNUM6:1;
      uint16_t VECNUM7:1;
      uint16_t ILR0:1;
      uint16_t ILR1:1;
      uint16_t ILR2:1;
      uint16_t ILR3:1;
    };
  };
} INTTREGBITS;
extern volatile INTTREGBITS INTTREGbits __attribute__((__sfr__));

#define NVMCON NVMCON
extern volatile uint16_t  NVMCON __attribute__((__sfr__));
__extension__ typedef struct tagNVMCONBITS {
  union {
    struct {
      uint16_t NVMOP:4;
      uint16_t :4;
      uint16_t URERR:1;
      uint16_t RPDF:1;
      uint16_t P2ACTIV:1;
      uint16_t SFTSWP:1;
      uint16_t NVMSIDL:1;
      uint16_t WRERR:1;
      uint16_t WREN:1;
      uint16_t WR:1;
    };
    struct {
      uint16_t NVMOP0:1;
      uint16_t NVMOP1:1;
      uint16_t NVMOP2:1;
      uint16_t NVMOP3:1;
    };
  };
} NVMCONBITS;
extern volatile NVMCONBITS NVMCONbits __attribute__((__sfr__));

#define NVMADR NVMADR
extern volatile uint16_t  NVMADR __attribute__((__sfr__));
__extension__ typedef struct tagNVMADRBITS {
  union {
    struct {
      uint16_t :1;
      uint16_t NVMADRL:15;
    };
    struct {
      uint16_t :1;
      uint16_t NVMADR:15;
    };
  };
} NVMADRBITS;
extern volatile NVMADRBITS NVMADRbits __attribute__((__sfr__));

#define NVMADRL NVMADRL
extern volatile uint16_t  NVMADRL __attribute__((__sfr__));
__extension__ typedef struct tagNVMADRLBITS {
  union {
    struct {
      uint16_t :1;
      uint16_t NVMADRL:15;
    };
    struct {
      uint16_t :1;
      uint16_t NVMADR:15;
    };
  };
} NVMADRLBITS;
extern volatile NVMADRLBITS NVMADRLbits __attribute__((__sfr__));

#define NVMADRH NVMADRH
extern volatile uint16_t  NVMADRH __attribute__((__sfr__));
__extension__ typedef struct tagNVMADRHBITS {
  union {
    struct {
      uint16_t NVMADRH:8;
    };
    struct {
      uint16_t NVMADRU:8;
    };
  };
} NVMADRHBITS;
extern volatile NVMADRHBITS NVMADRHbits __attribute__((__sfr__));

#define NVMADRU NVMADRU
extern volatile uint16_t  NVMADRU __attribute__((__sfr__));
__extension__ typedef struct tagNVMADRUBITS {
  union {
    struct {
      uint16_t NVMADRH:8;
    };
    struct {
      uint16_t NVMADRU:8;
    };
  };
} NVMADRUBITS;
extern volatile NVMADRUBITS NVMADRUbits __attribute__((__sfr__));

#define NVMKEY NVMKEY
extern volatile uint16_t  NVMKEY __attribute__((__sfr__));
#define NVMSRCADDR NVMSRCADDR
extern volatile uint16_t  NVMSRCADDR __attribute__((__sfr__));
typedef struct tagNVMSRCADDRBITS {
  uint16_t :1;
  uint16_t NVMSRCADRL:15;
} NVMSRCADDRBITS;
extern volatile NVMSRCADDRBITS NVMSRCADDRbits __attribute__((__sfr__));

#define NVMSRCADR NVMSRCADR
extern volatile uint16_t  NVMSRCADR __attribute__((__sfr__));
typedef struct tagNVMSRCADRBITS {
  uint16_t :1;
  uint16_t NVMSRCADRL:15;
} NVMSRCADRBITS;
extern volatile NVMSRCADRBITS NVMSRCADRbits __attribute__((__sfr__));

#define NVMSRCADRL NVMSRCADRL
extern volatile uint16_t  NVMSRCADRL __attribute__((__sfr__));
typedef struct tagNVMSRCADRLBITS {
  uint16_t :1;
  uint16_t NVMSRCADRL:15;
} NVMSRCADRLBITS;
extern volatile NVMSRCADRLBITS NVMSRCADRLbits __attribute__((__sfr__));

#define NVMSRCADRH NVMSRCADRH
extern volatile uint16_t  NVMSRCADRH __attribute__((__sfr__));
typedef struct tagNVMSRCADRHBITS {
  uint16_t NVMSRCADRH:8;
} NVMSRCADRHBITS;
extern volatile NVMSRCADRHBITS NVMSRCADRHbits __attribute__((__sfr__));

#define AMPCON1L AMPCON1L
extern volatile uint16_t  AMPCON1L __attribute__((__sfr__));
typedef struct tagAMPCON1LBITS {
  uint16_t AMPEN1:1;
  uint16_t AMPEN2:1;
  uint16_t AMPEN3:1;
  uint16_t :12;
  uint16_t AMPON:1;
} AMPCON1LBITS;
extern volatile AMPCON1LBITS AMPCON1Lbits __attribute__((__sfr__));

#define AMPCON1H AMPCON1H
extern volatile uint16_t  AMPCON1H __attribute__((__sfr__));
typedef struct tagAMPCON1HBITS {
  uint16_t NCHDIS1:1;
  uint16_t NCHDIS2:1;
  uint16_t NCHDIS3:1;
} AMPCON1HBITS;
extern volatile AMPCON1HBITS AMPCON1Hbits __attribute__((__sfr__));

#define BIASCON BIASCON
extern volatile uint16_t  BIASCON __attribute__((__sfr__));
typedef struct tagBIASCONBITS {
  uint16_t I10EN0:1;
  uint16_t I10EN1:1;
  uint16_t I10EN2:1;
  uint16_t I10EN3:1;
  uint16_t :11;
  uint16_t ON:1;
} BIASCONBITS;
extern volatile BIASCONBITS BIASCONbits __attribute__((__sfr__));

#define IBIASCONL IBIASCONL
extern volatile uint16_t  IBIASCONL __attribute__((__sfr__));
typedef struct tagIBIASCONLBITS {
  uint16_t SNKEN0:1;
  uint16_t SRCEN0:1;
  uint16_t GENSNKEN0:1;
  uint16_t GENSRCEN0:1;
  uint16_t SHRSNKEN0:1;
  uint16_t SHRSRCEN0:1;
  uint16_t :2;
  uint16_t SNKEN1:1;
  uint16_t SRCEN1:1;
  uint16_t GENSNKEN1:1;
  uint16_t GENSRCEN1:1;
  uint16_t SHRSNKEN1:1;
  uint16_t SHRSRCEN1:1;
} IBIASCONLBITS;
extern volatile IBIASCONLBITS IBIASCONLbits __attribute__((__sfr__));

#define IBIASCONH IBIASCONH
extern volatile uint16_t  IBIASCONH __attribute__((__sfr__));
typedef struct tagIBIASCONHBITS {
  uint16_t SNKEN2:1;
  uint16_t SRCEN2:1;
  uint16_t GENSNKEN2:1;
  uint16_t GENSRCEN2:1;
  uint16_t SHRSNKEN2:1;
  uint16_t SHRSRCEN2:1;
  uint16_t :2;
  uint16_t SNKEN3:1;
  uint16_t SRCEN3:1;
  uint16_t GENSNKEN3:1;
  uint16_t GENSRCEN3:1;
  uint16_t SHRSNKEN3:1;
  uint16_t SHRSRCEN3:1;
} IBIASCONHBITS;
extern volatile IBIASCONHBITS IBIASCONHbits __attribute__((__sfr__));

#define PTGCST PTGCST
extern volatile uint16_t  PTGCST __attribute__((__sfr__));
typedef struct tagPTGCSTBITS {
  uint16_t PTGITM:2;
  uint16_t :3;
  uint16_t PTGBUSY:1;
  uint16_t PTGWTO:1;
  uint16_t PTGSTRT:1;
  uint16_t PTGIVIS:1;
  uint16_t PTGSSEN:1;
  uint16_t PTGSWT:1;
  uint16_t :1;
  uint16_t PTGTOGL:1;
  uint16_t PTGSIDL:1;
  uint16_t :1;
  uint16_t PTGEN:1;
} PTGCSTBITS;
