gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
extern volatile PTGCSTBITS PTGCSTbits __attribute__((__sfr__));

#define PTGCON PTGCON
extern volatile uint16_t  PTGCON __attribute__((__sfr__));
typedef struct tagPTGCONBITS {
  uint16_t PTGWDT:3;
  uint16_t :1;
  uint16_t PTGPWD:4;
  uint16_t PTGDIV:5;
  uint16_t PTGCLK:3;
} PTGCONBITS;
extern volatile PTGCONBITS PTGCONbits __attribute__((__sfr__));

#define PTGBTE PTGBTE
extern volatile uint16_t  PTGBTE __attribute__((__sfr__));
typedef struct tagPTGBTEBITS {
  uint16_t PTGBTE0:1;
  uint16_t PTGBTE1:1;
  uint16_t PTGBTE2:1;
  uint16_t PTGBTE3:1;
  uint16_t PTGBTE4:1;
  uint16_t PTGBTE5:1;
  uint16_t PTGBTE6:1;
  uint16_t PTGBTE7:1;
  uint16_t PTGBTE8:1;
  uint16_t PTGBTE9:1;
  uint16_t PTGBTE10:1;
  uint16_t PTGBTE11:1;
  uint16_t PTGBTE12:1;
  uint16_t PTGBTE13:1;
  uint16_t PTGBTE14:1;
  uint16_t PTGBTE15:1;
} PTGBTEBITS;
extern volatile PTGBTEBITS PTGBTEbits __attribute__((__sfr__));

#define PTGBTEH PTGBTEH
extern volatile uint16_t  PTGBTEH __attribute__((__sfr__));
typedef struct tagPTGBTEHBITS {
  uint16_t PTGBTE16:1;
  uint16_t PTGBTE17:1;
  uint16_t PTGBTE18:1;
  uint16_t PTGBTE19:1;
  uint16_t PTGBTE20:1;
  uint16_t PTGBTE21:1;
  uint16_t PTGBTE22:1;
  uint16_t PTGBTE23:1;
  uint16_t PTGBTE24:1;
  uint16_t PTGBTE25:1;
  uint16_t PTGBTE26:1;
  uint16_t PTGBTE27:1;
  uint16_t PTGBTE28:1;
  uint16_t PTGBTE29:1;
  uint16_t PTGBTE30:1;
  uint16_t PTGBTE31:1;
} PTGBTEHBITS;
extern volatile PTGBTEHBITS PTGBTEHbits __attribute__((__sfr__));

#define PTGHOLD PTGHOLD
extern volatile uint16_t  PTGHOLD __attribute__((__sfr__));
#define PTGT0LIM PTGT0LIM
extern volatile uint16_t  PTGT0LIM __attribute__((__sfr__));
#define PTGT1LIM PTGT1LIM
extern volatile uint16_t  PTGT1LIM __attribute__((__sfr__));
#define PTGSDLIM PTGSDLIM
extern volatile uint16_t  PTGSDLIM __attribute__((__sfr__));
#define PTGC0LIM PTGC0LIM
extern volatile uint16_t  PTGC0LIM __attribute__((__sfr__));
#define PTGC1LIM PTGC1LIM
extern volatile uint16_t  PTGC1LIM __attribute__((__sfr__));
#define PTGADJ PTGADJ
extern volatile uint16_t  PTGADJ __attribute__((__sfr__));
#define PTGL0 PTGL0
extern volatile uint16_t  PTGL0 __attribute__((__sfr__));
#define PTGQPTR PTGQPTR
extern volatile uint16_t  PTGQPTR __attribute__((__sfr__));
typedef struct tagPTGQPTRBITS {
  uint16_t PTGQPTR:5;
} PTGQPTRBITS;
extern volatile PTGQPTRBITS PTGQPTRbits __attribute__((__sfr__));

#define PTGQUE0 PTGQUE0
extern volatile uint16_t  PTGQUE0 __attribute__((__sfr__));
typedef struct tagPTGQUE0BITS {
  uint16_t STEP0:8;
  uint16_t STEP1:8;
} PTGQUE0BITS;
extern volatile PTGQUE0BITS PTGQUE0bits __attribute__((__sfr__));

#define PTGQUE1 PTGQUE1
extern volatile uint16_t  PTGQUE1 __attribute__((__sfr__));
typedef struct tagPTGQUE1BITS {
  uint16_t STEP2:8;
  uint16_t STEP3:8;
} PTGQUE1BITS;
extern volatile PTGQUE1BITS PTGQUE1bits __attribute__((__sfr__));

#define PTGQUE2 PTGQUE2
extern volatile uint16_t  PTGQUE2 __attribute__((__sfr__));
typedef struct tagPTGQUE2BITS {
  uint16_t STEP4:8;
  uint16_t STEP5:8;
} PTGQUE2BITS;
extern volatile PTGQUE2BITS PTGQUE2bits __attribute__((__sfr__));

#define PTGQUE3 PTGQUE3
extern volatile uint16_t  PTGQUE3 __attribute__((__sfr__));
typedef struct tagPTGQUE3BITS {
  uint16_t STEP6:8;
  uint16_t STEP7:8;
} PTGQUE3BITS;
extern volatile PTGQUE3BITS PTGQUE3bits __attribute__((__sfr__));

#define PTGQUE4 PTGQUE4
extern volatile uint16_t  PTGQUE4 __attribute__((__sfr__));
typedef struct tagPTGQUE4BITS {
  uint16_t STEP8:8;
  uint16_t STEP9:8;
} PTGQUE4BITS;
extern volatile PTGQUE4BITS PTGQUE4bits __attribute__((__sfr__));

#define PTGQUE5 PTGQUE5
extern volatile uint16_t  PTGQUE5 __attribute__((__sfr__));
typedef struct tagPTGQUE5BITS {
  uint16_t STEP10:8;
  uint16_t STEP11:8;
} PTGQUE5BITS;
extern volatile PTGQUE5BITS PTGQUE5bits __attribute__((__sfr__));

#define PTGQUE6 PTGQUE6
extern volatile uint16_t  PTGQUE6 __attribute__((__sfr__));
typedef struct tagPTGQUE6BITS {
  uint16_t STEP12:8;
  uint16_t STEP13:8;
} PTGQUE6BITS;
extern volatile PTGQUE6BITS PTGQUE6bits __attribute__((__sfr__));

#define PTGQUE7 PTGQUE7
extern volatile uint16_t  PTGQUE7 __attribute__((__sfr__));
typedef struct tagPTGQUE7BITS {
  uint16_t STEP14:8;
  uint16_t STEP15:8;
} PTGQUE7BITS;
extern volatile PTGQUE7BITS PTGQUE7bits __attribute__((__sfr__));

#define PTGQUE8 PTGQUE8
extern volatile uint16_t  PTGQUE8 __attribute__((__sfr__));
typedef struct tagPTGQUE8BITS {
  uint16_t STEP16:8;
  uint16_t STEP17:8;
} PTGQUE8BITS;
extern volatile PTGQUE8BITS PTGQUE8bits __attribute__((__sfr__));

#define PTGQUE9 PTGQUE9
extern volatile uint16_t  PTGQUE9 __attribute__((__sfr__));
typedef struct tagPTGQUE9BITS {
  uint16_t STEP18:8;
  uint16_t STEP19:8;
} PTGQUE9BITS;
extern volatile PTGQUE9BITS PTGQUE9bits __attribute__((__sfr__));

#define PTGQUE10 PTGQUE10
extern volatile uint16_t  PTGQUE10 __attribute__((__sfr__));
typedef struct tagPTGQUE10BITS {
  uint16_t STEP20:8;
  uint16_t STEP21:8;
} PTGQUE10BITS;
extern volatile PTGQUE10BITS PTGQUE10bits __attribute__((__sfr__));

#define PTGQUE11 PTGQUE11
extern volatile uint16_t  PTGQUE11 __attribute__((__sfr__));
typedef struct tagPTGQUE11BITS {
  uint16_t STEP22:8;
  uint16_t STEP23:8;
} PTGQUE11BITS;
extern volatile PTGQUE11BITS PTGQUE11bits __attribute__((__sfr__));

#define PTGQUE12 PTGQUE12
extern volatile uint16_t  PTGQUE12 __attribute__((__sfr__));
typedef struct tagPTGQUE12BITS {
  uint16_t STEP24:8;
  uint16_t STEP25:8;
} PTGQUE12BITS;
extern volatile PTGQUE12BITS PTGQUE12bits __attribute__((__sfr__));

#define PTGQUE13 PTGQUE13
extern volatile uint16_t  PTGQUE13 __attribute__((__sfr__));
typedef struct tagPTGQUE13BITS {
  uint16_t STEP26:8;
  uint16_t STEP27:8;
} PTGQUE13BITS;
extern volatile PTGQUE13BITS PTGQUE13bits __attribute__((__sfr__));

#define PTGQUE14 PTGQUE14
extern volatile uint16_t  PTGQUE14 __attribute__((__sfr__));
typedef struct tagPTGQUE14BITS {
  uint16_t STEP28:8;
  uint16_t STEP29:8;
} PTGQUE14BITS;
extern volatile PTGQUE14BITS PTGQUE14bits __attribute__((__sfr__));

#define PTGQUE15 PTGQUE15
extern volatile uint16_t  PTGQUE15 __attribute__((__sfr__));
typedef struct tagPTGQUE15BITS {
  uint16_t STEP30:8;
  uint16_t STEP31:8;
} PTGQUE15BITS;
extern volatile PTGQUE15BITS PTGQUE15bits __attribute__((__sfr__));

#define CCP1CON1L CCP1CON1L
extern volatile uint16_t  CCP1CON1L __attribute__((__sfr__));
__extension__ typedef struct tagCCP1CON1LBITS {
  union {
    struct {
      uint16_t MOD:4;
      uint16_t CCSEL:1;
      uint16_t T32:1;
      uint16_t TMRPS:2;
      uint16_t CLKSEL:3;
      uint16_t TMRSYNC:1;
      uint16_t CCPSLP:1;
      uint16_t CCPSIDL:1;
      uint16_t :1;
      uint16_t CCPON:1;
    };
    struct {
      uint16_t MOD0:1;
      uint16_t MOD1:1;
      uint16_t MOD2:1;
      uint16_t MOD3:1;
      uint16_t :1;
      uint16_t TMR32:1;
      uint16_t TMRPS0:1;
      uint16_t TMRPS1:1;
      uint16_t CLKSEL0:1;
      uint16_t CLKSEL1:1;
      uint16_t CLKSEL2:1;
    };
    struct {
      uint16_t CCPMOD:4;
    };
    struct {
      uint16_t CCPMOD0:1;
      uint16_t CCPMOD1:1;
      uint16_t CCPMOD2:1;
      uint16_t CCPMOD3:1;
    };
  };
} CCP1CON1LBITS;
extern volatile CCP1CON1LBITS CCP1CON1Lbits __attribute__((__sfr__));

#define CCP1CON1H CCP1CON1H
extern volatile uint16_t  CCP1CON1H __attribute__((__sfr__));
__extension__ typedef struct tagCCP1CON1HBITS {
  union {
    struct {
      uint16_t SYNC:5;
      uint16_t ALTSYNC:1;
      uint16_t ONESHOT:1;
      uint16_t TRIGEN:1;
      uint16_t OPS:4;
      uint16_t :2;
      uint16_t RTRGEN:1;
      uint16_t OPSSRC:1;
    };
    struct {
      uint16_t SYNC0:1;
      uint16_t SYNC1:1;
      uint16_t SYNC2:1;
      uint16_t SYNC3:1;
      uint16_t SYNC4:1;
      uint16_t :3;
      uint16_t OPS0:1;
      uint16_t OPS1:1;
      uint16_t OPS2:1;
      uint16_t OPS3:1;
      uint16_t :3;
      uint16_t OPSRC:1;
    };
    struct {
      uint16_t :8;
      uint16_t IOPS:4;
    };
    struct {
      uint16_t :8;
      uint16_t IOPS0:1;
      uint16_t IOPS1:1;
      uint16_t IOPS2:1;
      uint16_t IOPS3:1;
    };
  };
} CCP1CON1HBITS;
extern volatile CCP1CON1HBITS CCP1CON1Hbits __attribute__((__sfr__));

#define CCP1CON2L CCP1CON2L
extern volatile uint16_t  CCP1CON2L __attribute__((__sfr__));
__extension__ typedef struct tagCCP1CON2LBITS {
  union {
    struct {
      uint16_t ASDG:8;
      uint16_t :4;
      uint16_t SSDG:1;
      uint16_t :1;
      uint16_t ASDGM:1;
      uint16_t PWMRSEN:1;
    };
    struct {
      uint16_t ASDG0:1;
      uint16_t ASDG1:1;
      uint16_t ASDG2:1;
      uint16_t ASDG3:1;
      uint16_t ASDG4:1;
      uint16_t ASDG5:1;
      uint16_t ASDG6:1;
      uint16_t ASDG7:1;
    };
  };
} CCP1CON2LBITS;
