gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
#define CCP2TMRL CCP2TMRL
extern volatile uint16_t  CCP2TMRL __attribute__((__sfr__));
#define CCP2TMRH CCP2TMRH
extern volatile uint16_t  CCP2TMRH __attribute__((__sfr__));
#define CCP2PRL CCP2PRL
extern volatile uint16_t  CCP2PRL __attribute__((__sfr__));
#define CCP2PRH CCP2PRH
extern volatile uint16_t  CCP2PRH __attribute__((__sfr__));
#define CCP2RA CCP2RA
extern volatile uint16_t  CCP2RA __attribute__((__sfr__));
#define CCP2RAL CCP2RAL
extern volatile uint16_t  CCP2RAL __attribute__((__sfr__));
#define CCP2RB CCP2RB
extern volatile uint16_t  CCP2RB __attribute__((__sfr__));
#define CCP2RBL CCP2RBL
extern volatile uint16_t  CCP2RBL __attribute__((__sfr__));
#define CCP2BUFL CCP2BUFL
extern volatile uint16_t  CCP2BUFL __attribute__((__sfr__));
#define CCP2BUFH CCP2BUFH
extern volatile uint16_t  CCP2BUFH __attribute__((__sfr__));
#define CCP3CON1L CCP3CON1L
extern volatile uint16_t  CCP3CON1L __attribute__((__sfr__));
__extension__ typedef struct tagCCP3CON1LBITS {
  union {
    struct {
      uint16_t MOD:4;
      uint16_t CCSEL:1;
      uint16_t T32:1;
      uint16_t TMRPS:2;
      uint16_t CLKSEL:3;
      uint16_t TMRSYNC:1;
      uint16_t CCPSLP:1;
      uint16_t CCPSIDL:1;
      uint16_t :1;
      uint16_t CCPON:1;
    };
    struct {
      uint16_t MOD0:1;
      uint16_t MOD1:1;
      uint16_t MOD2:1;
      uint16_t MOD3:1;
      uint16_t :1;
      uint16_t TMR32:1;
      uint16_t TMRPS0:1;
      uint16_t TMRPS1:1;
      uint16_t CLKSEL0:1;
      uint16_t CLKSEL1:1;
      uint16_t CLKSEL2:1;
    };
    struct {
      uint16_t CCPMOD:4;
    };
    struct {
      uint16_t CCPMOD0:1;
      uint16_t CCPMOD1:1;
      uint16_t CCPMOD2:1;
      uint16_t CCPMOD3:1;
    };
  };
} CCP3CON1LBITS;
extern volatile CCP3CON1LBITS CCP3CON1Lbits __attribute__((__sfr__));

#define CCP3CON1H CCP3CON1H
extern volatile uint16_t  CCP3CON1H __attribute__((__sfr__));
__extension__ typedef struct tagCCP3CON1HBITS {
  union {
    struct {
      uint16_t SYNC:5;
      uint16_t ALTSYNC:1;
      uint16_t ONESHOT:1;
      uint16_t TRIGEN:1;
      uint16_t OPS:4;
      uint16_t :2;
      uint16_t RTRGEN:1;
      uint16_t OPSSRC:1;
    };
    struct {
      uint16_t SYNC0:1;
      uint16_t SYNC1:1;
      uint16_t SYNC2:1;
      uint16_t SYNC3:1;
      uint16_t SYNC4:1;
      uint16_t :3;
      uint16_t OPS0:1;
      uint16_t OPS1:1;
      uint16_t OPS2:1;
      uint16_t OPS3:1;
      uint16_t :3;
      uint16_t OPSRC:1;
    };
    struct {
      uint16_t :8;
      uint16_t IOPS:4;
    };
    struct {
      uint16_t :8;
      uint16_t IOPS0:1;
      uint16_t IOPS1:1;
      uint16_t IOPS2:1;
      uint16_t IOPS3:1;
    };
  };
} CCP3CON1HBITS;
extern volatile CCP3CON1HBITS CCP3CON1Hbits __attribute__((__sfr__));

#define CCP3CON2L CCP3CON2L
extern volatile uint16_t  CCP3CON2L __attribute__((__sfr__));
__extension__ typedef struct tagCCP3CON2LBITS {
  union {
    struct {
      uint16_t ASDG:8;
      uint16_t :4;
      uint16_t SSDG:1;
      uint16_t :1;
      uint16_t ASDGM:1;
      uint16_t PWMRSEN:1;
    };
    struct {
      uint16_t ASDG0:1;
      uint16_t ASDG1:1;
      uint16_t ASDG2:1;
      uint16_t ASDG3:1;
      uint16_t ASDG4:1;
      uint16_t ASDG5:1;
      uint16_t ASDG6:1;
      uint16_t ASDG7:1;
    };
  };
} CCP3CON2LBITS;
extern volatile CCP3CON2LBITS CCP3CON2Lbits __attribute__((__sfr__));

#define CCP3CON2H CCP3CON2H
extern volatile uint16_t  CCP3CON2H __attribute__((__sfr__));
__extension__ typedef struct tagCCP3CON2HBITS {
  union {
    struct {
      uint16_t ICS:3;
      uint16_t AUXOUT:2;
      uint16_t :1;
      uint16_t ICGSM:2;
      uint16_t OCAEN:1;
      uint16_t :6;
      uint16_t OENSYNC:1;
    };
    struct {
      uint16_t ICS0:1;
      uint16_t ICS1:1;
      uint16_t ICS2:1;
      uint16_t AUXOUT0:1;
      uint16_t AUXOUT1:1;
      uint16_t :1;
      uint16_t ICGSM0:1;
      uint16_t ICGSM1:1;
    };
    struct {
      uint16_t ICSEL:3;
    };
    struct {
      uint16_t ICSEL0:1;
      uint16_t ICSEL1:1;
      uint16_t ICSEL2:1;
    };
  };
} CCP3CON2HBITS;
extern volatile CCP3CON2HBITS CCP3CON2Hbits __attribute__((__sfr__));

#define CCP3CON3H CCP3CON3H
extern volatile uint16_t  CCP3CON3H __attribute__((__sfr__));
__extension__ typedef struct tagCCP3CON3HBITS {
  union {
    struct {
      uint16_t :2;
      uint16_t PSSACE:2;
      uint16_t :1;
      uint16_t POLACE:1;
      uint16_t :6;
      uint16_t OSCNT:3;
      uint16_t OETRIG:1;
    };
    struct {
      uint16_t :2;
      uint16_t PSSACE0:1;
      uint16_t PSSACE1:1;
      uint16_t :8;
      uint16_t OSCNT0:1;
      uint16_t OSCNT1:1;
      uint16_t OSCNT2:1;
    };
  };
} CCP3CON3HBITS;
extern volatile CCP3CON3HBITS CCP3CON3Hbits __attribute__((__sfr__));

#define CCP3STAT CCP3STAT
extern volatile uint16_t  CCP3STAT __attribute__((__sfr__));
__extension__ typedef struct tagCCP3STATBITS {
  union {
    struct {
      uint16_t ICBNE:1;
      uint16_t ICOV:1;
      uint16_t ICDIS:1;
      uint16_t SCEVT:1;
      uint16_t ASEVT:1;
      uint16_t TRCLR:1;
      uint16_t TRSET:1;
      uint16_t CCPTRIG:1;
      uint16_t :2;
      uint16_t ICGARM:1;
    };
    struct {
      uint16_t :7;
      uint16_t TRIG:1;
    };
  };
} CCP3STATBITS;
extern volatile CCP3STATBITS CCP3STATbits __attribute__((__sfr__));

#define CCP3STATL CCP3STATL
extern volatile uint16_t  CCP3STATL __attribute__((__sfr__));
__extension__ typedef struct tagCCP3STATLBITS {
  union {
    struct {
      uint16_t ICBNE:1;
      uint16_t ICOV:1;
      uint16_t ICDIS:1;
      uint16_t SCEVT:1;
      uint16_t ASEVT:1;
      uint16_t TRCLR:1;
      uint16_t TRSET:1;
      uint16_t CCPTRIG:1;
      uint16_t :2;
      uint16_t ICGARM:1;
    };
    struct {
      uint16_t :7;
      uint16_t TRIG:1;
    };
  };
} CCP3STATLBITS;
extern volatile CCP3STATLBITS CCP3STATLbits __attribute__((__sfr__));

#define CCP3TMRL CCP3TMRL
extern volatile uint16_t  CCP3TMRL __attribute__((__sfr__));
#define CCP3TMRH CCP3TMRH
extern volatile uint16_t  CCP3TMRH __attribute__((__sfr__));
#define CCP3PRL CCP3PRL
extern volatile uint16_t  CCP3PRL __attribute__((__sfr__));
#define CCP3PRH CCP3PRH
extern volatile uint16_t  CCP3PRH __attribute__((__sfr__));
#define CCP3RA CCP3RA
extern volatile uint16_t  CCP3RA __attribute__((__sfr__));
#define CCP3RAL CCP3RAL
extern volatile uint16_t  CCP3RAL __attribute__((__sfr__));
#define CCP3RB CCP3RB
extern volatile uint16_t  CCP3RB __attribute__((__sfr__));
#define CCP3RBL CCP3RBL
extern volatile uint16_t  CCP3RBL __attribute__((__sfr__));
#define CCP3BUFL CCP3BUFL
extern volatile uint16_t  CCP3BUFL __attribute__((__sfr__));
#define CCP3BUFH CCP3BUFH
extern volatile uint16_t  CCP3BUFH __attribute__((__sfr__));
#define CCP4CON1L CCP4CON1L
extern volatile uint16_t  CCP4CON1L __attribute__((__sfr__));
__extension__ typedef struct tagCCP4CON1LBITS {
  union {
    struct {
      uint16_t MOD:4;
      uint16_t CCSEL:1;
      uint16_t T32:1;
      uint16_t TMRPS:2;
      uint16_t CLKSEL:3;
      uint16_t TMRSYNC:1;
      uint16_t CCPSLP:1;
      uint16_t CCPSIDL:1;
      uint16_t :1;
      uint16_t CCPON:1;
    };
    struct {
      uint16_t MOD0:1;
      uint16_t MOD1:1;
      uint16_t MOD2:1;
      uint16_t MOD3:1;
      uint16_t :1;
      uint16_t TMR32:1;
      uint16_t TMRPS0:1;
      uint16_t TMRPS1:1;
      uint16_t CLKSEL0:1;
      uint16_t CLKSEL1:1;
      uint16_t CLKSEL2:1;
    };
    struct {
      uint16_t CCPMOD:4;
    };
    struct {
      uint16_t CCPMOD0:1;
      uint16_t CCPMOD1:1;
      uint16_t CCPMOD2:1;
      uint16_t CCPMOD3:1;
    };
  };
} CCP4CON1LBITS;
extern volatile CCP4CON1LBITS CCP4CON1Lbits __attribute__((__sfr__));

#define CCP4CON1H CCP4CON1H
extern volatile uint16_t  CCP4CON1H __attribute__((__sfr__));
__extension__ typedef struct tagCCP4CON1HBITS {
  union {
    struct {
      uint16_t SYNC:5;
      uint16_t ALTSYNC:1;
      uint16_t ONESHOT:1;
      uint16_t TRIGEN:1;
      uint16_t OPS:4;
      uint16_t :2;
      uint16_t RTRGEN:1;
      uint16_t OPSSRC:1;
    };
    struct {
      uint16_t SYNC0:1;
      uint16_t SYNC1:1;
      uint16_t SYNC2:1;
      uint16_t SYNC3:1;
      uint16_t SYNC4:1;
      uint16_t :3;
      uint16_t OPS0:1;
      uint16_t OPS1:1;
      uint16_t OPS2:1;
      uint16_t OPS3:1;
      uint16_t :3;
      uint16_t OPSRC:1;
    };
    struct {
      uint16_t :8;
      uint16_t IOPS:4;
    };
    struct {
      uint16_t :8;
      uint16_t IOPS0:1;
      uint16_t IOPS1:1;
      uint16_t IOPS2:1;
      uint16_t IOPS3:1;
    };
  };
} CCP4CON1HBITS;
extern volatile CCP4CON1HBITS CCP4CON1Hbits __attribute__((__sfr__));

#define CCP4CON2L CCP4CON2L
extern volatile uint16_t  CCP4CON2L __attribute__((__sfr__));
__extension__ typedef struct tagCCP4CON2LBITS {
  union {
    struct {
      uint16_t ASDG:8;
      uint16_t :4;
      uint16_t SSDG:1;
      uint16_t :1;
      uint16_t ASDGM:1;
      uint16_t PWMRSEN:1;
    };
    struct {
      uint16_t ASDG0:1;
      uint16_t ASDG1:1;
      uint16_t ASDG2:1;
      uint16_t ASDG3:1;
      uint16_t ASDG4:1;
      uint16_t ASDG5:1;
      uint16_t ASDG6:1;
      uint16_t ASDG7:1;
    };
  };
} CCP4CON2LBITS;
