gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
#define CCP9CON1H CCP9CON1H
extern volatile uint16_t  CCP9CON1H __attribute__((__sfr__));
__extension__ typedef struct tagCCP9CON1HBITS {
  union {
    struct {
      uint16_t SYNC:5;
      uint16_t ALTSYNC:1;
      uint16_t ONESHOT:1;
      uint16_t TRIGEN:1;
      uint16_t OPS:4;
      uint16_t :2;
      uint16_t RTRGEN:1;
      uint16_t OPSSRC:1;
    };
    struct {
      uint16_t SYNC0:1;
      uint16_t SYNC1:1;
      uint16_t SYNC2:1;
      uint16_t SYNC3:1;
      uint16_t SYNC4:1;
      uint16_t :3;
      uint16_t OPS0:1;
      uint16_t OPS1:1;
      uint16_t OPS2:1;
      uint16_t OPS3:1;
      uint16_t :3;
      uint16_t OPSRC:1;
    };
    struct {
      uint16_t :8;
      uint16_t IOPS:4;
    };
    struct {
      uint16_t :8;
      uint16_t IOPS0:1;
      uint16_t IOPS1:1;
      uint16_t IOPS2:1;
      uint16_t IOPS3:1;
    };
  };
} CCP9CON1HBITS;
extern volatile CCP9CON1HBITS CCP9CON1Hbits __attribute__((__sfr__));

#define CCP9CON2L CCP9CON2L
extern volatile uint16_t  CCP9CON2L __attribute__((__sfr__));
__extension__ typedef struct tagCCP9CON2LBITS {
  union {
    struct {
      uint16_t ASDG:8;
      uint16_t :4;
      uint16_t SSDG:1;
      uint16_t :1;
      uint16_t ASDGM:1;
      uint16_t PWMRSEN:1;
    };
    struct {
      uint16_t ASDG0:1;
      uint16_t ASDG1:1;
      uint16_t ASDG2:1;
      uint16_t ASDG3:1;
      uint16_t ASDG4:1;
      uint16_t ASDG5:1;
      uint16_t ASDG6:1;
      uint16_t ASDG7:1;
    };
  };
} CCP9CON2LBITS;
extern volatile CCP9CON2LBITS CCP9CON2Lbits __attribute__((__sfr__));

#define CCP9CON2H CCP9CON2H
extern volatile uint16_t  CCP9CON2H __attribute__((__sfr__));
__extension__ typedef struct tagCCP9CON2HBITS {
  union {
    struct {
      uint16_t ICS:3;
      uint16_t AUXOUT:2;
      uint16_t :1;
      uint16_t ICGSM:2;
      uint16_t OCAEN:1;
      uint16_t OCBEN:1;
      uint16_t OCCEN:1;
      uint16_t OCDEN:1;
      uint16_t OCEEN:1;
      uint16_t OCFEN:1;
      uint16_t :1;
      uint16_t OENSYNC:1;
    };
    struct {
      uint16_t ICS0:1;
      uint16_t ICS1:1;
      uint16_t ICS2:1;
      uint16_t AUXOUT0:1;
      uint16_t AUXOUT1:1;
      uint16_t :1;
      uint16_t ICGSM0:1;
      uint16_t ICGSM1:1;
    };
    struct {
      uint16_t ICSEL:3;
    };
    struct {
      uint16_t ICSEL0:1;
      uint16_t ICSEL1:1;
      uint16_t ICSEL2:1;
    };
  };
} CCP9CON2HBITS;
extern volatile CCP9CON2HBITS CCP9CON2Hbits __attribute__((__sfr__));

#define CCP9CON3L CCP9CON3L
extern volatile uint16_t  CCP9CON3L __attribute__((__sfr__));
__extension__ typedef struct tagCCP9CON3LBITS {
  union {
    struct {
      uint16_t DT:6;
    };
    struct {
      uint16_t DT0:1;
      uint16_t DT1:1;
      uint16_t DT2:1;
      uint16_t DT3:1;
      uint16_t DT4:1;
      uint16_t DT5:1;
    };
  };
} CCP9CON3LBITS;
extern volatile CCP9CON3LBITS CCP9CON3Lbits __attribute__((__sfr__));

#define CCP9CON3H CCP9CON3H
extern volatile uint16_t  CCP9CON3H __attribute__((__sfr__));
__extension__ typedef struct tagCCP9CON3HBITS {
  union {
    struct {
      uint16_t PSSBDF:2;
      uint16_t PSSACE:2;
      uint16_t POLBDF:1;
      uint16_t POLACE:1;
      uint16_t :2;
      uint16_t OUTM:3;
      uint16_t :1;
      uint16_t OSCNT:3;
      uint16_t OETRIG:1;
    };
    struct {
      uint16_t PSSBDF0:1;
      uint16_t PSSBDF1:1;
      uint16_t PSSACE0:1;
      uint16_t PSSACE1:1;
      uint16_t :4;
      uint16_t OUTM0:1;
      uint16_t OUTM1:1;
      uint16_t OUTM2:1;
      uint16_t :1;
      uint16_t OSCNT0:1;
      uint16_t OSCNT1:1;
      uint16_t OSCNT2:1;
    };
  };
} CCP9CON3HBITS;
extern volatile CCP9CON3HBITS CCP9CON3Hbits __attribute__((__sfr__));

#define CCP9STAT CCP9STAT
extern volatile uint16_t  CCP9STAT __attribute__((__sfr__));
__extension__ typedef struct tagCCP9STATBITS {
  union {
    struct {
      uint16_t ICBNE:1;
      uint16_t ICOV:1;
      uint16_t ICDIS:1;
      uint16_t SCEVT:1;
      uint16_t ASEVT:1;
      uint16_t TRCLR:1;
      uint16_t TRSET:1;
      uint16_t CCPTRIG:1;
      uint16_t :2;
      uint16_t ICGARM:1;
    };
    struct {
      uint16_t :7;
      uint16_t TRIG:1;
    };
  };
} CCP9STATBITS;
extern volatile CCP9STATBITS CCP9STATbits __attribute__((__sfr__));

#define CCP9STATL CCP9STATL
extern volatile uint16_t  CCP9STATL __attribute__((__sfr__));
__extension__ typedef struct tagCCP9STATLBITS {
  union {
    struct {
      uint16_t ICBNE:1;
      uint16_t ICOV:1;
      uint16_t ICDIS:1;
      uint16_t SCEVT:1;
      uint16_t ASEVT:1;
      uint16_t TRCLR:1;
      uint16_t TRSET:1;
      uint16_t CCPTRIG:1;
      uint16_t :2;
      uint16_t ICGARM:1;
    };
    struct {
      uint16_t :7;
      uint16_t TRIG:1;
    };
  };
} CCP9STATLBITS;
extern volatile CCP9STATLBITS CCP9STATLbits __attribute__((__sfr__));

#define CCP9TMRL CCP9TMRL
extern volatile uint16_t  CCP9TMRL __attribute__((__sfr__));
#define CCP9TMRH CCP9TMRH
extern volatile uint16_t  CCP9TMRH __attribute__((__sfr__));
#define CCP9PRL CCP9PRL
extern volatile uint16_t  CCP9PRL __attribute__((__sfr__));
#define CCP9PRH CCP9PRH
extern volatile uint16_t  CCP9PRH __attribute__((__sfr__));
#define CCP9RA CCP9RA
extern volatile uint16_t  CCP9RA __attribute__((__sfr__));
#define CCP9RAL CCP9RAL
extern volatile uint16_t  CCP9RAL __attribute__((__sfr__));
#define CCP9RB CCP9RB
extern volatile uint16_t  CCP9RB __attribute__((__sfr__));
#define CCP9RBL CCP9RBL
extern volatile uint16_t  CCP9RBL __attribute__((__sfr__));
#define CCP9BUFL CCP9BUFL
extern volatile uint16_t  CCP9BUFL __attribute__((__sfr__));
#define CCP9BUFH CCP9BUFH
extern volatile uint16_t  CCP9BUFH __attribute__((__sfr__));
#define DMACON DMACON
extern volatile uint16_t  DMACON __attribute__((__sfr__));
typedef struct tagDMACONBITS {
  uint16_t PRSSEL:1;
  uint16_t :14;
  uint16_t DMAEN:1;
} DMACONBITS;
extern volatile DMACONBITS DMACONbits __attribute__((__sfr__));

#define DMABUF DMABUF
extern volatile uint16_t  DMABUF __attribute__((__sfr__));
#define DMAL DMAL
extern volatile uint16_t  DMAL __attribute__((__sfr__));
#define DMAH DMAH
extern volatile uint16_t  DMAH __attribute__((__sfr__));
#define DMACH0 DMACH0
extern volatile uint16_t  DMACH0 __attribute__((__sfr__));
__extension__ typedef struct tagDMACH0BITS {
  union {
    struct {
      uint16_t CHEN:1;
      uint16_t SIZE:1;
      uint16_t TRMODE:2;
      uint16_t DAMODE:2;
      uint16_t SAMODE:2;
      uint16_t CHREQ:1;
      uint16_t RELOAD:1;
      uint16_t NULLW:1;
    };
    struct {
      uint16_t :2;
      uint16_t TRMODE0:1;
      uint16_t TRMODE1:1;
      uint16_t DAMODE0:1;
      uint16_t DAMODE1:1;
      uint16_t SAMODE0:1;
      uint16_t SAMODE1:1;
    };
  };
} DMACH0BITS;
