gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
#define ADCON2H ADCON2H
extern volatile uint16_t  ADCON2H __attribute__((__sfr__));
__extension__ typedef struct tagADCON2HBITS {
  union {
    struct {
      uint16_t SHRSAMC:10;
      uint16_t :4;
      uint16_t REFERR:1;
      uint16_t REFRDY:1;
    };
    struct {
      uint16_t SHRSAMC0:1;
      uint16_t SHRSAMC1:1;
      uint16_t SHRSAMC2:1;
      uint16_t SHRSAMC3:1;
      uint16_t SHRSAMC4:1;
      uint16_t SHRSAMC5:1;
      uint16_t SHRSAMC6:1;
      uint16_t SHRSAMC7:1;
      uint16_t SHRSAMC8:1;
      uint16_t SHRSAMC9:1;
    };
  };
} ADCON2HBITS;
extern volatile ADCON2HBITS ADCON2Hbits __attribute__((__sfr__));

#define ADCON3L ADCON3L
extern volatile uint16_t  ADCON3L __attribute__((__sfr__));
__extension__ typedef struct tagADCON3LBITS {
  union {
    struct {
      uint16_t CNVCHSEL:6;
      uint16_t SWCTRG:1;
      uint16_t SWLCTRG:1;
      uint16_t CNVRTCH:1;
      uint16_t SHRSAMP:1;
      uint16_t SUSPRDY:1;
      uint16_t SUSPCIE:1;
      uint16_t SUSPEND:1;
      uint16_t REFSEL:3;
    };
    struct {
      uint16_t CNVCHSEL0:1;
      uint16_t CNVCHSEL1:1;
      uint16_t CNVCHSEL2:1;
      uint16_t CNVCHSEL3:1;
      uint16_t CNVCHSEL4:1;
      uint16_t CNVCHSEL5:1;
      uint16_t :7;
      uint16_t REFSEL0:1;
      uint16_t REFSEL1:1;
      uint16_t REFSEL2:1;
    };
  };
} ADCON3LBITS;
extern volatile ADCON3LBITS ADCON3Lbits __attribute__((__sfr__));

#define ADCON3H ADCON3H
extern volatile uint16_t  ADCON3H __attribute__((__sfr__));
__extension__ typedef struct tagADCON3HBITS {
  union {
    struct {
      uint16_t C0EN:1;
      uint16_t C1EN:1;
      uint16_t :5;
      uint16_t SHREN:1;
      uint16_t CLKDIV:6;
      uint16_t CLKSEL:2;
    };
    struct {
      uint16_t :8;
      uint16_t CLKDIV0:1;
      uint16_t CLKDIV1:1;
      uint16_t CLKDIV2:1;
      uint16_t CLKDIV3:1;
      uint16_t CLKDIV4:1;
      uint16_t CLKDIV5:1;
      uint16_t CLKSEL0:1;
      uint16_t CLKSEL1:1;
    };
  };
} ADCON3HBITS;
extern volatile ADCON3HBITS ADCON3Hbits __attribute__((__sfr__));

#define ADCON4L ADCON4L
extern volatile uint16_t  ADCON4L __attribute__((__sfr__));
typedef struct tagADCON4LBITS {
  uint16_t SAMC0EN:1;
  uint16_t SAMC1EN:1;
} ADCON4LBITS;
extern volatile ADCON4LBITS ADCON4Lbits __attribute__((__sfr__));

#define ADCON4H ADCON4H
extern volatile uint16_t  ADCON4H __attribute__((__sfr__));
__extension__ typedef struct tagADCON4HBITS {
  union {
    struct {
      uint16_t C0CHS:2;
      uint16_t C1CHS:2;
    };
    struct {
      uint16_t C0CHS0:1;
      uint16_t C0CHS1:1;
      uint16_t C1CHS0:1;
      uint16_t C1CHS1:1;
    };
  };
} ADCON4HBITS;
extern volatile ADCON4HBITS ADCON4Hbits __attribute__((__sfr__));

#define ADMOD0L ADMOD0L
extern volatile uint16_t  ADMOD0L __attribute__((__sfr__));
typedef struct tagADMOD0LBITS {
  uint16_t SIGN0:1;
  uint16_t DIFF0:1;
  uint16_t SIGN1:1;
  uint16_t DIFF1:1;
  uint16_t SIGN2:1;
  uint16_t DIFF2:1;
  uint16_t SIGN3:1;
  uint16_t DIFF3:1;
  uint16_t SIGN4:1;
  uint16_t DIFF4:1;
  uint16_t SIGN5:1;
  uint16_t DIFF5:1;
  uint16_t SIGN6:1;
  uint16_t DIFF6:1;
  uint16_t SIGN7:1;
  uint16_t DIFF7:1;
} ADMOD0LBITS;
extern volatile ADMOD0LBITS ADMOD0Lbits __attribute__((__sfr__));

#define ADMOD0H ADMOD0H
extern volatile uint16_t  ADMOD0H __attribute__((__sfr__));
typedef struct tagADMOD0HBITS {
  uint16_t SIGN8:1;
  uint16_t DIFF8:1;
  uint16_t SIGN9:1;
  uint16_t DIFF9:1;
  uint16_t SIGN10:1;
  uint16_t DIFF10:1;
  uint16_t SIGN11:1;
  uint16_t DIFF11:1;
  uint16_t SIGN12:1;
  uint16_t DIFF12:1;
  uint16_t SIGN13:1;
  uint16_t DIFF13:1;
  uint16_t SIGN14:1;
  uint16_t DIFF14:1;
  uint16_t SIGN15:1;
  uint16_t DIFF15:1;
} ADMOD0HBITS;
extern volatile ADMOD0HBITS ADMOD0Hbits __attribute__((__sfr__));

#define ADMOD1L ADMOD1L
extern volatile uint16_t  ADMOD1L __attribute__((__sfr__));
typedef struct tagADMOD1LBITS {
  uint16_t SIGN16:1;
  uint16_t DIFF16:1;
  uint16_t SIGN17:1;
  uint16_t DIFF17:1;
  uint16_t SIGN18:1;
  uint16_t DIFF18:1;
} ADMOD1LBITS;
extern volatile ADMOD1LBITS ADMOD1Lbits __attribute__((__sfr__));

#define ADMOD1H ADMOD1H
extern volatile uint16_t  ADMOD1H __attribute__((__sfr__));
typedef struct tagADMOD1HBITS {
  uint16_t :2;
  uint16_t SIGN25:1;
  uint16_t DIFF25:1;
} ADMOD1HBITS;
extern volatile ADMOD1HBITS ADMOD1Hbits __attribute__((__sfr__));

#define ADIEL ADIEL
extern volatile uint16_t  ADIEL __attribute__((__sfr__));
typedef struct tagADIELBITS {
  uint16_t IE0:1;
  uint16_t IE1:1;
  uint16_t IE2:1;
  uint16_t IE3:1;
  uint16_t IE4:1;
  uint16_t IE5:1;
  uint16_t IE6:1;
  uint16_t IE7:1;
  uint16_t IE8:1;
  uint16_t IE9:1;
  uint16_t IE10:1;
  uint16_t IE11:1;
  uint16_t IE12:1;
  uint16_t IE13:1;
  uint16_t IE14:1;
  uint16_t IE15:1;
} ADIELBITS;
extern volatile ADIELBITS ADIELbits __attribute__((__sfr__));

#define ADIEH ADIEH
extern volatile uint16_t  ADIEH __attribute__((__sfr__));
typedef struct tagADIEHBITS {
  uint16_t IE16:1;
  uint16_t IE17:1;
  uint16_t IE18:1;
  uint16_t :5;
  uint16_t IE24:1;
  uint16_t IE25:1;
} ADIEHBITS;
extern volatile ADIEHBITS ADIEHbits __attribute__((__sfr__));

#define ADSTATL ADSTATL
extern volatile uint16_t  ADSTATL __attribute__((__sfr__));
typedef struct tagADSTATLBITS {
  uint16_t AN0RDY:1;
  uint16_t AN1RDY:1;
  uint16_t AN2RDY:1;
  uint16_t AN3RDY:1;
  uint16_t AN4RDY:1;
  uint16_t AN5RDY:1;
  uint16_t AN6RDY:1;
  uint16_t AN7RDY:1;
  uint16_t AN8RDY:1;
  uint16_t AN9RDY:1;
  uint16_t AN10RDY:1;
  uint16_t AN11RDY:1;
  uint16_t AN12RDY:1;
  uint16_t AN13RDY:1;
  uint16_t AN14RDY:1;
  uint16_t AN15RDY:1;
} ADSTATLBITS;
extern volatile ADSTATLBITS ADSTATLbits __attribute__((__sfr__));

#define ADSTATH ADSTATH
extern volatile uint16_t  ADSTATH __attribute__((__sfr__));
typedef struct tagADSTATHBITS {
  uint16_t AN16RDY:1;
  uint16_t AN17RDY:1;
  uint16_t AN18RDY:1;
  uint16_t :5;
  uint16_t AN24RDY:1;
  uint16_t AN25RDY:1;
} ADSTATHBITS;
extern volatile ADSTATHBITS ADSTATHbits __attribute__((__sfr__));

#define ADCMP0ENL ADCMP0ENL
extern volatile uint16_t  ADCMP0ENL __attribute__((__sfr__));
typedef struct tagADCMP0ENLBITS {
  uint16_t CMPEN0:1;
  uint16_t CMPEN1:1;
  uint16_t CMPEN2:1;
  uint16_t CMPEN3:1;
  uint16_t CMPEN4:1;
  uint16_t CMPEN5:1;
  uint16_t CMPEN6:1;
  uint16_t CMPEN7:1;
  uint16_t CMPEN8:1;
  uint16_t CMPEN9:1;
  uint16_t CMPEN10:1;
  uint16_t CMPEN11:1;
  uint16_t CMPEN12:1;
  uint16_t CMPEN13:1;
  uint16_t CMPEN14:1;
  uint16_t CMPEN15:1;
} ADCMP0ENLBITS;
extern volatile ADCMP0ENLBITS ADCMP0ENLbits __attribute__((__sfr__));

#define ADCMP0ENH ADCMP0ENH
extern volatile uint16_t  ADCMP0ENH __attribute__((__sfr__));
typedef struct tagADCMP0ENHBITS {
  uint16_t CMPEN16:1;
  uint16_t CMPEN17:1;
  uint16_t CMPEN18:1;
  uint16_t :5;
  uint16_t CMPEN24:1;
  uint16_t CMPEN25:1;
} ADCMP0ENHBITS;
extern volatile ADCMP0ENHBITS ADCMP0ENHbits __attribute__((__sfr__));

