gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
#define ADEIEH ADEIEH
extern volatile uint16_t  ADEIEH __attribute__((__sfr__));
typedef struct tagADEIEHBITS {
  uint16_t EIEN16:1;
  uint16_t EIEN17:1;
  uint16_t EIEN18:1;
  uint16_t :5;
  uint16_t EIEN24:1;
  uint16_t EIEN25:1;
} ADEIEHBITS;
extern volatile ADEIEHBITS ADEIEHbits __attribute__((__sfr__));

#define ADEISTATL ADEISTATL
extern volatile uint16_t  ADEISTATL __attribute__((__sfr__));
typedef struct tagADEISTATLBITS {
  uint16_t EISTAT0:1;
  uint16_t EISTAT1:1;
  uint16_t EISTAT2:1;
  uint16_t EISTAT3:1;
  uint16_t EISTAT4:1;
  uint16_t EISTAT5:1;
  uint16_t EISTAT6:1;
  uint16_t EISTAT7:1;
  uint16_t EISTAT8:1;
  uint16_t EISTAT9:1;
  uint16_t EISTAT10:1;
  uint16_t EISTAT11:1;
  uint16_t EISTAT12:1;
  uint16_t EISTAT13:1;
  uint16_t EISTAT14:1;
  uint16_t EISTAT15:1;
} ADEISTATLBITS;
extern volatile ADEISTATLBITS ADEISTATLbits __attribute__((__sfr__));

#define ADEISTATH ADEISTATH
extern volatile uint16_t  ADEISTATH __attribute__((__sfr__));
typedef struct tagADEISTATHBITS {
  uint16_t EISTAT16:1;
  uint16_t EISTAT17:1;
  uint16_t EISTAT18:1;
  uint16_t :5;
  uint16_t EISTAT24:1;
  uint16_t EISTAT25:1;
} ADEISTATHBITS;
extern volatile ADEISTATHBITS ADEISTATHbits __attribute__((__sfr__));

#define ADCON5L ADCON5L
extern volatile uint16_t  ADCON5L __attribute__((__sfr__));
typedef struct tagADCON5LBITS {
  uint16_t C0PWR:1;
  uint16_t C1PWR:1;
  uint16_t :5;
  uint16_t SHRPWR:1;
  uint16_t C0RDY:1;
  uint16_t C1RDY:1;
  uint16_t :5;
  uint16_t SHRRDY:1;
} ADCON5LBITS;
extern volatile ADCON5LBITS ADCON5Lbits __attribute__((__sfr__));

#define ADCON5H ADCON5H
extern volatile uint16_t  ADCON5H __attribute__((__sfr__));
__extension__ typedef struct tagADCON5HBITS {
  union {
    struct {
      uint16_t C0CIE:1;
      uint16_t C1CIE:1;
      uint16_t :5;
      uint16_t SHRCIE:1;
      uint16_t WARMTIME:4;
    };
    struct {
      uint16_t C0C1E:1;
      uint16_t C1C1E:1;
    };
  };
} ADCON5HBITS;
extern volatile ADCON5HBITS ADCON5Hbits __attribute__((__sfr__));

#define ADCBUF0 ADCBUF0
extern volatile uint16_t  ADCBUF0 __attribute__((__sfr__));
#define ADCBUF1 ADCBUF1
extern volatile uint16_t  ADCBUF1 __attribute__((__sfr__));
#define ADCBUF2 ADCBUF2
extern volatile uint16_t  ADCBUF2 __attribute__((__sfr__));
#define ADCBUF3 ADCBUF3
extern volatile uint16_t  ADCBUF3 __attribute__((__sfr__));
#define ADCBUF4 ADCBUF4
extern volatile uint16_t  ADCBUF4 __attribute__((__sfr__));
#define ADCBUF5 ADCBUF5
extern volatile uint16_t  ADCBUF5 __attribute__((__sfr__));
#define ADCBUF6 ADCBUF6
extern volatile uint16_t  ADCBUF6 __attribute__((__sfr__));
#define ADCBUF7 ADCBUF7
extern volatile uint16_t  ADCBUF7 __attribute__((__sfr__));
#define ADCBUF8 ADCBUF8
extern volatile uint16_t  ADCBUF8 __attribute__((__sfr__));
#define ADCBUF9 ADCBUF9
extern volatile uint16_t  ADCBUF9 __attribute__((__sfr__));
#define ADCBUF10 ADCBUF10
extern volatile uint16_t  ADCBUF10 __attribute__((__sfr__));
#define ADCBUF11 ADCBUF11
extern volatile uint16_t  ADCBUF11 __attribute__((__sfr__));
#define ADCBUF12 ADCBUF12
extern volatile uint16_t  ADCBUF12 __attribute__((__sfr__));
#define ADCBUF13 ADCBUF13
extern volatile uint16_t  ADCBUF13 __attribute__((__sfr__));
#define ADCBUF14 ADCBUF14
extern volatile uint16_t  ADCBUF14 __attribute__((__sfr__));
#define ADCBUF15 ADCBUF15
extern volatile uint16_t  ADCBUF15 __attribute__((__sfr__));
#define ADCBUF16 ADCBUF16
extern volatile uint16_t  ADCBUF16 __attribute__((__sfr__));
#define ADCBUF17 ADCBUF17
extern volatile uint16_t  ADCBUF17 __attribute__((__sfr__));
#define ADCBUF18 ADCBUF18
extern volatile uint16_t  ADCBUF18 __attribute__((__sfr__));
#define ADCBUF24 ADCBUF24
extern volatile uint16_t  ADCBUF24 __attribute__((__sfr__));
#define ADCBUF25 ADCBUF25
extern volatile uint16_t  ADCBUF25 __attribute__((__sfr__));
#define DACCTRL1L DACCTRL1L
extern volatile uint16_t  DACCTRL1L __attribute__((__sfr__));
__extension__ typedef struct tagDACCTRL1LBITS {
  union {
    struct {
      uint16_t FCLKDIV:3;
      uint16_t :1;
      uint16_t CLKDIV:2;
      uint16_t CLKSEL:2;
      uint16_t :5;
      uint16_t DACSIDL:1;
      uint16_t :1;
      uint16_t DACON:1;
    };
    struct {
      uint16_t FCLKDIV0:1;
      uint16_t FCLKDIV1:1;
      uint16_t FCLKDIV2:1;
      uint16_t :1;
      uint16_t CLKDIV0:1;
      uint16_t CLKDIV1:1;
      uint16_t CLKSEL0:1;
      uint16_t CLKSEL1:1;
    };
  };
} DACCTRL1LBITS;
extern volatile DACCTRL1LBITS DACCTRL1Lbits __attribute__((__sfr__));

#define DACCTRL2L DACCTRL2L
extern volatile uint16_t  DACCTRL2L __attribute__((__sfr__));
__extension__ typedef struct tagDACCTRL2LBITS {
  union {
    struct {
      uint16_t TMODTIME:10;
    };
    struct {
      uint16_t TMODTIME0:1;
      uint16_t TMODTIME1:1;
      uint16_t TMODTIME2:1;
      uint16_t TMODTIME3:1;
      uint16_t TMODTIME4:1;
      uint16_t TMODTIME5:1;
      uint16_t TMODTIME6:1;
      uint16_t TMODTIME7:1;
      uint16_t TMODTIME8:1;
      uint16_t TMODTIME9:1;
    };
  };
} DACCTRL2LBITS;
extern volatile DACCTRL2LBITS DACCTRL2Lbits __attribute__((__sfr__));

#define DACCTRL2H DACCTRL2H
extern volatile uint16_t  DACCTRL2H __attribute__((__sfr__));
__extension__ typedef struct tagDACCTRL2HBITS {
  union {
    struct {
      uint16_t SSTIME:10;
    };
    struct {
      uint16_t SSTIME0:1;
      uint16_t SSTIME1:1;
      uint16_t SSTIME2:1;
      uint16_t SSTIME3:1;
      uint16_t SSTIME4:1;
      uint16_t SSTIME5:1;
      uint16_t SSTIME6:1;
      uint16_t SSTIME7:1;
      uint16_t SSTIME8:1;
      uint16_t SSTIME9:1;
    };
  };
} DACCTRL2HBITS;
extern volatile DACCTRL2HBITS DACCTRL2Hbits __attribute__((__sfr__));

#define DAC1CONL DAC1CONL
extern volatile uint16_t  DAC1CONL __attribute__((__sfr__));
__extension__ typedef struct tagDAC1CONLBITS {
  union {
    struct {
      uint16_t HYSSEL:2;
      uint16_t HYSPOL:1;
      uint16_t INSEL:3;
      uint16_t CMPPOL:1;
      uint16_t CMPSTAT:1;
      uint16_t FLTREN:1;
      uint16_t DACOEN:1;
      uint16_t CBE:1;
      uint16_t :2;
      uint16_t IRQM:2;
      uint16_t DACEN:1;
    };
    struct {
      uint16_t HYSSEL0:1;
      uint16_t HYSSEL1:1;
      uint16_t :11;
      uint16_t IRQM0:1;
      uint16_t IRQM1:1;
    };
  };
} DAC1CONLBITS;
extern volatile DAC1CONLBITS DAC1CONLbits __attribute__((__sfr__));

#define DAC1CONH DAC1CONH
extern volatile uint16_t  DAC1CONH __attribute__((__sfr__));
__extension__ typedef struct tagDAC1CONHBITS {
  union {
    struct {
      uint16_t TMCB:10;
    };
    struct {
      uint16_t TMCB0:1;
      uint16_t TMCB1:1;
      uint16_t TMCB2:1;
      uint16_t TMCB3:1;
      uint16_t TMCB4:1;
      uint16_t TMCB5:1;
      uint16_t TMCB6:1;
      uint16_t TMCB7:1;
      uint16_t TMCB8:1;
      uint16_t TMCB9:1;
    };
  };
} DAC1CONHBITS;
extern volatile DAC1CONHBITS DAC1CONHbits __attribute__((__sfr__));

#define DAC1DATL DAC1DATL
extern volatile uint16_t  DAC1DATL __attribute__((__sfr__));
__extension__ typedef struct tagDAC1DATLBITS {
  union {
    struct {
      uint16_t DACLOW:12;
    };
    struct {
      uint16_t DACDATL:12;
    };
    struct {
      uint16_t DACDATL0:1;
      uint16_t DACDATL1:1;
      uint16_t DACDATL2:1;
      uint16_t DACDATL3:1;
      uint16_t DACDATL4:1;
      uint16_t DACDATL5:1;
      uint16_t DACDATL6:1;
      uint16_t DACDATL7:1;
      uint16_t DACDATL8:1;
      uint16_t DACDATL9:1;
      uint16_t DACDATL10:1;
      uint16_t DACDATL11:1;
    };
  };
} DAC1DATLBITS;
