gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
#define RPINR6 RPINR6
extern volatile uint16_t  RPINR6 __attribute__((__sfr__));
typedef struct tagRPINR6BITS {
  uint16_t TCKI4R:8;
  uint16_t ICM4R:8;
} RPINR6BITS;
extern volatile RPINR6BITS RPINR6bits __attribute__((__sfr__));

#define RPINR7 RPINR7
extern volatile uint16_t  RPINR7 __attribute__((__sfr__));
typedef struct tagRPINR7BITS {
  uint16_t TCKI5R:8;
  uint16_t ICM5R:8;
} RPINR7BITS;
extern volatile RPINR7BITS RPINR7bits __attribute__((__sfr__));

#define RPINR8 RPINR8
extern volatile uint16_t  RPINR8 __attribute__((__sfr__));
typedef struct tagRPINR8BITS {
  uint16_t TCKI6R:8;
  uint16_t ICM6R:8;
} RPINR8BITS;
extern volatile RPINR8BITS RPINR8bits __attribute__((__sfr__));

#define RPINR9 RPINR9
extern volatile uint16_t  RPINR9 __attribute__((__sfr__));
typedef struct tagRPINR9BITS {
  uint16_t TCKI7R:8;
  uint16_t ICM7R:8;
} RPINR9BITS;
extern volatile RPINR9BITS RPINR9bits __attribute__((__sfr__));

#define RPINR10 RPINR10
extern volatile uint16_t  RPINR10 __attribute__((__sfr__));
typedef struct tagRPINR10BITS {
  uint16_t TCKI8R:8;
  uint16_t ICM8R:8;
} RPINR10BITS;
extern volatile RPINR10BITS RPINR10bits __attribute__((__sfr__));

#define RPINR11 RPINR11
extern volatile uint16_t  RPINR11 __attribute__((__sfr__));
typedef struct tagRPINR11BITS {
  uint16_t OCFAR:8;
  uint16_t OCFBR:8;
} RPINR11BITS;
extern volatile RPINR11BITS RPINR11bits __attribute__((__sfr__));

#define RPINR12 RPINR12
extern volatile uint16_t  RPINR12 __attribute__((__sfr__));
typedef struct tagRPINR12BITS {
  uint16_t PCI8R:8;
  uint16_t PCI9R:8;
} RPINR12BITS;
extern volatile RPINR12BITS RPINR12bits __attribute__((__sfr__));

#define RPINR13 RPINR13
extern volatile uint16_t  RPINR13 __attribute__((__sfr__));
typedef struct tagRPINR13BITS {
  uint16_t PCI10R:8;
  uint16_t PCI11R:8;
} RPINR13BITS;
extern volatile RPINR13BITS RPINR13bits __attribute__((__sfr__));

#define RPINR14 RPINR14
extern volatile uint16_t  RPINR14 __attribute__((__sfr__));
typedef struct tagRPINR14BITS {
  uint16_t QEIA1R:8;
  uint16_t QEIB1R:8;
} RPINR14BITS;
extern volatile RPINR14BITS RPINR14bits __attribute__((__sfr__));

#define RPINR15 RPINR15
extern volatile uint16_t  RPINR15 __attribute__((__sfr__));
typedef struct tagRPINR15BITS {
  uint16_t QEINDX1R:8;
  uint16_t QEIHOM1R:8;
} RPINR15BITS;
extern volatile RPINR15BITS RPINR15bits __attribute__((__sfr__));

#define RPINR16 RPINR16
extern volatile uint16_t  RPINR16 __attribute__((__sfr__));
typedef struct tagRPINR16BITS {
  uint16_t QEIA2R:8;
  uint16_t QEIB2R:8;
} RPINR16BITS;
extern volatile RPINR16BITS RPINR16bits __attribute__((__sfr__));

#define RPINR17 RPINR17
extern volatile uint16_t  RPINR17 __attribute__((__sfr__));
typedef struct tagRPINR17BITS {
  uint16_t QEINDX2R:8;
  uint16_t QEIHOM2R:8;
} RPINR17BITS;
extern volatile RPINR17BITS RPINR17bits __attribute__((__sfr__));

#define RPINR18 RPINR18
extern volatile uint16_t  RPINR18 __attribute__((__sfr__));
typedef struct tagRPINR18BITS {
  uint16_t U1RXR:8;
  uint16_t U1DSRR:8;
} RPINR18BITS;
extern volatile RPINR18BITS RPINR18bits __attribute__((__sfr__));

#define RPINR19 RPINR19
extern volatile uint16_t  RPINR19 __attribute__((__sfr__));
typedef struct tagRPINR19BITS {
  uint16_t U2RXR:8;
  uint16_t U2DSRR:8;
} RPINR19BITS;
extern volatile RPINR19BITS RPINR19bits __attribute__((__sfr__));

#define RPINR20 RPINR20
extern volatile uint16_t  RPINR20 __attribute__((__sfr__));
typedef struct tagRPINR20BITS {
  uint16_t SDI1R:8;
  uint16_t SCK1R:8;
} RPINR20BITS;
extern volatile RPINR20BITS RPINR20bits __attribute__((__sfr__));

#define RPINR21 RPINR21
extern volatile uint16_t  RPINR21 __attribute__((__sfr__));
typedef struct tagRPINR21BITS {
  uint16_t SS1R:8;
  uint16_t REFOIR:8;
} RPINR21BITS;
extern volatile RPINR21BITS RPINR21bits __attribute__((__sfr__));

#define RPINR22 RPINR22
extern volatile uint16_t  RPINR22 __attribute__((__sfr__));
typedef struct tagRPINR22BITS {
  uint16_t SDI2R:8;
  uint16_t SCK2R:8;
} RPINR22BITS;
extern volatile RPINR22BITS RPINR22bits __attribute__((__sfr__));

#define RPINR23 RPINR23
extern volatile uint16_t  RPINR23 __attribute__((__sfr__));
typedef struct tagRPINR23BITS {
  uint16_t SS2R:8;
} RPINR23BITS;
extern volatile RPINR23BITS RPINR23bits __attribute__((__sfr__));

#define RPINR26 RPINR26
extern volatile uint16_t  RPINR26 __attribute__((__sfr__));
typedef struct tagRPINR26BITS {
  uint16_t CAN1RXR:8;
} RPINR26BITS;
extern volatile RPINR26BITS RPINR26bits __attribute__((__sfr__));

#define RPINR27 RPINR27
extern volatile uint16_t  RPINR27 __attribute__((__sfr__));
typedef struct tagRPINR27BITS {
  uint16_t U3RXR:8;
  uint16_t U3DSRR:8;
} RPINR27BITS;
extern volatile RPINR27BITS RPINR27bits __attribute__((__sfr__));

#define RPINR29 RPINR29
extern volatile uint16_t  RPINR29 __attribute__((__sfr__));
typedef struct tagRPINR29BITS {
  uint16_t SDI3R:8;
  uint16_t SCK3R:8;
} RPINR29BITS;
extern volatile RPINR29BITS RPINR29bits __attribute__((__sfr__));

#define RPINR30 RPINR30
extern volatile uint16_t  RPINR30 __attribute__((__sfr__));
typedef struct tagRPINR30BITS {
  uint16_t SS3R:8;
} RPINR30BITS;
extern volatile RPINR30BITS RPINR30bits __attribute__((__sfr__));

#define RPINR32 RPINR32
extern volatile uint16_t  RPINR32 __attribute__((__sfr__));
typedef struct tagRPINR32BITS {
  uint16_t :8;
  uint16_t TCKI9R:8;
} RPINR32BITS;
extern volatile RPINR32BITS RPINR32bits __attribute__((__sfr__));

#define RPINR33 RPINR33
extern volatile uint16_t  RPINR33 __attribute__((__sfr__));
typedef struct tagRPINR33BITS {
  uint16_t ICM9R:8;
} RPINR33BITS;
extern volatile RPINR33BITS RPINR33bits __attribute__((__sfr__));

#define RPINR37 RPINR37
extern volatile uint16_t  RPINR37 __attribute__((__sfr__));
typedef struct tagRPINR37BITS {
  uint16_t OCFCR:8;
  uint16_t PCI17R:8;
} RPINR37BITS;
extern volatile RPINR37BITS RPINR37bits __attribute__((__sfr__));

#define RPINR38 RPINR38
extern volatile uint16_t  RPINR38 __attribute__((__sfr__));
typedef struct tagRPINR38BITS {
  uint16_t PCI18R:8;
} RPINR38BITS;
