gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
#define RPOR21 RPOR21
extern volatile uint16_t  RPOR21 __attribute__((__sfr__));
typedef struct tagRPOR21BITS {
  uint16_t RP74R:6;
} RPOR21BITS;
extern volatile RPOR21BITS RPOR21bits __attribute__((__sfr__));

#define RPOR22 RPOR22
extern volatile uint16_t  RPOR22 __attribute__((__sfr__));
typedef struct tagRPOR22BITS {
  uint16_t :8;
  uint16_t RP77R:6;
} RPOR22BITS;
extern volatile RPOR22BITS RPOR22bits __attribute__((__sfr__));

#define RPOR24 RPOR24
extern volatile uint16_t  RPOR24 __attribute__((__sfr__));
typedef struct tagRPOR24BITS {
  uint16_t RP176R:6;
  uint16_t :2;
  uint16_t RP177R:6;
} RPOR24BITS;
extern volatile RPOR24BITS RPOR24bits __attribute__((__sfr__));

#define RPOR25 RPOR25
extern volatile uint16_t  RPOR25 __attribute__((__sfr__));
typedef struct tagRPOR25BITS {
  uint16_t RP178R:6;
  uint16_t :2;
  uint16_t RP179R:6;
} RPOR25BITS;
extern volatile RPOR25BITS RPOR25bits __attribute__((__sfr__));

#define RPOR26 RPOR26
extern volatile uint16_t  RPOR26 __attribute__((__sfr__));
typedef struct tagRPOR26BITS {
  uint16_t RP180R:6;
  uint16_t :2;
  uint16_t RP181R:6;
} RPOR26BITS;
extern volatile RPOR26BITS RPOR26bits __attribute__((__sfr__));

#define ANSELA ANSELA
extern volatile uint16_t  ANSELA __attribute__((__sfr__));
typedef struct tagANSELABITS {
  uint16_t ANSELA0:1;
  uint16_t ANSELA1:1;
  uint16_t ANSELA2:1;
  uint16_t ANSELA3:1;
  uint16_t ANSELA4:1;
} ANSELABITS;
extern volatile ANSELABITS ANSELAbits __attribute__((__sfr__));

#define TRISA TRISA
extern volatile uint16_t  TRISA __attribute__((__sfr__));
typedef struct tagTRISABITS {
  uint16_t TRISA0:1;
  uint16_t TRISA1:1;
  uint16_t TRISA2:1;
  uint16_t TRISA3:1;
  uint16_t TRISA4:1;
} TRISABITS;
extern volatile TRISABITS TRISAbits __attribute__((__sfr__));

#define PORTA PORTA
extern volatile uint16_t  PORTA __attribute__((__sfr__));
typedef struct tagPORTABITS {
  uint16_t RA0:1;
  uint16_t RA1:1;
  uint16_t RA2:1;
  uint16_t RA3:1;
  uint16_t RA4:1;
} PORTABITS;
extern volatile PORTABITS PORTAbits __attribute__((__sfr__));

#define LATA LATA
extern volatile uint16_t  LATA __attribute__((__sfr__));
typedef struct tagLATABITS {
  uint16_t LATA0:1;
  uint16_t LATA1:1;
  uint16_t LATA2:1;
  uint16_t LATA3:1;
  uint16_t LATA4:1;
} LATABITS;
extern volatile LATABITS LATAbits __attribute__((__sfr__));

#define ODCA ODCA
extern volatile uint16_t  ODCA __attribute__((__sfr__));
typedef struct tagODCABITS {
  uint16_t ODCA0:1;
  uint16_t ODCA1:1;
  uint16_t ODCA2:1;
  uint16_t ODCA3:1;
  uint16_t ODCA4:1;
} ODCABITS;
extern volatile ODCABITS ODCAbits __attribute__((__sfr__));

#define CNPUA CNPUA
extern volatile uint16_t  CNPUA __attribute__((__sfr__));
typedef struct tagCNPUABITS {
  uint16_t CNPUA0:1;
  uint16_t CNPUA1:1;
  uint16_t CNPUA2:1;
  uint16_t CNPUA3:1;
  uint16_t CNPUA4:1;
} CNPUABITS;
extern volatile CNPUABITS CNPUAbits __attribute__((__sfr__));

#define CNPDA CNPDA
extern volatile uint16_t  CNPDA __attribute__((__sfr__));
typedef struct tagCNPDABITS {
  uint16_t CNPDA0:1;
  uint16_t CNPDA1:1;
  uint16_t CNPDA2:1;
  uint16_t CNPDA3:1;
  uint16_t CNPDA4:1;
} CNPDABITS;
extern volatile CNPDABITS CNPDAbits __attribute__((__sfr__));

#define CNCONA CNCONA
extern volatile uint16_t  CNCONA __attribute__((__sfr__));
typedef struct tagCNCONABITS {
  uint16_t :11;
  uint16_t CNSTYLE:1;
  uint16_t :3;
  uint16_t ON:1;
} CNCONABITS;
extern volatile CNCONABITS CNCONAbits __attribute__((__sfr__));

#define CNEN0A CNEN0A
extern volatile uint16_t  CNEN0A __attribute__((__sfr__));
typedef struct tagCNEN0ABITS {
  uint16_t CNEN0A0:1;
  uint16_t CNEN0A1:1;
  uint16_t CNEN0A2:1;
  uint16_t CNEN0A3:1;
  uint16_t CNEN0A4:1;
} CNEN0ABITS;
extern volatile CNEN0ABITS CNEN0Abits __attribute__((__sfr__));

#define CNSTATA CNSTATA
extern volatile uint16_t  CNSTATA __attribute__((__sfr__));
typedef struct tagCNSTATABITS {
  uint16_t CNSTATA0:1;
  uint16_t CNSTATA1:1;
  uint16_t CNSTATA2:1;
  uint16_t CNSTATA3:1;
  uint16_t CNSTATA4:1;
} CNSTATABITS;
extern volatile CNSTATABITS CNSTATAbits __attribute__((__sfr__));

#define CNEN1A CNEN1A
extern volatile uint16_t  CNEN1A __attribute__((__sfr__));
typedef struct tagCNEN1ABITS {
  uint16_t CNEN1A0:1;
  uint16_t CNEN1A1:1;
  uint16_t CNEN1A2:1;
  uint16_t CNEN1A3:1;
  uint16_t CNEN1A4:1;
} CNEN1ABITS;
extern volatile CNEN1ABITS CNEN1Abits __attribute__((__sfr__));

#define CNFA CNFA
extern volatile uint16_t  CNFA __attribute__((__sfr__));
typedef struct tagCNFABITS {
  uint16_t CNFA0:1;
  uint16_t CNFA1:1;
  uint16_t CNFA2:1;
  uint16_t CNFA3:1;
  uint16_t CNFA4:1;
} CNFABITS;
extern volatile CNFABITS CNFAbits __attribute__((__sfr__));

#define ANSELB ANSELB
extern volatile uint16_t  ANSELB __attribute__((__sfr__));
typedef struct tagANSELBBITS {
  uint16_t ANSELB0:1;
  uint16_t ANSELB1:1;
  uint16_t ANSELB2:1;
  uint16_t ANSELB3:1;
  uint16_t ANSELB4:1;
  uint16_t :2;
  uint16_t ANSELB7:1;
  uint16_t ANSELB8:1;
  uint16_t ANSELB9:1;
} ANSELBBITS;
extern volatile ANSELBBITS ANSELBbits __attribute__((__sfr__));

#define TRISB TRISB
extern volatile uint16_t  TRISB __attribute__((__sfr__));
typedef struct tagTRISBBITS {
  uint16_t TRISB0:1;
  uint16_t TRISB1:1;
  uint16_t TRISB2:1;
  uint16_t TRISB3:1;
  uint16_t TRISB4:1;
  uint16_t TRISB5:1;
  uint16_t TRISB6:1;
  uint16_t TRISB7:1;
  uint16_t TRISB8:1;
  uint16_t TRISB9:1;
  uint16_t TRISB10:1;
  uint16_t TRISB11:1;
  uint16_t TRISB12:1;
  uint16_t TRISB13:1;
  uint16_t TRISB14:1;
  uint16_t TRISB15:1;
} TRISBBITS;
extern volatile TRISBBITS TRISBbits __attribute__((__sfr__));

#define PORTB PORTB
extern volatile uint16_t  PORTB __attribute__((__sfr__));
typedef struct tagPORTBBITS {
  uint16_t RB0:1;
  uint16_t RB1:1;
  uint16_t RB2:1;
  uint16_t RB3:1;
  uint16_t RB4:1;
  uint16_t RB5:1;
  uint16_t RB6:1;
  uint16_t RB7:1;
  uint16_t RB8:1;
  uint16_t RB9:1;
  uint16_t RB10:1;
  uint16_t RB11:1;
  uint16_t RB12:1;
  uint16_t RB13:1;
  uint16_t RB14:1;
  uint16_t RB15:1;
} PORTBBITS;
extern volatile PORTBBITS PORTBbits __attribute__((__sfr__));

#define LATB LATB
extern volatile uint16_t  LATB __attribute__((__sfr__));
typedef struct tagLATBBITS {
  uint16_t LATB0:1;
  uint16_t LATB1:1;
  uint16_t LATB2:1;
  uint16_t LATB3:1;
  uint16_t LATB4:1;
  uint16_t LATB5:1;
  uint16_t LATB6:1;
  uint16_t LATB7:1;
  uint16_t LATB8:1;
  uint16_t LATB9:1;
  uint16_t LATB10:1;
  uint16_t LATB11:1;
  uint16_t LATB12:1;
  uint16_t LATB13:1;
  uint16_t LATB14:1;
  uint16_t LATB15:1;
} LATBBITS;
extern volatile LATBBITS LATBbits __attribute__((__sfr__));

#define ODCB ODCB
extern volatile uint16_t  ODCB __attribute__((__sfr__));
typedef struct tagODCBBITS {
  uint16_t ODCB0:1;
  uint16_t ODCB1:1;
  uint16_t ODCB2:1;
  uint16_t ODCB3:1;
  uint16_t ODCB4:1;
  uint16_t ODCB5:1;
  uint16_t ODCB6:1;
  uint16_t ODCB7:1;
  uint16_t ODCB8:1;
  uint16_t ODCB9:1;
  uint16_t ODCB10:1;
  uint16_t ODCB11:1;
  uint16_t ODCB12:1;
  uint16_t ODCB13:1;
  uint16_t ODCB14:1;
  uint16_t ODCB15:1;
} ODCBBITS;
extern volatile ODCBBITS ODCBbits __attribute__((__sfr__));

