gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
#define CNPUB CNPUB
extern volatile uint16_t  CNPUB __attribute__((__sfr__));
typedef struct tagCNPUBBITS {
  uint16_t CNPUB0:1;
  uint16_t CNPUB1:1;
  uint16_t CNPUB2:1;
  uint16_t CNPUB3:1;
  uint16_t CNPUB4:1;
  uint16_t CNPUB5:1;
  uint16_t CNPUB6:1;
  uint16_t CNPUB7:1;
  uint16_t CNPUB8:1;
  uint16_t CNPUB9:1;
  uint16_t CNPUB10:1;
  uint16_t CNPUB11:1;
  uint16_t CNPUB12:1;
  uint16_t CNPUB13:1;
  uint16_t CNPUB14:1;
  uint16_t CNPUB15:1;
} CNPUBBITS;
extern volatile CNPUBBITS CNPUBbits __attribute__((__sfr__));

#define CNPDB CNPDB
extern volatile uint16_t  CNPDB __attribute__((__sfr__));
typedef struct tagCNPDBBITS {
  uint16_t CNPDB0:1;
  uint16_t CNPDB1:1;
  uint16_t CNPDB2:1;
  uint16_t CNPDB3:1;
  uint16_t CNPDB4:1;
  uint16_t CNPDB5:1;
  uint16_t CNPDB6:1;
  uint16_t CNPDB7:1;
  uint16_t CNPDB8:1;
  uint16_t CNPDB9:1;
  uint16_t CNPDB10:1;
  uint16_t CNPDB11:1;
  uint16_t CNPDB12:1;
  uint16_t CNPDB13:1;
  uint16_t CNPDB14:1;
  uint16_t CNPDB15:1;
} CNPDBBITS;
extern volatile CNPDBBITS CNPDBbits __attribute__((__sfr__));

#define CNCONB CNCONB
extern volatile uint16_t  CNCONB __attribute__((__sfr__));
typedef struct tagCNCONBBITS {
  uint16_t :11;
  uint16_t CNSTYLE:1;
  uint16_t :3;
  uint16_t ON:1;
} CNCONBBITS;
extern volatile CNCONBBITS CNCONBbits __attribute__((__sfr__));

#define CNEN0B CNEN0B
extern volatile uint16_t  CNEN0B __attribute__((__sfr__));
typedef struct tagCNEN0BBITS {
  uint16_t CNEN0B0:1;
  uint16_t CNEN0B1:1;
  uint16_t CNEN0B2:1;
  uint16_t CNEN0B3:1;
  uint16_t CNEN0B4:1;
  uint16_t CNEN0B5:1;
  uint16_t CNEN0B6:1;
  uint16_t CNEN0B7:1;
  uint16_t CNEN0B8:1;
  uint16_t CNEN0B9:1;
  uint16_t CNEN0B10:1;
  uint16_t CNEN0B11:1;
  uint16_t CNEN0B12:1;
  uint16_t CNEN0B13:1;
  uint16_t CNEN0B14:1;
  uint16_t CNEN0B15:1;
} CNEN0BBITS;
extern volatile CNEN0BBITS CNEN0Bbits __attribute__((__sfr__));

#define CNSTATB CNSTATB
extern volatile uint16_t  CNSTATB __attribute__((__sfr__));
typedef struct tagCNSTATBBITS {
  uint16_t CNSTATB0:1;
  uint16_t CNSTATB1:1;
  uint16_t CNSTATB2:1;
  uint16_t CNSTATB3:1;
  uint16_t CNSTATB4:1;
  uint16_t CNSTATB5:1;
  uint16_t CNSTATB6:1;
  uint16_t CNSTATB7:1;
  uint16_t CNSTATB8:1;
  uint16_t CNSTATB9:1;
  uint16_t CNSTATB10:1;
  uint16_t CNSTATB11:1;
  uint16_t CNSTATB12:1;
  uint16_t CNSTATB13:1;
  uint16_t CNSTATB14:1;
  uint16_t CNSTATB15:1;
} CNSTATBBITS;
extern volatile CNSTATBBITS CNSTATBbits __attribute__((__sfr__));

#define CNEN1B CNEN1B
extern volatile uint16_t  CNEN1B __attribute__((__sfr__));
typedef struct tagCNEN1BBITS {
  uint16_t CNEN1B0:1;
  uint16_t CNEN1B1:1;
  uint16_t CNEN1B2:1;
  uint16_t CNEN1B3:1;
  uint16_t CNEN1B4:1;
  uint16_t CNEN1B5:1;
  uint16_t CNEN1B6:1;
  uint16_t CNEN1B7:1;
  uint16_t CNEN1B8:1;
  uint16_t CNEN1B9:1;
  uint16_t CNEN1B10:1;
  uint16_t CNEN1B11:1;
  uint16_t CNEN1B12:1;
  uint16_t CNEN1B13:1;
  uint16_t CNEN1B14:1;
  uint16_t CNEN1B15:1;
} CNEN1BBITS;
extern volatile CNEN1BBITS CNEN1Bbits __attribute__((__sfr__));

#define CNFB CNFB
extern volatile uint16_t  CNFB __attribute__((__sfr__));
typedef struct tagCNFBBITS {
  uint16_t CNFB0:1;
  uint16_t CNFB1:1;
  uint16_t CNFB2:1;
  uint16_t CNFB3:1;
  uint16_t CNFB4:1;
  uint16_t CNFB5:1;
  uint16_t CNFB6:1;
  uint16_t CNFB7:1;
  uint16_t CNFB8:1;
  uint16_t CNFB9:1;
  uint16_t CNFB10:1;
  uint16_t CNFB11:1;
  uint16_t CNFB12:1;
  uint16_t CNFB13:1;
  uint16_t CNFB14:1;
  uint16_t CNFB15:1;
} CNFBBITS;
extern volatile CNFBBITS CNFBbits __attribute__((__sfr__));

#define ANSELC ANSELC
extern volatile uint16_t  ANSELC __attribute__((__sfr__));
typedef struct tagANSELCBITS {
  uint16_t ANSELC0:1;
  uint16_t ANSELC1:1;
  uint16_t ANSELC2:1;
  uint16_t ANSELC3:1;
  uint16_t :2;
  uint16_t ANSELC6:1;
  uint16_t ANSELC7:1;
} ANSELCBITS;
extern volatile ANSELCBITS ANSELCbits __attribute__((__sfr__));

#define TRISC TRISC
extern volatile uint16_t  TRISC __attribute__((__sfr__));
typedef struct tagTRISCBITS {
  uint16_t TRISC0:1;
  uint16_t TRISC1:1;
  uint16_t TRISC2:1;
  uint16_t TRISC3:1;
  uint16_t TRISC4:1;
  uint16_t TRISC5:1;
  uint16_t TRISC6:1;
  uint16_t TRISC7:1;
  uint16_t TRISC8:1;
  uint16_t TRISC9:1;
  uint16_t TRISC10:1;
  uint16_t TRISC11:1;
  uint16_t TRISC12:1;
  uint16_t TRISC13:1;
} TRISCBITS;
extern volatile TRISCBITS TRISCbits __attribute__((__sfr__));

#define PORTC PORTC
extern volatile uint16_t  PORTC __attribute__((__sfr__));
typedef struct tagPORTCBITS {
  uint16_t RC0:1;
  uint16_t RC1:1;
  uint16_t RC2:1;
  uint16_t RC3:1;
  uint16_t RC4:1;
  uint16_t RC5:1;
  uint16_t RC6:1;
  uint16_t RC7:1;
  uint16_t RC8:1;
  uint16_t RC9:1;
  uint16_t RC10:1;
  uint16_t RC11:1;
  uint16_t RC12:1;
  uint16_t RC13:1;
} PORTCBITS;
extern volatile PORTCBITS PORTCbits __attribute__((__sfr__));

#define LATC LATC
extern volatile uint16_t  LATC __attribute__((__sfr__));
typedef struct tagLATCBITS {
  uint16_t LATC0:1;
  uint16_t LATC1:1;
  uint16_t LATC2:1;
  uint16_t LATC3:1;
  uint16_t LATC4:1;
  uint16_t LATC5:1;
  uint16_t LATC6:1;
  uint16_t LATC7:1;
  uint16_t LATC8:1;
  uint16_t LATC9:1;
  uint16_t LATC10:1;
  uint16_t LATC11:1;
  uint16_t LATC12:1;
  uint16_t LATC13:1;
} LATCBITS;
extern volatile LATCBITS LATCbits __attribute__((__sfr__));

#define ODCC ODCC
extern volatile uint16_t  ODCC __attribute__((__sfr__));
typedef struct tagODCCBITS {
  uint16_t ODCC0:1;
  uint16_t ODCC1:1;
  uint16_t ODCC2:1;
  uint16_t ODCC3:1;
  uint16_t ODCC4:1;
  uint16_t ODCC5:1;
  uint16_t ODCC6:1;
  uint16_t ODCC7:1;
  uint16_t ODCC8:1;
  uint16_t ODCC9:1;
  uint16_t ODCC10:1;
  uint16_t ODCC11:1;
  uint16_t ODCC12:1;
  uint16_t ODCC13:1;
} ODCCBITS;
extern volatile ODCCBITS ODCCbits __attribute__((__sfr__));

#define CNPUC CNPUC
extern volatile uint16_t  CNPUC __attribute__((__sfr__));
typedef struct tagCNPUCBITS {
  uint16_t CNPUC0:1;
  uint16_t CNPUC1:1;
  uint16_t CNPUC2:1;
  uint16_t CNPUC3:1;
  uint16_t CNPUC4:1;
  uint16_t CNPUC5:1;
  uint16_t CNPUC6:1;
  uint16_t CNPUC7:1;
  uint16_t CNPUC8:1;
  uint16_t CNPUC9:1;
  uint16_t CNPUC10:1;
  uint16_t CNPUC11:1;
  uint16_t CNPUC12:1;
  uint16_t CNPUC13:1;
} CNPUCBITS;
extern volatile CNPUCBITS CNPUCbits __attribute__((__sfr__));

#define CNPDC CNPDC
extern volatile uint16_t  CNPDC __attribute__((__sfr__));
typedef struct tagCNPDCBITS {
  uint16_t CNPDC0:1;
  uint16_t CNPDC1:1;
  uint16_t CNPDC2:1;
  uint16_t CNPDC3:1;
  uint16_t CNPDC4:1;
  uint16_t CNPDC5:1;
  uint16_t CNPDC6:1;
  uint16_t CNPDC7:1;
  uint16_t CNPDC8:1;
  uint16_t CNPDC9:1;
  uint16_t CNPDC10:1;
  uint16_t CNPDC11:1;
  uint16_t CNPDC12:1;
  uint16_t CNPDC13:1;
} CNPDCBITS;
extern volatile CNPDCBITS CNPDCbits __attribute__((__sfr__));

#define CNCONC CNCONC
extern volatile uint16_t  CNCONC __attribute__((__sfr__));
typedef struct tagCNCONCBITS {
  uint16_t :11;
  uint16_t CNSTYLE:1;
  uint16_t :3;
  uint16_t ON:1;
} CNCONCBITS;
extern volatile CNCONCBITS CNCONCbits __attribute__((__sfr__));

#define CNEN0C CNEN0C
extern volatile uint16_t  CNEN0C __attribute__((__sfr__));
typedef struct tagCNEN0CBITS {
  uint16_t CNEN0C0:1;
  uint16_t CNEN0C1:1;
  uint16_t CNEN0C2:1;
  uint16_t CNEN0C3:1;
  uint16_t CNEN0C4:1;
  uint16_t CNEN0C5:1;
  uint16_t CNEN0C6:1;
  uint16_t CNEN0C7:1;
  uint16_t CNEN0C8:1;
  uint16_t CNEN0C9:1;
  uint16_t CNEN0C10:1;
  uint16_t CNEN0C11:1;
  uint16_t CNEN0C12:1;
  uint16_t CNEN0C13:1;
} CNEN0CBITS;
