gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
extern volatile CNEN0CBITS CNEN0Cbits __attribute__((__sfr__));

#define CNSTATC CNSTATC
extern volatile uint16_t  CNSTATC __attribute__((__sfr__));
typedef struct tagCNSTATCBITS {
  uint16_t CNSTATC0:1;
  uint16_t CNSTATC1:1;
  uint16_t CNSTATC2:1;
  uint16_t CNSTATC3:1;
  uint16_t CNSTATC4:1;
  uint16_t CNSTATC5:1;
  uint16_t CNSTATC6:1;
  uint16_t CNSTATC7:1;
  uint16_t CNSTATC8:1;
  uint16_t CNSTATC9:1;
  uint16_t CNSTATC10:1;
  uint16_t CNSTATC11:1;
  uint16_t CNSTATC12:1;
  uint16_t CNSTATC13:1;
} CNSTATCBITS;
extern volatile CNSTATCBITS CNSTATCbits __attribute__((__sfr__));

#define CNEN1C CNEN1C
extern volatile uint16_t  CNEN1C __attribute__((__sfr__));
typedef struct tagCNEN1CBITS {
  uint16_t CNEN1C0:1;
  uint16_t CNEN1C1:1;
  uint16_t CNEN1C2:1;
  uint16_t CNEN1C3:1;
  uint16_t CNEN1C4:1;
  uint16_t CNEN1C5:1;
  uint16_t CNEN1C6:1;
  uint16_t CNEN1C7:1;
  uint16_t CNEN1C8:1;
  uint16_t CNEN1C9:1;
  uint16_t CNEN1C10:1;
  uint16_t CNEN1C11:1;
  uint16_t CNEN1C12:1;
  uint16_t CNEN1C13:1;
} CNEN1CBITS;
extern volatile CNEN1CBITS CNEN1Cbits __attribute__((__sfr__));

#define CNFC CNFC
extern volatile uint16_t  CNFC __attribute__((__sfr__));
typedef struct tagCNFCBITS {
  uint16_t CNFC0:1;
  uint16_t CNFC1:1;
  uint16_t CNFC2:1;
  uint16_t CNFC3:1;
  uint16_t CNFC4:1;
  uint16_t CNFC5:1;
  uint16_t CNFC6:1;
  uint16_t CNFC7:1;
  uint16_t CNFC8:1;
  uint16_t CNFC9:1;
  uint16_t CNFC10:1;
  uint16_t CNFC11:1;
  uint16_t CNFC12:1;
  uint16_t CNFC13:1;
} CNFCBITS;
extern volatile CNFCBITS CNFCbits __attribute__((__sfr__));

#define ANSELD ANSELD
extern volatile uint16_t  ANSELD __attribute__((__sfr__));
typedef struct tagANSELDBITS {
  uint16_t :10;
  uint16_t ANSELD10:1;
  uint16_t :2;
  uint16_t ANSELD13:1;
} ANSELDBITS;
extern volatile ANSELDBITS ANSELDbits __attribute__((__sfr__));

#define TRISD TRISD
extern volatile uint16_t  TRISD __attribute__((__sfr__));
typedef struct tagTRISDBITS {
  uint16_t :1;
  uint16_t TRISD1:1;
  uint16_t :6;
  uint16_t TRISD8:1;
  uint16_t :1;
  uint16_t TRISD10:1;
  uint16_t :2;
  uint16_t TRISD13:1;
} TRISDBITS;
extern volatile TRISDBITS TRISDbits __attribute__((__sfr__));

#define PORTD PORTD
extern volatile uint16_t  PORTD __attribute__((__sfr__));
typedef struct tagPORTDBITS {
  uint16_t :1;
  uint16_t RD1:1;
  uint16_t :6;
  uint16_t RD8:1;
  uint16_t :1;
  uint16_t RD10:1;
  uint16_t :2;
  uint16_t RD13:1;
} PORTDBITS;
extern volatile PORTDBITS PORTDbits __attribute__((__sfr__));

#define LATD LATD
extern volatile uint16_t  LATD __attribute__((__sfr__));
typedef struct tagLATDBITS {
  uint16_t :1;
  uint16_t LATD1:1;
  uint16_t :6;
  uint16_t LATD8:1;
  uint16_t :1;
  uint16_t LATD10:1;
  uint16_t :2;
  uint16_t LATD13:1;
} LATDBITS;
extern volatile LATDBITS LATDbits __attribute__((__sfr__));

#define ODCD ODCD
extern volatile uint16_t  ODCD __attribute__((__sfr__));
typedef struct tagODCDBITS {
  uint16_t :1;
  uint16_t ODCD1:1;
  uint16_t :6;
  uint16_t ODCD8:1;
  uint16_t :1;
  uint16_t ODCD10:1;
  uint16_t :2;
  uint16_t ODCD13:1;
} ODCDBITS;
extern volatile ODCDBITS ODCDbits __attribute__((__sfr__));

#define CNPUD CNPUD
extern volatile uint16_t  CNPUD __attribute__((__sfr__));
typedef struct tagCNPUDBITS {
  uint16_t :1;
  uint16_t CNPUD1:1;
  uint16_t :6;
  uint16_t CNPUD8:1;
  uint16_t :1;
  uint16_t CNPUD10:1;
  uint16_t :2;
  uint16_t CNPUD13:1;
} CNPUDBITS;
extern volatile CNPUDBITS CNPUDbits __attribute__((__sfr__));

#define CNPDD CNPDD
extern volatile uint16_t  CNPDD __attribute__((__sfr__));
typedef struct tagCNPDDBITS {
  uint16_t :1;
  uint16_t CNPDD1:1;
  uint16_t :6;
  uint16_t CNPDD8:1;
  uint16_t :1;
  uint16_t CNPDD10:1;
  uint16_t :2;
  uint16_t CNPDD13:1;
} CNPDDBITS;
extern volatile CNPDDBITS CNPDDbits __attribute__((__sfr__));

#define CNCOND CNCOND
extern volatile uint16_t  CNCOND __attribute__((__sfr__));
typedef struct tagCNCONDBITS {
  uint16_t :11;
  uint16_t CNSTYLE:1;
  uint16_t :3;
  uint16_t ON:1;
} CNCONDBITS;
extern volatile CNCONDBITS CNCONDbits __attribute__((__sfr__));

#define CNEN0D CNEN0D
extern volatile uint16_t  CNEN0D __attribute__((__sfr__));
typedef struct tagCNEN0DBITS {
  uint16_t :1;
  uint16_t CNEN0D1:1;
  uint16_t :6;
  uint16_t CNEN0D8:1;
  uint16_t :1;
  uint16_t CNEN0D10:1;
  uint16_t :2;
  uint16_t CNEN0D13:1;
} CNEN0DBITS;
extern volatile CNEN0DBITS CNEN0Dbits __attribute__((__sfr__));

#define CNSTATD CNSTATD
extern volatile uint16_t  CNSTATD __attribute__((__sfr__));
typedef struct tagCNSTATDBITS {
  uint16_t :1;
  uint16_t CNSTATD1:1;
  uint16_t :6;
  uint16_t CNSTATD8:1;
  uint16_t :1;
  uint16_t CNSTATD10:1;
  uint16_t :2;
  uint16_t CNSTATD13:1;
} CNSTATDBITS;
extern volatile CNSTATDBITS CNSTATDbits __attribute__((__sfr__));

#define CNEN1D CNEN1D
extern volatile uint16_t  CNEN1D __attribute__((__sfr__));
typedef struct tagCNEN1DBITS {
  uint16_t :1;
  uint16_t CNEN1D1:1;
  uint16_t :6;
  uint16_t CNEN1D8:1;
  uint16_t :1;
  uint16_t CNEN1D10:1;
  uint16_t :2;
  uint16_t CNEN1D13:1;
} CNEN1DBITS;
extern volatile CNEN1DBITS CNEN1Dbits __attribute__((__sfr__));

#define CNFD CNFD
extern volatile uint16_t  CNFD __attribute__((__sfr__));
typedef struct tagCNFDBITS {
  uint16_t :1;
  uint16_t CNFD1:1;
  uint16_t :6;
  uint16_t CNFD8:1;
  uint16_t :1;
  uint16_t CNFD10:1;
  uint16_t :2;
  uint16_t CNFD13:1;
} CNFDBITS;
extern volatile CNFDBITS CNFDbits __attribute__((__sfr__));

#define MBISTCON MBISTCON
extern volatile uint16_t  MBISTCON __attribute__((__sfr__));
typedef struct tagMBISTCONBITS {
  uint16_t MBISTEN:1;
  uint16_t :3;
  uint16_t MBISTSTAT:1;
  uint16_t :2;
  uint16_t MBISTDONE:1;
  uint16_t FLTINJ:1;
} MBISTCONBITS;
extern volatile MBISTCONBITS MBISTCONbits __attribute__((__sfr__));

#define U3MODE U3MODE
extern volatile uint16_t  U3MODE __attribute__((__sfr__));
__extension__ typedef struct tagU3MODEBITS {
  union {
    struct {
      uint16_t MOD:4;
      uint16_t URXEN:1;
      uint16_t UTXEN:1;
      uint16_t ABAUD:1;
      uint16_t BRGH:1;
      uint16_t UTXBRK:1;
      uint16_t BRKOVR:1;
      uint16_t :1;
      uint16_t RXBIMD:1;
      uint16_t WAKE:1;
      uint16_t USIDL:1;
      uint16_t :1;
      uint16_t UARTEN:1;
    };
    struct {
      uint16_t MOD0:1;
      uint16_t MOD1:1;
      uint16_t MOD2:1;
      uint16_t MOD3:1;
    };
  };
} U3MODEBITS;
