gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
extern volatile U3MODEBITS U3MODEbits __attribute__((__sfr__));

#define U3MODEH U3MODEH
extern volatile uint16_t  U3MODEH __attribute__((__sfr__));
__extension__ typedef struct tagU3MODEHBITS {
  union {
    struct {
      uint16_t FLO:2;
      uint16_t UTXINV:1;
      uint16_t C0EN:1;
      uint16_t STSEL:2;
      uint16_t URXINV:1;
      uint16_t RUNOVF:1;
      uint16_t HALFDPLX:1;
      uint16_t BCLKSEL:2;
      uint16_t BCLKMOD:1;
      uint16_t :2;
      uint16_t ACTIVE:1;
      uint16_t SLPEN:1;
    };
    struct {
      uint16_t FLO0:1;
      uint16_t FLO1:1;
      uint16_t :2;
      uint16_t STSEL0:1;
      uint16_t STSEL1:1;
      uint16_t :3;
      uint16_t BCLKSEL0:1;
      uint16_t BCLKSEL1:1;
    };
  };
} U3MODEHBITS;
extern volatile U3MODEHBITS U3MODEHbits __attribute__((__sfr__));

#define U3STA U3STA
extern volatile uint16_t  U3STA __attribute__((__sfr__));
typedef struct tagU3STABITS {
  uint16_t TXCIF:1;
  uint16_t OERR:1;
  uint16_t RXBKIF:1;
  uint16_t FERR:1;
  uint16_t CERIF:1;
  uint16_t ABDOVF:1;
  uint16_t PERR:1;
  uint16_t TRMT:1;
  uint16_t TXCIE:1;
  uint16_t OERIE:1;
  uint16_t RXBKIE:1;
  uint16_t FERIE:1;
  uint16_t CERIE:1;
  uint16_t ABDOVE:1;
  uint16_t PERIE:1;
  uint16_t TXMTIE:1;
} U3STABITS;
extern volatile U3STABITS U3STAbits __attribute__((__sfr__));

#define U3STAH U3STAH
extern volatile uint16_t  U3STAH __attribute__((__sfr__));
__extension__ typedef struct tagU3STAHBITS {
  union {
    struct {
      uint16_t URXBF:1;
      uint16_t URXBE:1;
      uint16_t XON:1;
      uint16_t RIDLE:1;
      uint16_t UTXBF:1;
      uint16_t UTXBE:1;
      uint16_t STPMD:1;
      uint16_t TXWRE:1;
      uint16_t URXISEL:3;
      uint16_t :1;
      uint16_t UTXISEL:3;
    };
    struct {
      uint16_t :8;
      uint16_t URXISEL0:1;
      uint16_t URXISEL1:1;
      uint16_t URXISEL2:1;
      uint16_t :1;
      uint16_t UTXISEL0:1;
      uint16_t UTXISEL1:1;
      uint16_t UTXISEL2:1;
    };
  };
} U3STAHBITS;
extern volatile U3STAHBITS U3STAHbits __attribute__((__sfr__));

#define U3BRG U3BRG
extern volatile uint16_t  U3BRG __attribute__((__sfr__));
__extension__ typedef struct tagU3BRGBITS {
  union {
    struct {
      uint16_t BRG:16;
    };
    struct {
      uint16_t BRG0:1;
      uint16_t BRG1:1;
      uint16_t BRG2:1;
      uint16_t BRG3:1;
      uint16_t BRG4:1;
      uint16_t BRG5:1;
      uint16_t BRG6:1;
      uint16_t BRG7:1;
      uint16_t BRG8:1;
      uint16_t BRG9:1;
      uint16_t BRG10:1;
      uint16_t BRG11:1;
      uint16_t BRG12:1;
      uint16_t BRG13:1;
      uint16_t BRG14:1;
      uint16_t BRG15:1;
    };
  };
} U3BRGBITS;
extern volatile U3BRGBITS U3BRGbits __attribute__((__sfr__));

#define U3BRGH U3BRGH
extern volatile uint16_t  U3BRGH __attribute__((__sfr__));
__extension__ typedef struct tagU3BRGHBITS {
  union {
    struct {
      uint16_t BRG:4;
    };
    struct {
      uint16_t BRG16:1;
      uint16_t BRG1:1;
      uint16_t BRG18:1;
      uint16_t BRG19:1;
    };
  };
} U3BRGHBITS;
extern volatile U3BRGHBITS U3BRGHbits __attribute__((__sfr__));

#define U3RXREG U3RXREG
extern volatile uint16_t  U3RXREG __attribute__((__sfr__));
__extension__ typedef struct tagU3RXREGBITS {
  union {
    struct {
      uint16_t RXREG:8;
    };
    struct {
      uint16_t RXREG0:1;
      uint16_t RXREG1:1;
      uint16_t RXREG2:1;
      uint16_t RXREG3:1;
      uint16_t RXREG4:1;
      uint16_t RXREG5:1;
      uint16_t RXREG6:1;
      uint16_t RXREG7:1;
    };
  };
} U3RXREGBITS;
extern volatile U3RXREGBITS U3RXREGbits __attribute__((__sfr__));

#define U3TXREG U3TXREG
extern volatile uint16_t  U3TXREG __attribute__((__sfr__));
__extension__ typedef struct tagU3TXREGBITS {
  union {
    struct {
      uint16_t TXREG:8;
      uint16_t :7;
      uint16_t LAST:1;
    };
    struct {
      uint16_t TXREG0:1;
      uint16_t TXREG1:1;
      uint16_t TXREG2:1;
      uint16_t TXREG3:1;
      uint16_t TXREG4:1;
      uint16_t TXREG5:1;
      uint16_t TXREG6:1;
      uint16_t TXREG7:1;
    };
  };
} U3TXREGBITS;
extern volatile U3TXREGBITS U3TXREGbits __attribute__((__sfr__));

#define U3P1 U3P1
extern volatile uint16_t  U3P1 __attribute__((__sfr__));
__extension__ typedef struct tagU3P1BITS {
  union {
    struct {
      uint16_t P1:9;
    };
    struct {
      uint16_t P10:1;
      uint16_t P11:1;
      uint16_t P12:1;
      uint16_t P13:1;
      uint16_t P14:1;
      uint16_t P15:1;
      uint16_t P16:1;
      uint16_t P17:1;
      uint16_t P18:1;
    };
  };
} U3P1BITS;
extern volatile U3P1BITS U3P1bits __attribute__((__sfr__));

#define U3P2 U3P2
extern volatile uint16_t  U3P2 __attribute__((__sfr__));
__extension__ typedef struct tagU3P2BITS {
  union {
    struct {
      uint16_t P2:9;
    };
    struct {
      uint16_t P20:1;
      uint16_t P21:1;
      uint16_t P22:1;
      uint16_t P23:1;
      uint16_t P24:1;
      uint16_t P25:1;
      uint16_t P26:1;
      uint16_t P27:1;
      uint16_t P28:1;
    };
  };
} U3P2BITS;
extern volatile U3P2BITS U3P2bits __attribute__((__sfr__));

#define U3P3 U3P3
extern volatile uint16_t  U3P3 __attribute__((__sfr__));
__extension__ typedef struct tagU3P3BITS {
  union {
    struct {
      uint16_t P3:16;
    };
    struct {
      uint16_t P30:1;
      uint16_t P31:1;
      uint16_t P32:1;
      uint16_t P33:1;
      uint16_t P34:1;
      uint16_t P35:1;
      uint16_t P36:1;
      uint16_t P37:1;
      uint16_t P38:1;
      uint16_t P39:1;
      uint16_t P310:1;
      uint16_t P311:1;
      uint16_t P312:1;
      uint16_t P313:1;
      uint16_t P314:1;
      uint16_t P315:1;
    };
  };
} U3P3BITS;
extern volatile U3P3BITS U3P3bits __attribute__((__sfr__));

#define U3P3H U3P3H
extern volatile uint16_t  U3P3H __attribute__((__sfr__));
__extension__ typedef struct tagU3P3HBITS {
  union {
    struct {
      uint16_t P3H:8;
    };
    struct {
      uint16_t P316:1;
      uint16_t P317:1;
      uint16_t P318:1;
      uint16_t P319:1;
      uint16_t P320:1;
      uint16_t P321:1;
      uint16_t P322:1;
      uint16_t P323:1;
    };
  };
} U3P3HBITS;
