gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
extern volatile U3P3HBITS U3P3Hbits __attribute__((__sfr__));

#define U3TXCHK U3TXCHK
extern volatile uint16_t  U3TXCHK __attribute__((__sfr__));
__extension__ typedef struct tagU3TXCHKBITS {
  union {
    struct {
      uint16_t TXCHK:8;
    };
    struct {
      uint16_t TXCHK0:1;
      uint16_t TXCHK1:1;
      uint16_t TXCHK2:1;
      uint16_t TXCHK3:1;
      uint16_t TXCHK4:1;
      uint16_t TXCHK5:1;
      uint16_t TXCHK6:1;
      uint16_t TXCHK7:1;
    };
  };
} U3TXCHKBITS;
extern volatile U3TXCHKBITS U3TXCHKbits __attribute__((__sfr__));

#define U3RXCHK U3RXCHK
extern volatile uint16_t  U3RXCHK __attribute__((__sfr__));
typedef struct tagU3RXCHKBITS {
  uint16_t RXCHK:8;
} U3RXCHKBITS;
extern volatile U3RXCHKBITS U3RXCHKbits __attribute__((__sfr__));

#define U3SCCON U3SCCON
extern volatile uint16_t  U3SCCON __attribute__((__sfr__));
__extension__ typedef struct tagU3SCCONBITS {
  union {
    struct {
      uint16_t :1;
      uint16_t PTRCL:1;
      uint16_t T0PD:1;
      uint16_t CONV:1;
      uint16_t TXRPT:2;
    };
    struct {
      uint16_t :4;
      uint16_t TXRPT0:1;
      uint16_t TXRPT1:1;
    };
  };
} U3SCCONBITS;
extern volatile U3SCCONBITS U3SCCONbits __attribute__((__sfr__));

#define U3SCINT U3SCINT
extern volatile uint16_t  U3SCINT __attribute__((__sfr__));
typedef struct tagU3SCINTBITS {
  uint16_t GTCIE:1;
  uint16_t WTCIE:1;
  uint16_t BTCIE:1;
  uint16_t :1;
  uint16_t TXRPTIE:1;
  uint16_t RXRPTIE:1;
  uint16_t :2;
  uint16_t GTCIF:1;
  uint16_t WTCIF:1;
  uint16_t BTCIF:1;
  uint16_t :1;
  uint16_t TXRPTIF:1;
  uint16_t RXRPTIF:1;
} U3SCINTBITS;
extern volatile U3SCINTBITS U3SCINTbits __attribute__((__sfr__));

#define U3INT U3INT
extern volatile uint16_t  U3INT __attribute__((__sfr__));
typedef struct tagU3INTBITS {
  uint16_t :2;
  uint16_t ABDIE:1;
  uint16_t :3;
  uint16_t ABDIF:1;
  uint16_t WUIF:1;
} U3INTBITS;
extern volatile U3INTBITS U3INTbits __attribute__((__sfr__));

#define I2C3CON1 I2C3CON1
extern volatile uint16_t  I2C3CON1 __attribute__((__sfr__));
typedef struct tagI2C3CON1BITS {
  uint16_t SEN:1;
  uint16_t RSEN:1;
  uint16_t PEN:1;
  uint16_t RCEN:1;
  uint16_t ACKEN:1;
  uint16_t ACKDT:1;
  uint16_t STREN:1;
  uint16_t GCEN:1;
  uint16_t SMEN:1;
  uint16_t DISSLW:1;
  uint16_t A10M:1;
  uint16_t STRICT:1;
  uint16_t SCLREL:1;
  uint16_t I2CSIDL:1;
  uint16_t :1;
  uint16_t I2CEN:1;
} I2C3CON1BITS;
extern volatile I2C3CON1BITS I2C3CON1bits __attribute__((__sfr__));

#define I2C3CONL I2C3CONL
extern volatile uint16_t  I2C3CONL __attribute__((__sfr__));
typedef struct tagI2C3CONLBITS {
  uint16_t SEN:1;
  uint16_t RSEN:1;
  uint16_t PEN:1;
  uint16_t RCEN:1;
  uint16_t ACKEN:1;
  uint16_t ACKDT:1;
  uint16_t STREN:1;
  uint16_t GCEN:1;
  uint16_t SMEN:1;
  uint16_t DISSLW:1;
  uint16_t A10M:1;
  uint16_t STRICT:1;
  uint16_t SCLREL:1;
  uint16_t I2CSIDL:1;
  uint16_t :1;
  uint16_t I2CEN:1;
} I2C3CONLBITS;
extern volatile I2C3CONLBITS I2C3CONLbits __attribute__((__sfr__));

#define I2C3CON2 I2C3CON2
extern volatile uint16_t  I2C3CON2 __attribute__((__sfr__));
typedef struct tagI2C3CON2BITS {
  uint16_t DHEN:1;
  uint16_t AHEN:1;
  uint16_t SBCDE:1;
  uint16_t SDAHT:1;
  uint16_t BOEN:1;
  uint16_t SCIE:1;
  uint16_t PCIE:1;
} I2C3CON2BITS;
extern volatile I2C3CON2BITS I2C3CON2bits __attribute__((__sfr__));

#define I2C3CONH I2C3CONH
extern volatile uint16_t  I2C3CONH __attribute__((__sfr__));
typedef struct tagI2C3CONHBITS {
  uint16_t DHEN:1;
  uint16_t AHEN:1;
  uint16_t SBCDE:1;
  uint16_t SDAHT:1;
  uint16_t BOEN:1;
  uint16_t SCIE:1;
  uint16_t PCIE:1;
} I2C3CONHBITS;
extern volatile I2C3CONHBITS I2C3CONHbits __attribute__((__sfr__));

#define I2C3STAT I2C3STAT
extern volatile uint16_t  I2C3STAT __attribute__((__sfr__));
typedef struct tagI2C3STATBITS {
  uint16_t TBF:1;
  uint16_t RBF:1;
  uint16_t R_W:1;
  uint16_t S:1;
  uint16_t P:1;
  uint16_t D_A:1;
  uint16_t I2COV:1;
  uint16_t IWCOL:1;
  uint16_t ADD10:1;
  uint16_t GCSTAT:1;
  uint16_t BCL:1;
  uint16_t :2;
  uint16_t ACKTIM:1;
  uint16_t TRSTAT:1;
  uint16_t ACKSTAT:1;
} I2C3STATBITS;
extern volatile I2C3STATBITS I2C3STATbits __attribute__((__sfr__));

#define I2C3ADD I2C3ADD
extern volatile uint16_t  I2C3ADD __attribute__((__sfr__));
typedef struct tagI2C3ADDBITS {
  uint16_t ADD:10;
} I2C3ADDBITS;
extern volatile I2C3ADDBITS I2C3ADDbits __attribute__((__sfr__));

#define I2C3MSK I2C3MSK
extern volatile uint16_t  I2C3MSK __attribute__((__sfr__));
__extension__ typedef struct tagI2C3MSKBITS {
  union {
    struct {
      uint16_t AMSK:10;
    };
    struct {
      uint16_t AMSK0:1;
      uint16_t AMSK1:1;
      uint16_t AMSK2:1;
      uint16_t AMSK3:1;
      uint16_t AMSK4:1;
      uint16_t AMSK5:1;
      uint16_t AMSK6:1;
      uint16_t AMSK7:1;
      uint16_t AMSK8:1;
      uint16_t AMSK9:1;
    };
  };
} I2C3MSKBITS;
extern volatile I2C3MSKBITS I2C3MSKbits __attribute__((__sfr__));

#define I2C3BRG I2C3BRG
extern volatile uint16_t  I2C3BRG __attribute__((__sfr__));
#define I2C3TRN I2C3TRN
extern volatile uint16_t  I2C3TRN __attribute__((__sfr__));
typedef struct tagI2C3TRNBITS {
  uint16_t I2CTXDATA:8;
} I2C3TRNBITS;
extern volatile I2C3TRNBITS I2C3TRNbits __attribute__((__sfr__));

#define I2C3RCV I2C3RCV
extern volatile uint16_t  I2C3RCV __attribute__((__sfr__));
typedef struct tagI2C3RCVBITS {
  uint16_t I2CRXDATA:8;
} I2C3RCVBITS;
extern volatile I2C3RCVBITS I2C3RCVbits __attribute__((__sfr__));

#define RCON RCON
extern volatile uint16_t  RCON __attribute__((__sfr__));
typedef struct tagRCONBITS {
  uint16_t POR:1;
  uint16_t BOR:1;
  uint16_t IDLE:1;
  uint16_t SLEEP:1;
  uint16_t WDTO:1;
  uint16_t :1;
  uint16_t SWR:1;
  uint16_t EXTR:1;
  uint16_t VREGS:1;
  uint16_t CM:1;
  uint16_t :4;
  uint16_t IOPUWR:1;
  uint16_t TRAPR:1;
} RCONBITS;
extern volatile RCONBITS RCONbits __attribute__((__sfr__));

#define OSCCON OSCCON
extern volatile uint16_t  OSCCON __attribute__((__sfr__));
__extension__ typedef struct tagOSCCONBITS {
  union {
    struct {
      uint16_t OSWEN:1;
      uint16_t :2;
      uint16_t CF:1;
      uint16_t :1;
      uint16_t LOCK:1;
      uint16_t :1;
      uint16_t CLKLOCK:1;
      uint16_t NOSC:3;
      uint16_t :1;
      uint16_t COSC:3;
    };
    struct {
      uint16_t :8;
      uint16_t NOSC0:1;
      uint16_t NOSC1:1;
      uint16_t NOSC2:1;
      uint16_t :1;
      uint16_t COSC0:1;
      uint16_t COSC1:1;
      uint16_t COSC2:1;
    };
  };
} OSCCONBITS;
extern volatile OSCCONBITS OSCCONbits __attribute__((__sfr__));

