gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
#define OSCCONL OSCCONL
extern volatile uint8_t OSCCONL __attribute__((__sfr__));
#define OSCCONH OSCCONH
extern volatile uint8_t OSCCONH __attribute__((__sfr__));
#define CLKDIV CLKDIV
extern volatile uint16_t  CLKDIV __attribute__((__sfr__));
__extension__ typedef struct tagCLKDIVBITS {
  union {
    struct {
      uint16_t PLLPRE:6;
      uint16_t :2;
      uint16_t FRCDIV:3;
      uint16_t DOZEN:1;
      uint16_t DOZE:3;
      uint16_t ROI:1;
    };
    struct {
      uint16_t PLLPRE0:1;
      uint16_t PLLPRE1:1;
      uint16_t PLLPRE2:1;
      uint16_t PLLPRE3:1;
      uint16_t PLLPRE4:1;
      uint16_t PLLPRE5:1;
      uint16_t :2;
      uint16_t FRCDIV0:1;
      uint16_t FRCDIV1:1;
      uint16_t FRCDIV2:1;
      uint16_t :1;
      uint16_t DOZE0:1;
      uint16_t DOZE1:1;
      uint16_t DOZE2:1;
    };
  };
} CLKDIVBITS;
extern volatile CLKDIVBITS CLKDIVbits __attribute__((__sfr__));

#define PLLFBD PLLFBD
extern volatile uint16_t  PLLFBD __attribute__((__sfr__));
__extension__ typedef struct tagPLLFBDBITS {
  union {
    struct {
      uint16_t PLLFBDIV:12;
    };
    struct {
      uint16_t PLLFBDIV0:1;
      uint16_t PLLFBDIV1:1;
      uint16_t PLLFBDIV2:1;
      uint16_t PLLFBDIV3:1;
      uint16_t PLLFBDIV4:1;
      uint16_t PLLFBDIV5:1;
      uint16_t PLLFBDIV6:1;
      uint16_t PLLFBDIV7:1;
      uint16_t PLLFBDIV8:1;
      uint16_t PLLFBDIV9:1;
      uint16_t PLLFBDIV10:1;
      uint16_t PLLFBDIV11:1;
    };
  };
} PLLFBDBITS;
extern volatile PLLFBDBITS PLLFBDbits __attribute__((__sfr__));

#define PLLDIV PLLDIV
extern volatile uint16_t  PLLDIV __attribute__((__sfr__));
__extension__ typedef struct tagPLLDIVBITS {
  union {
    struct {
      uint16_t POST2DIV:3;
      uint16_t :1;
      uint16_t POST1DIV:3;
      uint16_t :1;
      uint16_t VCODIV:2;
    };
    struct {
      uint16_t POST2DIV0:1;
      uint16_t POST2DIV1:1;
      uint16_t POST2DIV2:1;
      uint16_t :1;
      uint16_t POST1DIV0:1;
      uint16_t POST1DIV1:1;
      uint16_t POST1DIV2:1;
      uint16_t :1;
      uint16_t VCODIV0:1;
      uint16_t VCODIV1:1;
    };
  };
} PLLDIVBITS;
extern volatile PLLDIVBITS PLLDIVbits __attribute__((__sfr__));

#define OSCTUN OSCTUN
extern volatile uint16_t  OSCTUN __attribute__((__sfr__));
__extension__ typedef struct tagOSCTUNBITS {
  union {
    struct {
      uint16_t TUN:6;
    };
    struct {
      uint16_t TUN0:1;
      uint16_t TUN1:1;
      uint16_t TUN2:1;
      uint16_t TUN3:1;
      uint16_t TUN4:1;
      uint16_t TUN5:1;
    };
  };
} OSCTUNBITS;
extern volatile OSCTUNBITS OSCTUNbits __attribute__((__sfr__));

#define ACLKCON1 ACLKCON1
extern volatile uint16_t  ACLKCON1 __attribute__((__sfr__));
__extension__ typedef struct tagACLKCON1BITS {
  union {
    struct {
      uint16_t APLLPRE:6;
      uint16_t :2;
      uint16_t FRCSEL:1;
      uint16_t ASRCSEL:1;
      uint16_t :4;
      uint16_t APLLCK:1;
      uint16_t APLLEN:1;
    };
    struct {
      uint16_t APLLPRE0:1;
      uint16_t APLLPRE1:1;
      uint16_t APLLPRE2:1;
      uint16_t APLLPRE3:1;
      uint16_t APLLPRE4:1;
      uint16_t APLLPRE5:1;
    };
  };
} ACLKCON1BITS;
extern volatile ACLKCON1BITS ACLKCON1bits __attribute__((__sfr__));

#define APLLFBD1 APLLFBD1
extern volatile uint16_t  APLLFBD1 __attribute__((__sfr__));
__extension__ typedef struct tagAPLLFBD1BITS {
  union {
    struct {
      uint16_t APLLFBDIV:12;
    };
    struct {
      uint16_t APLLFBDIV0:1;
      uint16_t APLLFBDIV1:1;
      uint16_t APLLFBDIV2:1;
      uint16_t APLLFBDIV3:1;
      uint16_t APLLFBDIV4:1;
      uint16_t APLLFBDIV5:1;
      uint16_t APLLFBDIV6:1;
      uint16_t APLLFBDIV7:1;
      uint16_t APLLFBDIV8:1;
      uint16_t APLLFBDIV9:1;
      uint16_t APLLFBDIV10:1;
      uint16_t APLLFBDIV11:1;
    };
  };
} APLLFBD1BITS;
extern volatile APLLFBD1BITS APLLFBD1bits __attribute__((__sfr__));

#define APLLDIV1 APLLDIV1
extern volatile uint16_t  APLLDIV1 __attribute__((__sfr__));
__extension__ typedef struct tagAPLLDIV1BITS {
  union {
    struct {
      uint16_t APOST2DIV:3;
      uint16_t :1;
      uint16_t APOST1DIV:3;
      uint16_t :1;
      uint16_t AVCODIV:2;
    };
    struct {
      uint16_t APOST2DIV0:1;
      uint16_t APOST2DIV1:1;
      uint16_t APOST2DIV2:1;
      uint16_t :1;
      uint16_t APOST1DIV0:1;
      uint16_t APOST1DIV1:1;
      uint16_t APOST1DIV2:1;
      uint16_t :1;
      uint16_t AVCODIV0:1;
      uint16_t AVCODIV1:1;
    };
  };
} APLLDIV1BITS;
extern volatile APLLDIV1BITS APLLDIV1bits __attribute__((__sfr__));

#define CANCLKCON CANCLKCON
extern volatile uint16_t  CANCLKCON __attribute__((__sfr__));
__extension__ typedef struct tagCANCLKCONBITS {
  union {
    struct {
      uint16_t CANCLKDIV:7;
      uint16_t :1;
      uint16_t CANCLKSEL:4;
      uint16_t :3;
      uint16_t CANCLKEN:1;
    };
    struct {
      uint16_t CANCLKDIV0:1;
      uint16_t CANCLKDIV1:1;
      uint16_t CANCLKDIV2:1;
      uint16_t CANCLKDIV3:1;
      uint16_t CANCLKDIV4:1;
      uint16_t CANCLKDIV5:1;
      uint16_t CANCLKDIV6:1;
      uint16_t :1;
      uint16_t CANCLKSEL0:1;
      uint16_t CANCLKSEL1:1;
      uint16_t CANCLKSEL2:1;
      uint16_t CANCLKSEL3:1;
    };
  };
} CANCLKCONBITS;
extern volatile CANCLKCONBITS CANCLKCONbits __attribute__((__sfr__));

#define DCOTUN DCOTUN
extern volatile uint16_t  DCOTUN __attribute__((__sfr__));
typedef struct tagDCOTUNBITS {
  uint16_t TUN:6;
  uint16_t :2;
  uint16_t STORPOL:1;
  uint16_t STOR:1;
  uint16_t STPOL:1;
  uint16_t STLOCK:1;
  uint16_t STSRC:1;
  uint16_t STSIDL:1;
  uint16_t :1;
  uint16_t STON:1;
} DCOTUNBITS;
extern volatile DCOTUNBITS DCOTUNbits __attribute__((__sfr__));

#define DCOCON DCOCON
extern volatile uint16_t  DCOCON __attribute__((__sfr__));
typedef struct tagDCOCONBITS {
  uint16_t :8;
  uint16_t DCOFSEL:4;
  uint16_t :1;
  uint16_t DCOEN:1;
} DCOCONBITS;
extern volatile DCOCONBITS DCOCONbits __attribute__((__sfr__));

#define PMDCON PMDCON
extern volatile uint16_t  PMDCON __attribute__((__sfr__));
typedef struct tagPMDCONBITS {
  uint16_t :11;
  uint16_t PMDLOCK:1;
} PMDCONBITS;
extern volatile PMDCONBITS PMDCONbits __attribute__((__sfr__));

