gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
/* LOGCONA */
#define _PWMLFAD LOGCONAbits.PWMLFAD
#define _PWMLFA LOGCONAbits.PWMLFA
#define _S2APOL LOGCONAbits.S2APOL
#define _S1APOL LOGCONAbits.S1APOL
#define _PWMS2A LOGCONAbits.PWMS2A
#define _PWMS1A LOGCONAbits.PWMS1A

/* LOGCONB */
#define _PWMLFBD LOGCONBbits.PWMLFBD
#define _PWMLFB LOGCONBbits.PWMLFB
#define _S2BPOL LOGCONBbits.S2BPOL
#define _S1BPOL LOGCONBbits.S1BPOL
#define _PWMS2B LOGCONBbits.PWMS2B
#define _PWMS1B LOGCONBbits.PWMS1B

/* LOGCONC */
#define _PWMLFCD LOGCONCbits.PWMLFCD
#define _PWMLFC LOGCONCbits.PWMLFC
#define _S2CPOL LOGCONCbits.S2CPOL
#define _S1CPOL LOGCONCbits.S1CPOL
#define _PWMS2C LOGCONCbits.PWMS2C
#define _PWMS1C LOGCONCbits.PWMS1C

/* LOGCOND */
#define _PWMLFDD LOGCONDbits.PWMLFDD
#define _PWMLFD LOGCONDbits.PWMLFD
#define _S2DPOL LOGCONDbits.S2DPOL
#define _S1DPOL LOGCONDbits.S1DPOL
#define _PWMS2D LOGCONDbits.PWMS2D
#define _PWMS1D LOGCONDbits.PWMS1D

/* LOGCONE */
#define _PWMLFED LOGCONEbits.PWMLFED
#define _PWMLFE LOGCONEbits.PWMLFE
#define _S2EPOL LOGCONEbits.S2EPOL
#define _S1EPOL LOGCONEbits.S1EPOL
#define _PWMS2E LOGCONEbits.PWMS2E
#define _PWMS1E LOGCONEbits.PWMS1E

/* LOGCONF */
#define _PWMLFFD LOGCONFbits.PWMLFFD
#define _PWMLFF LOGCONFbits.PWMLFF
#define _S2FPOL LOGCONFbits.S2FPOL
#define _S1FPOL LOGCONFbits.S1FPOL
#define _PWMS2F LOGCONFbits.PWMS2F
#define _PWMS1F LOGCONFbits.PWMS1F

/* PWMEVTA */
#define _EVTAPGS PWMEVTAbits.EVTAPGS
#define _EVTASEL PWMEVTAbits.EVTASEL
#define _EVTASYNC PWMEVTAbits.EVTASYNC
#define _EVTASTRD PWMEVTAbits.EVTASTRD
#define _EVTAPOL PWMEVTAbits.EVTAPOL
#define _EVTAOEN PWMEVTAbits.EVTAOEN

/* PWMEVTB */
#define _EVTBPGS PWMEVTBbits.EVTBPGS
#define _EVTBSEL PWMEVTBbits.EVTBSEL
#define _EVTBSYNC PWMEVTBbits.EVTBSYNC
#define _EVTBSTRD PWMEVTBbits.EVTBSTRD
#define _EVTBPOL PWMEVTBbits.EVTBPOL
#define _EVTBOEN PWMEVTBbits.EVTBOEN

/* PWMEVTC */
#define _EVTCPGS PWMEVTCbits.EVTCPGS
#define _EVTCSEL PWMEVTCbits.EVTCSEL
#define _EVTCSYNC PWMEVTCbits.EVTCSYNC
#define _EVTCSTRD PWMEVTCbits.EVTCSTRD
#define _EVTCPOL PWMEVTCbits.EVTCPOL
#define _EVTCOEN PWMEVTCbits.EVTCOEN

/* PWMEVTD */
#define _EVTDPGS PWMEVTDbits.EVTDPGS
#define _EVTDSEL PWMEVTDbits.EVTDSEL
#define _EVTDSYNC PWMEVTDbits.EVTDSYNC
#define _EVTDSTRD PWMEVTDbits.EVTDSTRD
#define _EVTDPOL PWMEVTDbits.EVTDPOL
#define _EVTDOEN PWMEVTDbits.EVTDOEN

/* PWMEVTE */
#define _EVTEPGS PWMEVTEbits.EVTEPGS
#define _EVTESEL PWMEVTEbits.EVTESEL
#define _EVTESYNC PWMEVTEbits.EVTESYNC
#define _EVTESTRD PWMEVTEbits.EVTESTRD
#define _EVTEPOL PWMEVTEbits.EVTEPOL
#define _EVTEOEN PWMEVTEbits.EVTEOEN

/* PWMEVTF */
#define _EVTFPGS PWMEVTFbits.EVTFPGS
#define _EVTFSEL PWMEVTFbits.EVTFSEL
#define _EVTFSYNC PWMEVTFbits.EVTFSYNC
#define _EVTFSTRD PWMEVTFbits.EVTFSTRD
#define _EVTFPOL PWMEVTFbits.EVTFPOL
#define _EVTFOEN PWMEVTFbits.EVTFOEN

/* PG1CONL */
/* Bitname _MODSEL cannot be defined because it is used by more than one SFR */
/* Bitname _CLKSEL cannot be defined because it is used by more than one SFR */
/* Bitname _HREN cannot be defined because it is used by more than one SFR */
/* Bitname _TRGCNT cannot be defined because it is used by more than one SFR */
/* Bitname _ON cannot be defined because it is used by more than one SFR */

/* PG1CONH */
/* Bitname _SOCS cannot be defined because it is used by more than one SFR */
/* Bitname _TRGMOD cannot be defined because it is used by more than one SFR */
/* Bitname _UPDMOD cannot be defined because it is used by more than one SFR */
/* Bitname _MSTEN cannot be defined because it is used by more than one SFR */
/* Bitname _MPHSEL cannot be defined because it is used by more than one SFR */
/* Bitname _MPERSEL cannot be defined because it is used by more than one SFR */
/* Bitname _MDCSEL cannot be defined because it is used by more than one SFR */

/* PG1STAT */
/* Bitname _TRIG cannot be defined because it is used by more than one SFR */
/* Bitname _CAHALF cannot be defined because it is used by more than one SFR */
/* Bitname _STEER cannot be defined because it is used by more than one SFR */
/* Bitname _UPDREQ cannot be defined because it is used by more than one SFR */
/* Bitname _UPDATE cannot be defined because it is used by more than one SFR */
/* Bitname _CAP cannot be defined because it is used by more than one SFR */
/* Bitname _TRCLR cannot be defined because it is used by more than one SFR */
/* Bitname _TRSET cannot be defined because it is used by more than one SFR */
/* Bitname _FFACT cannot be defined because it is used by more than one SFR */
/* Bitname _CLACT cannot be defined because it is used by more than one SFR */
/* Bitname _FLTACT cannot be defined because it is used by more than one SFR */
/* Bitname _SACT cannot be defined because it is used by more than one SFR */
/* Bitname _FFEVT cannot be defined because it is used by more than one SFR */
/* Bitname _CLEVT cannot be defined because it is used by more than one SFR */
/* Bitname _FLTEVT cannot be defined because it is used by more than one SFR */
/* Bitname _SEVT cannot be defined because it is used by more than one SFR */

/* PG1IOCONL */
/* Bitname _DBDAT cannot be defined because it is used by more than one SFR */
/* Bitname _FFDAT cannot be defined because it is used by more than one SFR */
/* Bitname _CLDAT cannot be defined because it is used by more than one SFR */
/* Bitname _FLTDAT cannot be defined because it is used by more than one SFR */
/* Bitname _OSYNC cannot be defined because it is used by more than one SFR */
/* Bitname _OVRDAT cannot be defined because it is used by more than one SFR */
/* Bitname _OVRENL cannot be defined because it is used by more than one SFR */
/* Bitname _OVRENH cannot be defined because it is used by more than one SFR */
/* Bitname _SWAP cannot be defined because it is used by more than one SFR */
/* Bitname _CLMOD cannot be defined because it is used by more than one SFR */

/* PG1IOCONH */
/* Bitname _POLL cannot be defined because it is used by more than one SFR */
/* Bitname _POLH cannot be defined because it is used by more than one SFR */
/* Bitname _PENL cannot be defined because it is used by more than one SFR */
/* Bitname _PENH cannot be defined because it is used by more than one SFR */
/* Bitname _PMOD cannot be defined because it is used by more than one SFR */
/* Bitname _DTCMPSEL cannot be defined because it is used by more than one SFR */
/* Bitname _CAPSRC cannot be defined because it is used by more than one SFR */

/* PG1EVTL */
/* Bitname _PGTRGSEL cannot be defined because it is used by more than one SFR */
/* Bitname _UPDTRG cannot be defined because it is used by more than one SFR */
/* Bitname _ADTR1EN1 cannot be defined because it is used by more than one SFR */
/* Bitname _ADTR1EN2 cannot be defined because it is used by more than one SFR */
/* Bitname _ADTR1EN3 cannot be defined because it is used by more than one SFR */
/* Bitname _ADTR1PS cannot be defined because it is used by more than one SFR */

/* PG1EVTH */
/* Bitname _ADTR1OFS cannot be defined because it is used by more than one SFR */
/* Bitname _ADTR2EN1 cannot be defined because it is used by more than one SFR */
/* Bitname _ADTR2EN2 cannot be defined because it is used by more than one SFR */
/* Bitname _ADTR2EN3 cannot be defined because it is used by more than one SFR */
/* Bitname _IEVTSEL cannot be defined because it is used by more than one SFR */
/* Bitname _SIEN cannot be defined because it is used by more than one SFR */
/* Bitname _FFIEN cannot be defined because it is used by more than one SFR */
/* Bitname _CLIEN cannot be defined because it is used by more than one SFR */
/* Bitname _FLTIEN cannot be defined because it is used by more than one SFR */

/* PG1FPCIL */
/* Bitname _PSS cannot be defined because it is used by more than one SFR */
/* Bitname _PPS cannot be defined because it is used by more than one SFR */
/* Bitname _PSYNC cannot be defined because it is used by more than one SFR */
/* Bitname _SWTERM cannot be defined because it is used by more than one SFR */
/* Bitname _AQSS cannot be defined because it is used by more than one SFR */
/* Bitname _AQPS cannot be defined because it is used by more than one SFR */
/* Bitname _TERM cannot be defined because it is used by more than one SFR */
/* Bitname _TSYNCDIS cannot be defined because it is used by more than one SFR */

/* PG1FPCIH */
/* Bitname _TQSS cannot be defined because it is used by more than one SFR */
/* Bitname _TQPS cannot be defined because it is used by more than one SFR */
/* Bitname _LATMOD cannot be defined because it is used by more than one SFR */
/* Bitname _SWPCIM cannot be defined because it is used by more than one SFR */
/* Bitname _SWPCI cannot be defined because it is used by more than one SFR */
/* Bitname _ACP cannot be defined because it is used by more than one SFR */
/* Bitname _BPSEL cannot be defined because it is used by more than one SFR */
/* Bitname _BPEN cannot be defined because it is used by more than one SFR */
/* Bitname _PCIGT cannot be defined because it is used by more than one SFR */

/* PG1CLPCIL */
/* Bitname _PSS cannot be defined because it is used by more than one SFR */
/* Bitname _PPS cannot be defined because it is used by more than one SFR */
/* Bitname _PSYNC cannot be defined because it is used by more than one SFR */
/* Bitname _SWTERM cannot be defined because it is used by more than one SFR */
/* Bitname _AQSS cannot be defined because it is used by more than one SFR */
/* Bitname _AQPS cannot be defined because it is used by more than one SFR */
/* Bitname _TERM cannot be defined because it is used by more than one SFR */
/* Bitname _TSYNCDIS cannot be defined because it is used by more than one SFR */

/* PG1CLPCIH */
/* Bitname _TQSS cannot be defined because it is used by more than one SFR */
/* Bitname _TQPS cannot be defined because it is used by more than one SFR */
/* Bitname _LATMOD cannot be defined because it is used by more than one SFR */
/* Bitname _SWPCIM cannot be defined because it is used by more than one SFR */
/* Bitname _SWPCI cannot be defined because it is used by more than one SFR */
/* Bitname _ACP cannot be defined because it is used by more than one SFR */
/* Bitname _BPSEL cannot be defined because it is used by more than one SFR */
/* Bitname _BPEN cannot be defined because it is used by more than one SFR */
/* Bitname _PCIGT cannot be defined because it is used by more than one SFR */

/* PG1FFPCIL */
/* Bitname _PSS cannot be defined because it is used by more than one SFR */
/* Bitname _PPS cannot be defined because it is used by more than one SFR */
/* Bitname _PSYNC cannot be defined because it is used by more than one SFR */
/* Bitname _SWTERM cannot be defined because it is used by more than one SFR */
/* Bitname _AQSS cannot be defined because it is used by more than one SFR */
/* Bitname _AQPS cannot be defined because it is used by more than one SFR */
/* Bitname _TERM cannot be defined because it is used by more than one SFR */
/* Bitname _TSYNCDIS cannot be defined because it is used by more than one SFR */

/* PG1FFPCIH */
/* Bitname _TQSS cannot be defined because it is used by more than one SFR */
/* Bitname _TQPS cannot be defined because it is used by more than one SFR */
/* Bitname _LATMOD cannot be defined because it is used by more than one SFR */
/* Bitname _SWPCIM cannot be defined because it is used by more than one SFR */
/* Bitname _SWPCI cannot be defined because it is used by more than one SFR */
/* Bitname _ACP cannot be defined because it is used by more than one SFR */
/* Bitname _BPSEL cannot be defined because it is used by more than one SFR */
/* Bitname _BPEN cannot be defined because it is used by more than one SFR */
/* Bitname _PCIGT cannot be defined because it is used by more than one SFR */

/* PG1SPCIL */
/* Bitname _PSS cannot be defined because it is used by more than one SFR */
/* Bitname _PPS cannot be defined because it is used by more than one SFR */
/* Bitname _PSYNC cannot be defined because it is used by more than one SFR */
/* Bitname _SWTERM cannot be defined because it is used by more than one SFR */
/* Bitname _AQSS cannot be defined because it is used by more than one SFR */
/* Bitname _AQPS cannot be defined because it is used by more than one SFR */
/* Bitname _TERM cannot be defined because it is used by more than one SFR */
/* Bitname _TSYNCDIS cannot be defined because it is used by more than one SFR */

/* PG1SPCIH */
/* Bitname _TQSS cannot be defined because it is used by more than one SFR */
/* Bitname _TQPS cannot be defined because it is used by more than one SFR */
/* Bitname _LATMOD cannot be defined because it is used by more than one SFR */
/* Bitname _SWPCIM cannot be defined because it is used by more than one SFR */
/* Bitname _SWPCI cannot be defined because it is used by more than one SFR */
/* Bitname _ACP cannot be defined because it is used by more than one SFR */
/* Bitname _BPSEL cannot be defined because it is used by more than one SFR */
/* Bitname _BPEN cannot be defined because it is used by more than one SFR */
/* Bitname _PCIGT cannot be defined because it is used by more than one SFR */

/* PG1LEBH */
/* Bitname _PLF cannot be defined because it is used by more than one SFR */
/* Bitname _PLR cannot be defined because it is used by more than one SFR */
/* Bitname _PHF cannot be defined because it is used by more than one SFR */
/* Bitname _PHR cannot be defined because it is used by more than one SFR */
/* Bitname _PWMPCI cannot be defined because it is used by more than one SFR */

/* PG1DCA */
/* Bitname _DCA cannot be defined because it is used by more than one SFR */

