gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
/* PG8FFPCIL */
/* Bitname _PSS cannot be defined because it is used by more than one SFR */
/* Bitname _PPS cannot be defined because it is used by more than one SFR */
/* Bitname _PSYNC cannot be defined because it is used by more than one SFR */
/* Bitname _SWTERM cannot be defined because it is used by more than one SFR */
/* Bitname _AQSS cannot be defined because it is used by more than one SFR */
/* Bitname _AQPS cannot be defined because it is used by more than one SFR */
/* Bitname _TERM cannot be defined because it is used by more than one SFR */
/* Bitname _TSYNCDIS cannot be defined because it is used by more than one SFR */

/* PG8FFPCIH */
/* Bitname _TQSS cannot be defined because it is used by more than one SFR */
/* Bitname _TQPS cannot be defined because it is used by more than one SFR */
/* Bitname _LATMOD cannot be defined because it is used by more than one SFR */
/* Bitname _SWPCIM cannot be defined because it is used by more than one SFR */
/* Bitname _SWPCI cannot be defined because it is used by more than one SFR */
/* Bitname _ACP cannot be defined because it is used by more than one SFR */
/* Bitname _BPSEL cannot be defined because it is used by more than one SFR */
/* Bitname _BPEN cannot be defined because it is used by more than one SFR */
/* Bitname _PCIGT cannot be defined because it is used by more than one SFR */

/* PG8SPCIL */
/* Bitname _PSS cannot be defined because it is used by more than one SFR */
/* Bitname _PPS cannot be defined because it is used by more than one SFR */
/* Bitname _PSYNC cannot be defined because it is used by more than one SFR */
/* Bitname _SWTERM cannot be defined because it is used by more than one SFR */
/* Bitname _AQSS cannot be defined because it is used by more than one SFR */
/* Bitname _AQPS cannot be defined because it is used by more than one SFR */
/* Bitname _TERM cannot be defined because it is used by more than one SFR */
/* Bitname _TSYNCDIS cannot be defined because it is used by more than one SFR */

/* PG8SPCIH */
/* Bitname _TQSS cannot be defined because it is used by more than one SFR */
/* Bitname _TQPS cannot be defined because it is used by more than one SFR */
/* Bitname _LATMOD cannot be defined because it is used by more than one SFR */
/* Bitname _SWPCIM cannot be defined because it is used by more than one SFR */
/* Bitname _SWPCI cannot be defined because it is used by more than one SFR */
/* Bitname _ACP cannot be defined because it is used by more than one SFR */
/* Bitname _BPSEL cannot be defined because it is used by more than one SFR */
/* Bitname _BPEN cannot be defined because it is used by more than one SFR */
/* Bitname _PCIGT cannot be defined because it is used by more than one SFR */

/* PG8LEBH */
/* Bitname _PLF cannot be defined because it is used by more than one SFR */
/* Bitname _PLR cannot be defined because it is used by more than one SFR */
/* Bitname _PHF cannot be defined because it is used by more than one SFR */
/* Bitname _PHR cannot be defined because it is used by more than one SFR */
/* Bitname _PWMPCI cannot be defined because it is used by more than one SFR */

/* PG8DCA */
/* Bitname _DCA cannot be defined because it is used by more than one SFR */

/* PG8DTL */
/* Bitname _DTL cannot be defined because it is used by more than one SFR */

/* PG8DTH */
/* Bitname _DTH cannot be defined because it is used by more than one SFR */

/* C1CONL */
#define _DNCNT C1CONLbits.DNCNT
#define _ISOCRCEN C1CONLbits.ISOCRCEN
#define _PXEDIS C1CONLbits.PXEDIS
/* Bitname _CLKSEL cannot be defined because it is used by more than one SFR */
#define _WAKFIL C1CONLbits.WAKFIL
#define _WFT C1CONLbits.WFT
#define _BUSY C1CONLbits.BUSY
#define _BRSDIS C1CONLbits.BRSDIS
#define _SIDL C1CONLbits.SIDL
#define _CON C1CONLbits.CON
#define _DNCNT0 C1CONLbits.DNCNT0
#define _DNCNT1 C1CONLbits.DNCNT1
#define _DNCNT2 C1CONLbits.DNCNT2
#define _DNCNT3 C1CONLbits.DNCNT3
#define _DNCNT4 C1CONLbits.DNCNT4
#define _WFT0 C1CONLbits.WFT0
#define _WFT1 C1CONLbits.WFT1

/* C1CONH */
#define _RTXAT C1CONHbits.RTXAT
#define _ESIGM C1CONHbits.ESIGM
#define _SERRLOM C1CONHbits.SERRLOM
#define _STEF C1CONHbits.STEF
#define _TXQEN C1CONHbits.TXQEN
#define _OPMOD C1CONHbits.OPMOD
#define _REQOP C1CONHbits.REQOP
#define _ABAT C1CONHbits.ABAT
#define _TXBWS C1CONHbits.TXBWS
#define _OPMOD0 C1CONHbits.OPMOD0
#define _OPMOD1 C1CONHbits.OPMOD1
#define _OPMOD2 C1CONHbits.OPMOD2
#define _REQOP0 C1CONHbits.REQOP0
#define _REQOP1 C1CONHbits.REQOP1
#define _REQOP2 C1CONHbits.REQOP2
#define _TXBWS0 C1CONHbits.TXBWS0
#define _TXBWS1 C1CONHbits.TXBWS1
#define _TXBWS2 C1CONHbits.TXBWS2
#define _TXBWS3 C1CONHbits.TXBWS3

/* C1NBTCFGL */
/* Bitname _SJW cannot be defined because it is used by more than one SFR */
/* Bitname _TSEG2 cannot be defined because it is used by more than one SFR */
/* Bitname _SJW0 cannot be defined because it is used by more than one SFR */
/* Bitname _SJW1 cannot be defined because it is used by more than one SFR */
/* Bitname _SJW2 cannot be defined because it is used by more than one SFR */
/* Bitname _SJW3 cannot be defined because it is used by more than one SFR */
#define _SJW4 C1NBTCFGLbits.SJW4
#define _SJW5 C1NBTCFGLbits.SJW5
#define _SJW6 C1NBTCFGLbits.SJW6
/* Bitname _TSEG20 cannot be defined because it is used by more than one SFR */
/* Bitname _TSEG21 cannot be defined because it is used by more than one SFR */
/* Bitname _TSEG22 cannot be defined because it is used by more than one SFR */
/* Bitname _TSEG23 cannot be defined because it is used by more than one SFR */
#define _TSEG24 C1NBTCFGLbits.TSEG24
#define _TSEG25 C1NBTCFGLbits.TSEG25
#define _TSEG26 C1NBTCFGLbits.TSEG26

/* C1NBTCFGH */
/* Bitname _TSEG1 cannot be defined because it is used by more than one SFR */
/* Bitname _BRP cannot be defined because it is used by more than one SFR */
/* Bitname _TSEG10 cannot be defined because it is used by more than one SFR */
/* Bitname _TSEG11 cannot be defined because it is used by more than one SFR */
/* Bitname _TSEG12 cannot be defined because it is used by more than one SFR */
/* Bitname _TSEG13 cannot be defined because it is used by more than one SFR */
/* Bitname _TSEG14 cannot be defined because it is used by more than one SFR */
#define _TSEG15 C1NBTCFGHbits.TSEG15
#define _TSEG16 C1NBTCFGHbits.TSEG16
#define _TSEG17 C1NBTCFGHbits.TSEG17
/* Bitname _BRP0 cannot be defined because it is used by more than one SFR */
/* Bitname _BRP1 cannot be defined because it is used by more than one SFR */
/* Bitname _BRP2 cannot be defined because it is used by more than one SFR */
/* Bitname _BRP3 cannot be defined because it is used by more than one SFR */
/* Bitname _BRP4 cannot be defined because it is used by more than one SFR */
/* Bitname _BRP5 cannot be defined because it is used by more than one SFR */
/* Bitname _BRP6 cannot be defined because it is used by more than one SFR */
/* Bitname _BRP7 cannot be defined because it is used by more than one SFR */

/* C1DBTCFGL */
/* Bitname _SJW cannot be defined because it is used by more than one SFR */
/* Bitname _TSEG2 cannot be defined because it is used by more than one SFR */
/* Bitname _SJW0 cannot be defined because it is used by more than one SFR */
/* Bitname _SJW1 cannot be defined because it is used by more than one SFR */
/* Bitname _SJW2 cannot be defined because it is used by more than one SFR */
/* Bitname _SJW3 cannot be defined because it is used by more than one SFR */
/* Bitname _TSEG20 cannot be defined because it is used by more than one SFR */
/* Bitname _TSEG21 cannot be defined because it is used by more than one SFR */
/* Bitname _TSEG22 cannot be defined because it is used by more than one SFR */
/* Bitname _TSEG23 cannot be defined because it is used by more than one SFR */

/* C1DBTCFGH */
/* Bitname _TSEG1 cannot be defined because it is used by more than one SFR */
/* Bitname _BRP cannot be defined because it is used by more than one SFR */
/* Bitname _TSEG10 cannot be defined because it is used by more than one SFR */
/* Bitname _TSEG11 cannot be defined because it is used by more than one SFR */
/* Bitname _TSEG12 cannot be defined because it is used by more than one SFR */
/* Bitname _TSEG13 cannot be defined because it is used by more than one SFR */
/* Bitname _TSEG14 cannot be defined because it is used by more than one SFR */
/* Bitname _BRP0 cannot be defined because it is used by more than one SFR */
/* Bitname _BRP1 cannot be defined because it is used by more than one SFR */
/* Bitname _BRP2 cannot be defined because it is used by more than one SFR */
/* Bitname _BRP3 cannot be defined because it is used by more than one SFR */
/* Bitname _BRP4 cannot be defined because it is used by more than one SFR */
/* Bitname _BRP5 cannot be defined because it is used by more than one SFR */
/* Bitname _BRP6 cannot be defined because it is used by more than one SFR */
/* Bitname _BRP7 cannot be defined because it is used by more than one SFR */

/* C1TDCL */
#define _TDCV C1TDCLbits.TDCV
#define _TDCO C1TDCLbits.TDCO
#define _TDCV0 C1TDCLbits.TDCV0
#define _TDCV1 C1TDCLbits.TDCV1
#define _TDCV2 C1TDCLbits.TDCV2
#define _TDCV3 C1TDCLbits.TDCV3
#define _TDCV4 C1TDCLbits.TDCV4
#define _TDCV5 C1TDCLbits.TDCV5
#define _TDCO0 C1TDCLbits.TDCO0
#define _TDCO1 C1TDCLbits.TDCO1
#define _TDCO2 C1TDCLbits.TDCO2
#define _TDCO3 C1TDCLbits.TDCO3
#define _TDCO4 C1TDCLbits.TDCO4
#define _TDCO5 C1TDCLbits.TDCO5
#define _TDCO6 C1TDCLbits.TDCO6

