gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
/* C1TEFCONH */
/* Bitname _FSIZE cannot be defined because it is used by more than one SFR */
/* Bitname _FSIZE0 cannot be defined because it is used by more than one SFR */
/* Bitname _FSIZE1 cannot be defined because it is used by more than one SFR */
/* Bitname _FSIZE2 cannot be defined because it is used by more than one SFR */
/* Bitname _FSIZE3 cannot be defined because it is used by more than one SFR */
/* Bitname _FSIZE4 cannot be defined because it is used by more than one SFR */

/* C1TEFSTA */
#define _TEFNEIF C1TEFSTAbits.TEFNEIF
#define _TEFHIF C1TEFSTAbits.TEFHIF
#define _TEFFIF C1TEFSTAbits.TEFFIF
#define _TEFOVIF C1TEFSTAbits.TEFOVIF

/* C1TEFUAL */
/* Bitname _TEFUA cannot be defined because it is used by more than one SFR */
#define _TEFUA0 C1TEFUALbits.TEFUA0
#define _TEFUA1 C1TEFUALbits.TEFUA1
#define _TEFUA2 C1TEFUALbits.TEFUA2
#define _TEFUA3 C1TEFUALbits.TEFUA3
#define _TEFUA4 C1TEFUALbits.TEFUA4
#define _TEFUA5 C1TEFUALbits.TEFUA5
#define _TEFUA6 C1TEFUALbits.TEFUA6
#define _TEFUA7 C1TEFUALbits.TEFUA7
#define _TEFUA8 C1TEFUALbits.TEFUA8
#define _TEFUA9 C1TEFUALbits.TEFUA9
#define _TEFUA10 C1TEFUALbits.TEFUA10
#define _TEFUA11 C1TEFUALbits.TEFUA11
#define _TEFUA12 C1TEFUALbits.TEFUA12
#define _TEFUA13 C1TEFUALbits.TEFUA13
#define _TEFUA14 C1TEFUALbits.TEFUA14
#define _TEFUA15 C1TEFUALbits.TEFUA15

/* C1TEFUAH */
/* Bitname _TEFUA cannot be defined because it is used by more than one SFR */
#define _TEFUA16 C1TEFUAHbits.TEFUA16
#define _TEFUA17 C1TEFUAHbits.TEFUA17
#define _TEFUA18 C1TEFUAHbits.TEFUA18
#define _TEFUA19 C1TEFUAHbits.TEFUA19
#define _TEFUA20 C1TEFUAHbits.TEFUA20
#define _TEFUA21 C1TEFUAHbits.TEFUA21
#define _TEFUA22 C1TEFUAHbits.TEFUA22
#define _TEFUA23 C1TEFUAHbits.TEFUA23
#define _TEFUA24 C1TEFUAHbits.TEFUA24
#define _TEFUA25 C1TEFUAHbits.TEFUA25
#define _TEFUA26 C1TEFUAHbits.TEFUA26
#define _TEFUA27 C1TEFUAHbits.TEFUA27
#define _TEFUA28 C1TEFUAHbits.TEFUA28
#define _TEFUA29 C1TEFUAHbits.TEFUA29
#define _TEFUA30 C1TEFUAHbits.TEFUA30
#define _TEFUA31 C1TEFUAHbits.TEFUA31

/* C1FIFOBAL */
/* Bitname _FIFOBA cannot be defined because it is used by more than one SFR */
#define _FIFOBA0 C1FIFOBALbits.FIFOBA0
#define _FIFOBA1 C1FIFOBALbits.FIFOBA1
#define _FIFOBA2 C1FIFOBALbits.FIFOBA2
#define _FIFOBA3 C1FIFOBALbits.FIFOBA3
#define _FIFOBA4 C1FIFOBALbits.FIFOBA4
#define _FIFOBA5 C1FIFOBALbits.FIFOBA5
#define _FIFOBA6 C1FIFOBALbits.FIFOBA6
#define _FIFOBA7 C1FIFOBALbits.FIFOBA7
#define _FIFOBA8 C1FIFOBALbits.FIFOBA8
#define _FIFOBA9 C1FIFOBALbits.FIFOBA9
#define _FIFOBA10 C1FIFOBALbits.FIFOBA10
#define _FIFOBA11 C1FIFOBALbits.FIFOBA11
#define _FIFOBA12 C1FIFOBALbits.FIFOBA12
#define _FIFOBA13 C1FIFOBALbits.FIFOBA13
#define _FIFOBA14 C1FIFOBALbits.FIFOBA14
#define _FIFOBA15 C1FIFOBALbits.FIFOBA15

/* C1FIFOBAH */
/* Bitname _FIFOBA cannot be defined because it is used by more than one SFR */
#define _FIFOBA16 C1FIFOBAHbits.FIFOBA16
#define _FIFOBA17 C1FIFOBAHbits.FIFOBA17
#define _FIFOBA18 C1FIFOBAHbits.FIFOBA18
#define _FIFOBA19 C1FIFOBAHbits.FIFOBA19
#define _FIFOBA20 C1FIFOBAHbits.FIFOBA20
#define _FIFOBA21 C1FIFOBAHbits.FIFOBA21
#define _FIFOBA22 C1FIFOBAHbits.FIFOBA22
#define _FIFOBA23 C1FIFOBAHbits.FIFOBA23
#define _FIFOBA24 C1FIFOBAHbits.FIFOBA24
#define _FIFOBA25 C1FIFOBAHbits.FIFOBA25
#define _FIFOBA26 C1FIFOBAHbits.FIFOBA26
#define _FIFOBA27 C1FIFOBAHbits.FIFOBA27
#define _FIFOBA28 C1FIFOBAHbits.FIFOBA28
#define _FIFOBA29 C1FIFOBAHbits.FIFOBA29
#define _FIFOBA30 C1FIFOBAHbits.FIFOBA30
#define _FIFOBA31 C1FIFOBAHbits.FIFOBA31

/* C1TXQCONL */
#define _TXQNIE C1TXQCONLbits.TXQNIE
#define _TXQEIE C1TXQCONLbits.TXQEIE
/* Bitname _TXATIE cannot be defined because it is used by more than one SFR */
/* Bitname _TXEN cannot be defined because it is used by more than one SFR */
/* Bitname _UINC cannot be defined because it is used by more than one SFR */
/* Bitname _TXREQ cannot be defined because it is used by more than one SFR */
/* Bitname _FRESET cannot be defined because it is used by more than one SFR */

/* C1TXQCONH */
/* Bitname _TXPRI cannot be defined because it is used by more than one SFR */
/* Bitname _TXAT cannot be defined because it is used by more than one SFR */
/* Bitname _FSIZE cannot be defined because it is used by more than one SFR */
/* Bitname _PLSIZE cannot be defined because it is used by more than one SFR */
/* Bitname _TXPRI0 cannot be defined because it is used by more than one SFR */
/* Bitname _TXPRI1 cannot be defined because it is used by more than one SFR */
/* Bitname _TXPRI2 cannot be defined because it is used by more than one SFR */
/* Bitname _TXPRI3 cannot be defined because it is used by more than one SFR */
/* Bitname _TXPRI4 cannot be defined because it is used by more than one SFR */
/* Bitname _TXAT0 cannot be defined because it is used by more than one SFR */
/* Bitname _TXAT1 cannot be defined because it is used by more than one SFR */
/* Bitname _FSIZE0 cannot be defined because it is used by more than one SFR */
/* Bitname _FSIZE1 cannot be defined because it is used by more than one SFR */
/* Bitname _FSIZE2 cannot be defined because it is used by more than one SFR */
/* Bitname _FSIZE3 cannot be defined because it is used by more than one SFR */
/* Bitname _FSIZE4 cannot be defined because it is used by more than one SFR */
/* Bitname _PLSIZE0 cannot be defined because it is used by more than one SFR */
/* Bitname _PLSIZE1 cannot be defined because it is used by more than one SFR */
/* Bitname _PLSIZE2 cannot be defined because it is used by more than one SFR */

/* C1TXQSTA */
#define _TXQNIF C1TXQSTAbits.TXQNIF
#define _TXQEIF C1TXQSTAbits.TXQEIF
/* Bitname _TXATIF cannot be defined because it is used by more than one SFR */
/* Bitname _TXERR cannot be defined because it is used by more than one SFR */
/* Bitname _TXLARB cannot be defined because it is used by more than one SFR */
/* Bitname _TXABT cannot be defined because it is used by more than one SFR */
#define _TXQCI C1TXQSTAbits.TXQCI
#define _TXQCI0 C1TXQSTAbits.TXQCI0
#define _TXQCI1 C1TXQSTAbits.TXQCI1
#define _TXQCI2 C1TXQSTAbits.TXQCI2
#define _TXQCI3 C1TXQSTAbits.TXQCI3
#define _TXQCI4 C1TXQSTAbits.TXQCI4

/* C1TXQUAL */
/* Bitname _TXQUA cannot be defined because it is used by more than one SFR */
#define _TXQUA0 C1TXQUALbits.TXQUA0
#define _TXQUA1 C1TXQUALbits.TXQUA1
#define _TXQUA2 C1TXQUALbits.TXQUA2
#define _TXQUA3 C1TXQUALbits.TXQUA3
#define _TXQUA4 C1TXQUALbits.TXQUA4
#define _TXQUA5 C1TXQUALbits.TXQUA5
#define _TXQUA6 C1TXQUALbits.TXQUA6
#define _TXQUA7 C1TXQUALbits.TXQUA7
#define _TXQUA8 C1TXQUALbits.TXQUA8
#define _TXQUA9 C1TXQUALbits.TXQUA9
#define _TXQUA10 C1TXQUALbits.TXQUA10
#define _TXQUA11 C1TXQUALbits.TXQUA11
#define _TXQUA12 C1TXQUALbits.TXQUA12
#define _TXQUA13 C1TXQUALbits.TXQUA13
#define _TXQUA14 C1TXQUALbits.TXQUA14
#define _TXQUA15 C1TXQUALbits.TXQUA15

/* C1TXQUAH */
/* Bitname _TXQUA cannot be defined because it is used by more than one SFR */
#define _TXQUA16 C1TXQUAHbits.TXQUA16
#define _TXQUA17 C1TXQUAHbits.TXQUA17
#define _TXQUA18 C1TXQUAHbits.TXQUA18
#define _TXQUA19 C1TXQUAHbits.TXQUA19
#define _TXQUA20 C1TXQUAHbits.TXQUA20
#define _TXQUA21 C1TXQUAHbits.TXQUA21
#define _TXQUA22 C1TXQUAHbits.TXQUA22
#define _TXQUA23 C1TXQUAHbits.TXQUA23
#define _TXQUA24 C1TXQUAHbits.TXQUA24
#define _TXQUA25 C1TXQUAHbits.TXQUA25
#define _TXQUA26 C1TXQUAHbits.TXQUA26
#define _TXQUA27 C1TXQUAHbits.TXQUA27
#define _TXQUA28 C1TXQUAHbits.TXQUA28
#define _TXQUA29 C1TXQUAHbits.TXQUA29
#define _TXQUA30 C1TXQUAHbits.TXQUA30
#define _TXQUA31 C1TXQUAHbits.TXQUA31

/* C1FIFOCON1L */
/* Bitname _TFNRFNIE cannot be defined because it is used by more than one SFR */
/* Bitname _TFHRFHIE cannot be defined because it is used by more than one SFR */
/* Bitname _TFERFFIE cannot be defined because it is used by more than one SFR */
/* Bitname _RXOVIE cannot be defined because it is used by more than one SFR */
/* Bitname _TXATIE cannot be defined because it is used by more than one SFR */
/* Bitname _RXTSEN cannot be defined because it is used by more than one SFR */
/* Bitname _RTREN cannot be defined because it is used by more than one SFR */
/* Bitname _TXEN cannot be defined because it is used by more than one SFR */
/* Bitname _UINC cannot be defined because it is used by more than one SFR */
/* Bitname _TXREQ cannot be defined because it is used by more than one SFR */
/* Bitname _FRESET cannot be defined because it is used by more than one SFR */

/* C1FIFOCON1H */
/* Bitname _TXPRI cannot be defined because it is used by more than one SFR */
/* Bitname _TXAT cannot be defined because it is used by more than one SFR */
/* Bitname _FSIZE cannot be defined because it is used by more than one SFR */
/* Bitname _PLSIZE cannot be defined because it is used by more than one SFR */
/* Bitname _TXPRI0 cannot be defined because it is used by more than one SFR */
/* Bitname _TXPRI1 cannot be defined because it is used by more than one SFR */
/* Bitname _TXPRI2 cannot be defined because it is used by more than one SFR */
/* Bitname _TXPRI3 cannot be defined because it is used by more than one SFR */
/* Bitname _TXPRI4 cannot be defined because it is used by more than one SFR */
/* Bitname _TXAT0 cannot be defined because it is used by more than one SFR */
/* Bitname _TXAT1 cannot be defined because it is used by more than one SFR */
/* Bitname _FSIZE0 cannot be defined because it is used by more than one SFR */
/* Bitname _FSIZE1 cannot be defined because it is used by more than one SFR */
/* Bitname _FSIZE2 cannot be defined because it is used by more than one SFR */
/* Bitname _FSIZE3 cannot be defined because it is used by more than one SFR */
/* Bitname _FSIZE4 cannot be defined because it is used by more than one SFR */
/* Bitname _PLSIZE0 cannot be defined because it is used by more than one SFR */
/* Bitname _PLSIZE1 cannot be defined because it is used by more than one SFR */
/* Bitname _PLSIZE2 cannot be defined because it is used by more than one SFR */

/* C1FIFOSTA1 */
/* Bitname _TFNRFNIF cannot be defined because it is used by more than one SFR */
/* Bitname _TFHRFHIF cannot be defined because it is used by more than one SFR */
/* Bitname _TFERFFIF cannot be defined because it is used by more than one SFR */
/* Bitname _RXOVIF cannot be defined because it is used by more than one SFR */
/* Bitname _TXATIF cannot be defined because it is used by more than one SFR */
/* Bitname _TXERR cannot be defined because it is used by more than one SFR */
/* Bitname _TXLARB cannot be defined because it is used by more than one SFR */
/* Bitname _TXABT cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOCI cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOCI0 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOCI1 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOCI2 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOCI3 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOCI4 cannot be defined because it is used by more than one SFR */

/* C1FIFOUA1L */
/* Bitname _FIFOUA cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA0 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA1 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA2 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA3 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA4 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA5 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA6 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA7 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA8 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA9 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA10 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA11 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA12 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA13 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA14 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA15 cannot be defined because it is used by more than one SFR */

/* C1FIFOUA1H */
/* Bitname _FIFOUA cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA16 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA17 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA18 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA19 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA20 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA21 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA22 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA23 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA24 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA25 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA26 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA27 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA28 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA29 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA30 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA31 cannot be defined because it is used by more than one SFR */

/* C1FIFOCON2L */
/* Bitname _TFNRFNIE cannot be defined because it is used by more than one SFR */
/* Bitname _TFHRFHIE cannot be defined because it is used by more than one SFR */
/* Bitname _TFERFFIE cannot be defined because it is used by more than one SFR */
/* Bitname _RXOVIE cannot be defined because it is used by more than one SFR */
/* Bitname _TXATIE cannot be defined because it is used by more than one SFR */
/* Bitname _RXTSEN cannot be defined because it is used by more than one SFR */
/* Bitname _RTREN cannot be defined because it is used by more than one SFR */
/* Bitname _TXEN cannot be defined because it is used by more than one SFR */
/* Bitname _UINC cannot be defined because it is used by more than one SFR */
/* Bitname _TXREQ cannot be defined because it is used by more than one SFR */
/* Bitname _FRESET cannot be defined because it is used by more than one SFR */

/* C1FIFOCON2H */
/* Bitname _TXPRI cannot be defined because it is used by more than one SFR */
/* Bitname _TXAT cannot be defined because it is used by more than one SFR */
/* Bitname _FSIZE cannot be defined because it is used by more than one SFR */
/* Bitname _PLSIZE cannot be defined because it is used by more than one SFR */
/* Bitname _TXPRI0 cannot be defined because it is used by more than one SFR */
/* Bitname _TXPRI1 cannot be defined because it is used by more than one SFR */
/* Bitname _TXPRI2 cannot be defined because it is used by more than one SFR */
/* Bitname _TXPRI3 cannot be defined because it is used by more than one SFR */
/* Bitname _TXPRI4 cannot be defined because it is used by more than one SFR */
/* Bitname _TXAT0 cannot be defined because it is used by more than one SFR */
/* Bitname _TXAT1 cannot be defined because it is used by more than one SFR */
/* Bitname _FSIZE0 cannot be defined because it is used by more than one SFR */
/* Bitname _FSIZE1 cannot be defined because it is used by more than one SFR */
/* Bitname _FSIZE2 cannot be defined because it is used by more than one SFR */
/* Bitname _FSIZE3 cannot be defined because it is used by more than one SFR */
/* Bitname _FSIZE4 cannot be defined because it is used by more than one SFR */
/* Bitname _PLSIZE0 cannot be defined because it is used by more than one SFR */
/* Bitname _PLSIZE1 cannot be defined because it is used by more than one SFR */
/* Bitname _PLSIZE2 cannot be defined because it is used by more than one SFR */

/* C1FIFOSTA2 */
/* Bitname _TFNRFNIF cannot be defined because it is used by more than one SFR */
/* Bitname _TFHRFHIF cannot be defined because it is used by more than one SFR */
/* Bitname _TFERFFIF cannot be defined because it is used by more than one SFR */
/* Bitname _RXOVIF cannot be defined because it is used by more than one SFR */
/* Bitname _TXATIF cannot be defined because it is used by more than one SFR */
/* Bitname _TXERR cannot be defined because it is used by more than one SFR */
/* Bitname _TXLARB cannot be defined because it is used by more than one SFR */
/* Bitname _TXABT cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOCI cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOCI0 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOCI1 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOCI2 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOCI3 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOCI4 cannot be defined because it is used by more than one SFR */

/* C1FIFOUA2L */
/* Bitname _FIFOUA cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA0 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA1 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA2 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA3 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA4 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA5 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA6 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA7 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA8 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA9 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA10 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA11 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA12 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA13 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA14 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA15 cannot be defined because it is used by more than one SFR */

/* C1FIFOUA2H */
/* Bitname _FIFOUA cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA16 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA17 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA18 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA19 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA20 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA21 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA22 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA23 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA24 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA25 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA26 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA27 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA28 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA29 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA30 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA31 cannot be defined because it is used by more than one SFR */

/* C1FIFOCON3L */
/* Bitname _TFNRFNIE cannot be defined because it is used by more than one SFR */
/* Bitname _TFHRFHIE cannot be defined because it is used by more than one SFR */
/* Bitname _TFERFFIE cannot be defined because it is used by more than one SFR */
/* Bitname _RXOVIE cannot be defined because it is used by more than one SFR */
/* Bitname _TXATIE cannot be defined because it is used by more than one SFR */
/* Bitname _RXTSEN cannot be defined because it is used by more than one SFR */
/* Bitname _RTREN cannot be defined because it is used by more than one SFR */
/* Bitname _TXEN cannot be defined because it is used by more than one SFR */
/* Bitname _UINC cannot be defined because it is used by more than one SFR */
/* Bitname _TXREQ cannot be defined because it is used by more than one SFR */
/* Bitname _FRESET cannot be defined because it is used by more than one SFR */

/* C1FIFOCON3H */
/* Bitname _TXPRI cannot be defined because it is used by more than one SFR */
/* Bitname _TXAT cannot be defined because it is used by more than one SFR */
/* Bitname _FSIZE cannot be defined because it is used by more than one SFR */
/* Bitname _PLSIZE cannot be defined because it is used by more than one SFR */
/* Bitname _TXPRI0 cannot be defined because it is used by more than one SFR */
/* Bitname _TXPRI1 cannot be defined because it is used by more than one SFR */
/* Bitname _TXPRI2 cannot be defined because it is used by more than one SFR */
/* Bitname _TXPRI3 cannot be defined because it is used by more than one SFR */
/* Bitname _TXPRI4 cannot be defined because it is used by more than one SFR */
/* Bitname _TXAT0 cannot be defined because it is used by more than one SFR */
/* Bitname _TXAT1 cannot be defined because it is used by more than one SFR */
/* Bitname _FSIZE0 cannot be defined because it is used by more than one SFR */
/* Bitname _FSIZE1 cannot be defined because it is used by more than one SFR */
/* Bitname _FSIZE2 cannot be defined because it is used by more than one SFR */
/* Bitname _FSIZE3 cannot be defined because it is used by more than one SFR */
/* Bitname _FSIZE4 cannot be defined because it is used by more than one SFR */
/* Bitname _PLSIZE0 cannot be defined because it is used by more than one SFR */
/* Bitname _PLSIZE1 cannot be defined because it is used by more than one SFR */
/* Bitname _PLSIZE2 cannot be defined because it is used by more than one SFR */

/* C1FIFOSTA3 */
/* Bitname _TFNRFNIF cannot be defined because it is used by more than one SFR */
/* Bitname _TFHRFHIF cannot be defined because it is used by more than one SFR */
/* Bitname _TFERFFIF cannot be defined because it is used by more than one SFR */
/* Bitname _RXOVIF cannot be defined because it is used by more than one SFR */
/* Bitname _TXATIF cannot be defined because it is used by more than one SFR */
/* Bitname _TXERR cannot be defined because it is used by more than one SFR */
/* Bitname _TXLARB cannot be defined because it is used by more than one SFR */
/* Bitname _TXABT cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOCI cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOCI0 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOCI1 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOCI2 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOCI3 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOCI4 cannot be defined because it is used by more than one SFR */

