gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
/* C1FIFOSTA6 */
/* Bitname _TFNRFNIF cannot be defined because it is used by more than one SFR */
/* Bitname _TFHRFHIF cannot be defined because it is used by more than one SFR */
/* Bitname _TFERFFIF cannot be defined because it is used by more than one SFR */
/* Bitname _RXOVIF cannot be defined because it is used by more than one SFR */
/* Bitname _TXATIF cannot be defined because it is used by more than one SFR */
/* Bitname _TXERR cannot be defined because it is used by more than one SFR */
/* Bitname _TXLARB cannot be defined because it is used by more than one SFR */
/* Bitname _TXABT cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOCI cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOCI0 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOCI1 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOCI2 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOCI3 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOCI4 cannot be defined because it is used by more than one SFR */

/* C1FIFOUA6L */
/* Bitname _FIFOUA cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA0 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA1 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA2 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA3 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA4 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA5 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA6 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA7 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA8 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA9 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA10 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA11 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA12 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA13 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA14 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA15 cannot be defined because it is used by more than one SFR */

/* C1FIFOUA6H */
/* Bitname _FIFOUA cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA16 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA17 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA18 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA19 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA20 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA21 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA22 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA23 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA24 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA25 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA26 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA27 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA28 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA29 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA30 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA31 cannot be defined because it is used by more than one SFR */

/* C1FIFOCON7L */
/* Bitname _TFNRFNIE cannot be defined because it is used by more than one SFR */
/* Bitname _TFHRFHIE cannot be defined because it is used by more than one SFR */
/* Bitname _TFERFFIE cannot be defined because it is used by more than one SFR */
/* Bitname _RXOVIE cannot be defined because it is used by more than one SFR */
/* Bitname _TXATIE cannot be defined because it is used by more than one SFR */
/* Bitname _RXTSEN cannot be defined because it is used by more than one SFR */
/* Bitname _RTREN cannot be defined because it is used by more than one SFR */
/* Bitname _TXEN cannot be defined because it is used by more than one SFR */
/* Bitname _UINC cannot be defined because it is used by more than one SFR */
/* Bitname _TXREQ cannot be defined because it is used by more than one SFR */
/* Bitname _FRESET cannot be defined because it is used by more than one SFR */

/* C1FIFOCON7H */
/* Bitname _TXPRI cannot be defined because it is used by more than one SFR */
/* Bitname _TXAT cannot be defined because it is used by more than one SFR */
/* Bitname _FSIZE cannot be defined because it is used by more than one SFR */
/* Bitname _PLSIZE cannot be defined because it is used by more than one SFR */
/* Bitname _TXPRI0 cannot be defined because it is used by more than one SFR */
/* Bitname _TXPRI1 cannot be defined because it is used by more than one SFR */
/* Bitname _TXPRI2 cannot be defined because it is used by more than one SFR */
/* Bitname _TXPRI3 cannot be defined because it is used by more than one SFR */
/* Bitname _TXPRI4 cannot be defined because it is used by more than one SFR */
/* Bitname _TXAT0 cannot be defined because it is used by more than one SFR */
/* Bitname _TXAT1 cannot be defined because it is used by more than one SFR */
/* Bitname _FSIZE0 cannot be defined because it is used by more than one SFR */
/* Bitname _FSIZE1 cannot be defined because it is used by more than one SFR */
/* Bitname _FSIZE2 cannot be defined because it is used by more than one SFR */
/* Bitname _FSIZE3 cannot be defined because it is used by more than one SFR */
/* Bitname _FSIZE4 cannot be defined because it is used by more than one SFR */
/* Bitname _PLSIZE0 cannot be defined because it is used by more than one SFR */
/* Bitname _PLSIZE1 cannot be defined because it is used by more than one SFR */
/* Bitname _PLSIZE2 cannot be defined because it is used by more than one SFR */

/* C1FIFOSTA7 */
/* Bitname _TFNRFNIF cannot be defined because it is used by more than one SFR */
/* Bitname _TFHRFHIF cannot be defined because it is used by more than one SFR */
/* Bitname _TFERFFIF cannot be defined because it is used by more than one SFR */
/* Bitname _RXOVIF cannot be defined because it is used by more than one SFR */
/* Bitname _TXATIF cannot be defined because it is used by more than one SFR */
/* Bitname _TXERR cannot be defined because it is used by more than one SFR */
/* Bitname _TXLARB cannot be defined because it is used by more than one SFR */
/* Bitname _TXABT cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOCI cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOCI0 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOCI1 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOCI2 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOCI3 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOCI4 cannot be defined because it is used by more than one SFR */

/* C1FIFOUA7L */
/* Bitname _FIFOUA cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA0 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA1 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA2 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA3 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA4 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA5 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA6 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA7 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA8 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA9 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA10 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA11 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA12 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA13 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA14 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA15 cannot be defined because it is used by more than one SFR */

/* C1FIFOUA7H */
/* Bitname _FIFOUA cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA16 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA17 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA18 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA19 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA20 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA21 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA22 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA23 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA24 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA25 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA26 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA27 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA28 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA29 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA30 cannot be defined because it is used by more than one SFR */
/* Bitname _FIFOUA31 cannot be defined because it is used by more than one SFR */

