gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
/* C1FLTCON0L */
#define _F0BP C1FLTCON0Lbits.F0BP
#define _FLTEN0 C1FLTCON0Lbits.FLTEN0
#define _F1BP C1FLTCON0Lbits.F1BP
#define _FLTEN1 C1FLTCON0Lbits.FLTEN1

/* C1FLTCON0H */
#define _F2BP C1FLTCON0Hbits.F2BP
#define _FLTEN2 C1FLTCON0Hbits.FLTEN2
#define _F3BP C1FLTCON0Hbits.F3BP
#define _FLTEN3 C1FLTCON0Hbits.FLTEN3

/* C1FLTCON1L */
#define _F4BP C1FLTCON1Lbits.F4BP
#define _FLTEN4 C1FLTCON1Lbits.FLTEN4
#define _F5BP C1FLTCON1Lbits.F5BP
#define _FLTEN5 C1FLTCON1Lbits.FLTEN5

/* C1FLTCON1H */
#define _F6BP C1FLTCON1Hbits.F6BP
#define _FLTEN6 C1FLTCON1Hbits.FLTEN6
#define _F7BP C1FLTCON1Hbits.F7BP
#define _FLTEN7 C1FLTCON1Hbits.FLTEN7

/* C1FLTCON2L */
#define _F8BP C1FLTCON2Lbits.F8BP
#define _FLTEN8 C1FLTCON2Lbits.FLTEN8
#define _F9BP C1FLTCON2Lbits.F9BP
#define _FLTEN9 C1FLTCON2Lbits.FLTEN9

/* C1FLTCON2H */
#define _F10BP C1FLTCON2Hbits.F10BP
#define _FLTEN10 C1FLTCON2Hbits.FLTEN10
#define _F11BP C1FLTCON2Hbits.F11BP
#define _FLTEN11 C1FLTCON2Hbits.FLTEN11

/* C1FLTCON3L */
#define _F12BP C1FLTCON3Lbits.F12BP
#define _FLTEN12 C1FLTCON3Lbits.FLTEN12
#define _F13BP C1FLTCON3Lbits.F13BP
#define _FLTEN13 C1FLTCON3Lbits.FLTEN13

/* C1FLTCON3H */
#define _F14BP C1FLTCON3Hbits.F14BP
#define _FLTEN14 C1FLTCON3Hbits.FLTEN14
#define _F15BP C1FLTCON3Hbits.F15BP
#define _FLTEN15 C1FLTCON3Hbits.FLTEN15

/* C1FLTOBJ0L */
/* Bitname _SID cannot be defined because it is used by more than one SFR */
/* Bitname _EID cannot be defined because it is used by more than one SFR */
/* Bitname _SID0 cannot be defined because it is used by more than one SFR */
/* Bitname _SID1 cannot be defined because it is used by more than one SFR */
/* Bitname _SID2 cannot be defined because it is used by more than one SFR */
/* Bitname _SID3 cannot be defined because it is used by more than one SFR */
/* Bitname _SID4 cannot be defined because it is used by more than one SFR */
/* Bitname _SID5 cannot be defined because it is used by more than one SFR */
/* Bitname _SID6 cannot be defined because it is used by more than one SFR */
/* Bitname _SID7 cannot be defined because it is used by more than one SFR */
/* Bitname _SID8 cannot be defined because it is used by more than one SFR */
/* Bitname _SID9 cannot be defined because it is used by more than one SFR */
/* Bitname _SID10 cannot be defined because it is used by more than one SFR */
/* Bitname _EID0 cannot be defined because it is used by more than one SFR */
/* Bitname _EID1 cannot be defined because it is used by more than one SFR */
/* Bitname _EID2 cannot be defined because it is used by more than one SFR */
/* Bitname _EID3 cannot be defined because it is used by more than one SFR */
/* Bitname _EID4 cannot be defined because it is used by more than one SFR */

/* C1FLTOBJ0H */
/* Bitname _EID cannot be defined because it is used by more than one SFR */
/* Bitname _SID11 cannot be defined because it is used by more than one SFR */
/* Bitname _EXIDE cannot be defined because it is used by more than one SFR */
/* Bitname _EID5 cannot be defined because it is used by more than one SFR */
/* Bitname _EID6 cannot be defined because it is used by more than one SFR */
/* Bitname _EID7 cannot be defined because it is used by more than one SFR */
/* Bitname _EID8 cannot be defined because it is used by more than one SFR */
/* Bitname _EID9 cannot be defined because it is used by more than one SFR */
/* Bitname _EID10 cannot be defined because it is used by more than one SFR */
/* Bitname _EID11 cannot be defined because it is used by more than one SFR */
/* Bitname _EID12 cannot be defined because it is used by more than one SFR */
/* Bitname _EID13 cannot be defined because it is used by more than one SFR */
/* Bitname _EID14 cannot be defined because it is used by more than one SFR */
/* Bitname _EID15 cannot be defined because it is used by more than one SFR */
/* Bitname _EID16 cannot be defined because it is used by more than one SFR */
/* Bitname _EID17 cannot be defined because it is used by more than one SFR */

/* C1MASK0L */
/* Bitname _MSID cannot be defined because it is used by more than one SFR */
/* Bitname _MEID cannot be defined because it is used by more than one SFR */
/* Bitname _MSID0 cannot be defined because it is used by more than one SFR */
/* Bitname _MSID1 cannot be defined because it is used by more than one SFR */
/* Bitname _MSID2 cannot be defined because it is used by more than one SFR */
/* Bitname _MSID3 cannot be defined because it is used by more than one SFR */
/* Bitname _MSID4 cannot be defined because it is used by more than one SFR */
/* Bitname _MSID5 cannot be defined because it is used by more than one SFR */
/* Bitname _MSID6 cannot be defined because it is used by more than one SFR */
/* Bitname _MSID7 cannot be defined because it is used by more than one SFR */
/* Bitname _MSID8 cannot be defined because it is used by more than one SFR */
/* Bitname _MSID9 cannot be defined because it is used by more than one SFR */
/* Bitname _MSID10 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID0 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID1 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID2 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID3 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID4 cannot be defined because it is used by more than one SFR */

/* C1MASK0H */
/* Bitname _MEID cannot be defined because it is used by more than one SFR */
/* Bitname _MSID11 cannot be defined because it is used by more than one SFR */
/* Bitname _MIDE cannot be defined because it is used by more than one SFR */
/* Bitname _MEID5 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID6 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID7 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID8 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID9 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID10 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID11 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID12 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID13 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID14 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID15 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID16 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID17 cannot be defined because it is used by more than one SFR */

/* C1FLTOBJ1L */
/* Bitname _SID cannot be defined because it is used by more than one SFR */
/* Bitname _EID cannot be defined because it is used by more than one SFR */
/* Bitname _SID0 cannot be defined because it is used by more than one SFR */
/* Bitname _SID1 cannot be defined because it is used by more than one SFR */
/* Bitname _SID2 cannot be defined because it is used by more than one SFR */
/* Bitname _SID3 cannot be defined because it is used by more than one SFR */
/* Bitname _SID4 cannot be defined because it is used by more than one SFR */
/* Bitname _SID5 cannot be defined because it is used by more than one SFR */
/* Bitname _SID6 cannot be defined because it is used by more than one SFR */
/* Bitname _SID7 cannot be defined because it is used by more than one SFR */
/* Bitname _SID8 cannot be defined because it is used by more than one SFR */
/* Bitname _SID9 cannot be defined because it is used by more than one SFR */
/* Bitname _SID10 cannot be defined because it is used by more than one SFR */
/* Bitname _EID0 cannot be defined because it is used by more than one SFR */
/* Bitname _EID1 cannot be defined because it is used by more than one SFR */
/* Bitname _EID2 cannot be defined because it is used by more than one SFR */
/* Bitname _EID3 cannot be defined because it is used by more than one SFR */
/* Bitname _EID4 cannot be defined because it is used by more than one SFR */

/* C1FLTOBJ1H */
/* Bitname _EID cannot be defined because it is used by more than one SFR */
/* Bitname _SID11 cannot be defined because it is used by more than one SFR */
/* Bitname _EXIDE cannot be defined because it is used by more than one SFR */
/* Bitname _EID5 cannot be defined because it is used by more than one SFR */
/* Bitname _EID6 cannot be defined because it is used by more than one SFR */
/* Bitname _EID7 cannot be defined because it is used by more than one SFR */
/* Bitname _EID8 cannot be defined because it is used by more than one SFR */
/* Bitname _EID9 cannot be defined because it is used by more than one SFR */
/* Bitname _EID10 cannot be defined because it is used by more than one SFR */
/* Bitname _EID11 cannot be defined because it is used by more than one SFR */
/* Bitname _EID12 cannot be defined because it is used by more than one SFR */
/* Bitname _EID13 cannot be defined because it is used by more than one SFR */
/* Bitname _EID14 cannot be defined because it is used by more than one SFR */
/* Bitname _EID15 cannot be defined because it is used by more than one SFR */
/* Bitname _EID16 cannot be defined because it is used by more than one SFR */
/* Bitname _EID17 cannot be defined because it is used by more than one SFR */

/* C1MASK1L */
/* Bitname _MSID cannot be defined because it is used by more than one SFR */
/* Bitname _MEID cannot be defined because it is used by more than one SFR */
/* Bitname _MSID0 cannot be defined because it is used by more than one SFR */
/* Bitname _MSID1 cannot be defined because it is used by more than one SFR */
/* Bitname _MSID2 cannot be defined because it is used by more than one SFR */
/* Bitname _MSID3 cannot be defined because it is used by more than one SFR */
/* Bitname _MSID4 cannot be defined because it is used by more than one SFR */
/* Bitname _MSID5 cannot be defined because it is used by more than one SFR */
/* Bitname _MSID6 cannot be defined because it is used by more than one SFR */
/* Bitname _MSID7 cannot be defined because it is used by more than one SFR */
/* Bitname _MSID8 cannot be defined because it is used by more than one SFR */
/* Bitname _MSID9 cannot be defined because it is used by more than one SFR */
/* Bitname _MSID10 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID0 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID1 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID2 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID3 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID4 cannot be defined because it is used by more than one SFR */

/* C1MASK1H */
/* Bitname _MEID cannot be defined because it is used by more than one SFR */
/* Bitname _MSID11 cannot be defined because it is used by more than one SFR */
/* Bitname _MIDE cannot be defined because it is used by more than one SFR */
/* Bitname _MEID5 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID6 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID7 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID8 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID9 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID10 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID11 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID12 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID13 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID14 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID15 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID16 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID17 cannot be defined because it is used by more than one SFR */

/* C1FLTOBJ2L */
/* Bitname _SID cannot be defined because it is used by more than one SFR */
/* Bitname _EID cannot be defined because it is used by more than one SFR */
/* Bitname _SID0 cannot be defined because it is used by more than one SFR */
/* Bitname _SID1 cannot be defined because it is used by more than one SFR */
/* Bitname _SID2 cannot be defined because it is used by more than one SFR */
/* Bitname _SID3 cannot be defined because it is used by more than one SFR */
/* Bitname _SID4 cannot be defined because it is used by more than one SFR */
/* Bitname _SID5 cannot be defined because it is used by more than one SFR */
/* Bitname _SID6 cannot be defined because it is used by more than one SFR */
/* Bitname _SID7 cannot be defined because it is used by more than one SFR */
/* Bitname _SID8 cannot be defined because it is used by more than one SFR */
/* Bitname _SID9 cannot be defined because it is used by more than one SFR */
/* Bitname _SID10 cannot be defined because it is used by more than one SFR */
/* Bitname _EID0 cannot be defined because it is used by more than one SFR */
/* Bitname _EID1 cannot be defined because it is used by more than one SFR */
/* Bitname _EID2 cannot be defined because it is used by more than one SFR */
/* Bitname _EID3 cannot be defined because it is used by more than one SFR */
/* Bitname _EID4 cannot be defined because it is used by more than one SFR */

/* C1FLTOBJ2H */
/* Bitname _EID cannot be defined because it is used by more than one SFR */
/* Bitname _SID11 cannot be defined because it is used by more than one SFR */
/* Bitname _EXIDE cannot be defined because it is used by more than one SFR */
/* Bitname _EID5 cannot be defined because it is used by more than one SFR */
/* Bitname _EID6 cannot be defined because it is used by more than one SFR */
/* Bitname _EID7 cannot be defined because it is used by more than one SFR */
/* Bitname _EID8 cannot be defined because it is used by more than one SFR */
/* Bitname _EID9 cannot be defined because it is used by more than one SFR */
/* Bitname _EID10 cannot be defined because it is used by more than one SFR */
/* Bitname _EID11 cannot be defined because it is used by more than one SFR */
/* Bitname _EID12 cannot be defined because it is used by more than one SFR */
/* Bitname _EID13 cannot be defined because it is used by more than one SFR */
/* Bitname _EID14 cannot be defined because it is used by more than one SFR */
/* Bitname _EID15 cannot be defined because it is used by more than one SFR */
/* Bitname _EID16 cannot be defined because it is used by more than one SFR */
/* Bitname _EID17 cannot be defined because it is used by more than one SFR */

/* C1MASK2L */
/* Bitname _MSID cannot be defined because it is used by more than one SFR */
/* Bitname _MEID cannot be defined because it is used by more than one SFR */
/* Bitname _MSID0 cannot be defined because it is used by more than one SFR */
/* Bitname _MSID1 cannot be defined because it is used by more than one SFR */
/* Bitname _MSID2 cannot be defined because it is used by more than one SFR */
/* Bitname _MSID3 cannot be defined because it is used by more than one SFR */
/* Bitname _MSID4 cannot be defined because it is used by more than one SFR */
/* Bitname _MSID5 cannot be defined because it is used by more than one SFR */
/* Bitname _MSID6 cannot be defined because it is used by more than one SFR */
/* Bitname _MSID7 cannot be defined because it is used by more than one SFR */
/* Bitname _MSID8 cannot be defined because it is used by more than one SFR */
/* Bitname _MSID9 cannot be defined because it is used by more than one SFR */
/* Bitname _MSID10 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID0 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID1 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID2 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID3 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID4 cannot be defined because it is used by more than one SFR */

/* C1MASK2H */
/* Bitname _MEID cannot be defined because it is used by more than one SFR */
/* Bitname _MSID11 cannot be defined because it is used by more than one SFR */
/* Bitname _MIDE cannot be defined because it is used by more than one SFR */
/* Bitname _MEID5 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID6 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID7 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID8 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID9 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID10 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID11 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID12 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID13 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID14 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID15 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID16 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID17 cannot be defined because it is used by more than one SFR */

/* C1FLTOBJ3L */
/* Bitname _SID cannot be defined because it is used by more than one SFR */
/* Bitname _EID cannot be defined because it is used by more than one SFR */
/* Bitname _SID0 cannot be defined because it is used by more than one SFR */
/* Bitname _SID1 cannot be defined because it is used by more than one SFR */
/* Bitname _SID2 cannot be defined because it is used by more than one SFR */
/* Bitname _SID3 cannot be defined because it is used by more than one SFR */
/* Bitname _SID4 cannot be defined because it is used by more than one SFR */
/* Bitname _SID5 cannot be defined because it is used by more than one SFR */
/* Bitname _SID6 cannot be defined because it is used by more than one SFR */
/* Bitname _SID7 cannot be defined because it is used by more than one SFR */
/* Bitname _SID8 cannot be defined because it is used by more than one SFR */
/* Bitname _SID9 cannot be defined because it is used by more than one SFR */
/* Bitname _SID10 cannot be defined because it is used by more than one SFR */
/* Bitname _EID0 cannot be defined because it is used by more than one SFR */
/* Bitname _EID1 cannot be defined because it is used by more than one SFR */
/* Bitname _EID2 cannot be defined because it is used by more than one SFR */
/* Bitname _EID3 cannot be defined because it is used by more than one SFR */
/* Bitname _EID4 cannot be defined because it is used by more than one SFR */

/* C1FLTOBJ3H */
/* Bitname _EID cannot be defined because it is used by more than one SFR */
/* Bitname _SID11 cannot be defined because it is used by more than one SFR */
/* Bitname _EXIDE cannot be defined because it is used by more than one SFR */
/* Bitname _EID5 cannot be defined because it is used by more than one SFR */
/* Bitname _EID6 cannot be defined because it is used by more than one SFR */
/* Bitname _EID7 cannot be defined because it is used by more than one SFR */
/* Bitname _EID8 cannot be defined because it is used by more than one SFR */
/* Bitname _EID9 cannot be defined because it is used by more than one SFR */
/* Bitname _EID10 cannot be defined because it is used by more than one SFR */
/* Bitname _EID11 cannot be defined because it is used by more than one SFR */
/* Bitname _EID12 cannot be defined because it is used by more than one SFR */
/* Bitname _EID13 cannot be defined because it is used by more than one SFR */
/* Bitname _EID14 cannot be defined because it is used by more than one SFR */
/* Bitname _EID15 cannot be defined because it is used by more than one SFR */
/* Bitname _EID16 cannot be defined because it is used by more than one SFR */
/* Bitname _EID17 cannot be defined because it is used by more than one SFR */

/* C1MASK3L */
/* Bitname _MSID cannot be defined because it is used by more than one SFR */
/* Bitname _MEID cannot be defined because it is used by more than one SFR */
/* Bitname _MSID0 cannot be defined because it is used by more than one SFR */
/* Bitname _MSID1 cannot be defined because it is used by more than one SFR */
/* Bitname _MSID2 cannot be defined because it is used by more than one SFR */
/* Bitname _MSID3 cannot be defined because it is used by more than one SFR */
/* Bitname _MSID4 cannot be defined because it is used by more than one SFR */
/* Bitname _MSID5 cannot be defined because it is used by more than one SFR */
/* Bitname _MSID6 cannot be defined because it is used by more than one SFR */
/* Bitname _MSID7 cannot be defined because it is used by more than one SFR */
/* Bitname _MSID8 cannot be defined because it is used by more than one SFR */
/* Bitname _MSID9 cannot be defined because it is used by more than one SFR */
/* Bitname _MSID10 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID0 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID1 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID2 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID3 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID4 cannot be defined because it is used by more than one SFR */

/* C1MASK3H */
/* Bitname _MEID cannot be defined because it is used by more than one SFR */
/* Bitname _MSID11 cannot be defined because it is used by more than one SFR */
/* Bitname _MIDE cannot be defined because it is used by more than one SFR */
/* Bitname _MEID5 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID6 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID7 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID8 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID9 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID10 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID11 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID12 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID13 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID14 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID15 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID16 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID17 cannot be defined because it is used by more than one SFR */

