gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
/* C1FLTOBJ11L */
/* Bitname _SID cannot be defined because it is used by more than one SFR */
/* Bitname _EID cannot be defined because it is used by more than one SFR */
/* Bitname _SID0 cannot be defined because it is used by more than one SFR */
/* Bitname _SID1 cannot be defined because it is used by more than one SFR */
/* Bitname _SID2 cannot be defined because it is used by more than one SFR */
/* Bitname _SID3 cannot be defined because it is used by more than one SFR */
/* Bitname _SID4 cannot be defined because it is used by more than one SFR */
/* Bitname _SID5 cannot be defined because it is used by more than one SFR */
/* Bitname _SID6 cannot be defined because it is used by more than one SFR */
/* Bitname _SID7 cannot be defined because it is used by more than one SFR */
/* Bitname _SID8 cannot be defined because it is used by more than one SFR */
/* Bitname _SID9 cannot be defined because it is used by more than one SFR */
/* Bitname _SID10 cannot be defined because it is used by more than one SFR */
/* Bitname _EID0 cannot be defined because it is used by more than one SFR */
/* Bitname _EID1 cannot be defined because it is used by more than one SFR */
/* Bitname _EID2 cannot be defined because it is used by more than one SFR */
/* Bitname _EID3 cannot be defined because it is used by more than one SFR */
/* Bitname _EID4 cannot be defined because it is used by more than one SFR */

/* C1FLTOBJ11H */
/* Bitname _EID cannot be defined because it is used by more than one SFR */
/* Bitname _SID11 cannot be defined because it is used by more than one SFR */
/* Bitname _EXIDE cannot be defined because it is used by more than one SFR */
/* Bitname _EID5 cannot be defined because it is used by more than one SFR */
/* Bitname _EID6 cannot be defined because it is used by more than one SFR */
/* Bitname _EID7 cannot be defined because it is used by more than one SFR */
/* Bitname _EID8 cannot be defined because it is used by more than one SFR */
/* Bitname _EID9 cannot be defined because it is used by more than one SFR */
/* Bitname _EID10 cannot be defined because it is used by more than one SFR */
/* Bitname _EID11 cannot be defined because it is used by more than one SFR */
/* Bitname _EID12 cannot be defined because it is used by more than one SFR */
/* Bitname _EID13 cannot be defined because it is used by more than one SFR */
/* Bitname _EID14 cannot be defined because it is used by more than one SFR */
/* Bitname _EID15 cannot be defined because it is used by more than one SFR */
/* Bitname _EID16 cannot be defined because it is used by more than one SFR */
/* Bitname _EID17 cannot be defined because it is used by more than one SFR */

/* C1MASK11L */
/* Bitname _MSID cannot be defined because it is used by more than one SFR */
/* Bitname _MEID cannot be defined because it is used by more than one SFR */
/* Bitname _MSID0 cannot be defined because it is used by more than one SFR */
/* Bitname _MSID1 cannot be defined because it is used by more than one SFR */
/* Bitname _MSID2 cannot be defined because it is used by more than one SFR */
/* Bitname _MSID3 cannot be defined because it is used by more than one SFR */
/* Bitname _MSID4 cannot be defined because it is used by more than one SFR */
/* Bitname _MSID5 cannot be defined because it is used by more than one SFR */
/* Bitname _MSID6 cannot be defined because it is used by more than one SFR */
/* Bitname _MSID7 cannot be defined because it is used by more than one SFR */
/* Bitname _MSID8 cannot be defined because it is used by more than one SFR */
/* Bitname _MSID9 cannot be defined because it is used by more than one SFR */
/* Bitname _MSID10 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID0 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID1 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID2 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID3 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID4 cannot be defined because it is used by more than one SFR */

/* C1MASK11H */
/* Bitname _MEID cannot be defined because it is used by more than one SFR */
/* Bitname _MSID11 cannot be defined because it is used by more than one SFR */
/* Bitname _MIDE cannot be defined because it is used by more than one SFR */
/* Bitname _MEID5 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID6 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID7 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID8 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID9 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID10 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID11 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID12 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID13 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID14 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID15 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID16 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID17 cannot be defined because it is used by more than one SFR */

/* C1FLTOBJ12L */
/* Bitname _SID cannot be defined because it is used by more than one SFR */
/* Bitname _EID cannot be defined because it is used by more than one SFR */
/* Bitname _SID0 cannot be defined because it is used by more than one SFR */
/* Bitname _SID1 cannot be defined because it is used by more than one SFR */
/* Bitname _SID2 cannot be defined because it is used by more than one SFR */
/* Bitname _SID3 cannot be defined because it is used by more than one SFR */
/* Bitname _SID4 cannot be defined because it is used by more than one SFR */
/* Bitname _SID5 cannot be defined because it is used by more than one SFR */
/* Bitname _SID6 cannot be defined because it is used by more than one SFR */
/* Bitname _SID7 cannot be defined because it is used by more than one SFR */
/* Bitname _SID8 cannot be defined because it is used by more than one SFR */
/* Bitname _SID9 cannot be defined because it is used by more than one SFR */
/* Bitname _SID10 cannot be defined because it is used by more than one SFR */
/* Bitname _EID0 cannot be defined because it is used by more than one SFR */
/* Bitname _EID1 cannot be defined because it is used by more than one SFR */
/* Bitname _EID2 cannot be defined because it is used by more than one SFR */
/* Bitname _EID3 cannot be defined because it is used by more than one SFR */
/* Bitname _EID4 cannot be defined because it is used by more than one SFR */

/* C1FLTOBJ12H */
/* Bitname _EID cannot be defined because it is used by more than one SFR */
/* Bitname _SID11 cannot be defined because it is used by more than one SFR */
/* Bitname _EXIDE cannot be defined because it is used by more than one SFR */
/* Bitname _EID5 cannot be defined because it is used by more than one SFR */
/* Bitname _EID6 cannot be defined because it is used by more than one SFR */
/* Bitname _EID7 cannot be defined because it is used by more than one SFR */
/* Bitname _EID8 cannot be defined because it is used by more than one SFR */
/* Bitname _EID9 cannot be defined because it is used by more than one SFR */
/* Bitname _EID10 cannot be defined because it is used by more than one SFR */
/* Bitname _EID11 cannot be defined because it is used by more than one SFR */
/* Bitname _EID12 cannot be defined because it is used by more than one SFR */
/* Bitname _EID13 cannot be defined because it is used by more than one SFR */
/* Bitname _EID14 cannot be defined because it is used by more than one SFR */
/* Bitname _EID15 cannot be defined because it is used by more than one SFR */
/* Bitname _EID16 cannot be defined because it is used by more than one SFR */
/* Bitname _EID17 cannot be defined because it is used by more than one SFR */

/* C1MASK12L */
/* Bitname _MSID cannot be defined because it is used by more than one SFR */
/* Bitname _MEID cannot be defined because it is used by more than one SFR */
/* Bitname _MSID0 cannot be defined because it is used by more than one SFR */
/* Bitname _MSID1 cannot be defined because it is used by more than one SFR */
/* Bitname _MSID2 cannot be defined because it is used by more than one SFR */
/* Bitname _MSID3 cannot be defined because it is used by more than one SFR */
/* Bitname _MSID4 cannot be defined because it is used by more than one SFR */
/* Bitname _MSID5 cannot be defined because it is used by more than one SFR */
/* Bitname _MSID6 cannot be defined because it is used by more than one SFR */
/* Bitname _MSID7 cannot be defined because it is used by more than one SFR */
/* Bitname _MSID8 cannot be defined because it is used by more than one SFR */
/* Bitname _MSID9 cannot be defined because it is used by more than one SFR */
/* Bitname _MSID10 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID0 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID1 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID2 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID3 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID4 cannot be defined because it is used by more than one SFR */

/* C1MASK12H */
/* Bitname _MEID cannot be defined because it is used by more than one SFR */
/* Bitname _MSID11 cannot be defined because it is used by more than one SFR */
/* Bitname _MIDE cannot be defined because it is used by more than one SFR */
/* Bitname _MEID5 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID6 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID7 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID8 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID9 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID10 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID11 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID12 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID13 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID14 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID15 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID16 cannot be defined because it is used by more than one SFR */
/* Bitname _MEID17 cannot be defined because it is used by more than one SFR */

