gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
/* IEC12 */
#define _ADCAN24IE IEC12bits.ADCAN24IE
#define _ADCAN25IE IEC12bits.ADCAN25IE

/* IPC0 */
#define _INT0IP IPC0bits.INT0IP
#define _T1IP IPC0bits.T1IP
#define _CNAIP IPC0bits.CNAIP
#define _CNBIP IPC0bits.CNBIP

/* IPC1 */
#define _DMA0IP IPC1bits.DMA0IP
#define _CCP1IP IPC1bits.CCP1IP
#define _CCT1IP IPC1bits.CCT1IP

/* IPC2 */
#define _DMA1IP IPC2bits.DMA1IP
#define _SPI1RXIP IPC2bits.SPI1RXIP
#define _SPI1TXIP IPC2bits.SPI1TXIP
#define _U1RXIP IPC2bits.U1RXIP

/* IPC3 */
#define _U1TXIP IPC3bits.U1TXIP
#define _ECCSBEIP IPC3bits.ECCSBEIP
#define _NVMIP IPC3bits.NVMIP
#define _INT1IP IPC3bits.INT1IP

/* IPC4 */
#define _SI2C1IP IPC4bits.SI2C1IP
#define _MI2C1IP IPC4bits.MI2C1IP
#define _DMA2IP IPC4bits.DMA2IP
#define _CNCIP IPC4bits.CNCIP

/* IPC5 */
#define _INT2IP IPC5bits.INT2IP
#define _DMA3IP IPC5bits.DMA3IP
#define _CCP2IP IPC5bits.CCP2IP

/* IPC6 */
#define _CCT2IP IPC6bits.CCT2IP
#define _C1IP IPC6bits.C1IP
#define _INT3IP IPC6bits.INT3IP
#define _U2RXIP IPC6bits.U2RXIP

/* IPC7 */
#define _U2TXIP IPC7bits.U2TXIP
#define _SPI2RXIP IPC7bits.SPI2RXIP
#define _SPI2TXIP IPC7bits.SPI2TXIP
#define _C1RXIP IPC7bits.C1RXIP

/* IPC8 */
#define _CCP3IP IPC8bits.CCP3IP

/* IPC9 */
#define _CCT3IP IPC9bits.CCT3IP
#define _SI2C2IP IPC9bits.SI2C2IP
#define _MI2C2IP IPC9bits.MI2C2IP

/* IPC10 */
#define _CCP4IP IPC10bits.CCP4IP
#define _CCT4IP IPC10bits.CCT4IP
#define _CCP5IP IPC10bits.CCP5IP

/* IPC11 */
#define _CCT5IP IPC11bits.CCT5IP
#define _DMTIP IPC11bits.DMTIP
#define _CCP6IP IPC11bits.CCP6IP
#define _CCT6IP IPC11bits.CCT6IP

/* IPC12 */
#define _QEI1IP IPC12bits.QEI1IP
#define _U1EIP IPC12bits.U1EIP
#define _U2EIP IPC12bits.U2EIP
#define _CRCIP IPC12bits.CRCIP

/* IPC13 */
#define _C1TXIP IPC13bits.C1TXIP
#define _QEI2IP IPC13bits.QEI2IP

/* IPC14 */
#define _U3EIP IPC14bits.U3EIP
#define _U3RXIP IPC14bits.U3RXIP
#define _U3TXIP IPC14bits.U3TXIP
#define _SPI3RXIP IPC14bits.SPI3RXIP

/* IPC15 */
#define _SPI3TXIP IPC15bits.SPI3TXIP
#define _ICDIP IPC15bits.ICDIP
#define _JTAGIP IPC15bits.JTAGIP
#define _PTGSTEPIP IPC15bits.PTGSTEPIP

/* IPC16 */
#define _I2C1BCIP IPC16bits.I2C1BCIP
#define _I2C2BCIP IPC16bits.I2C2BCIP
#define _PWM1IP IPC16bits.PWM1IP

/* IPC17 */
#define _PWM2IP IPC17bits.PWM2IP
#define _PWM3IP IPC17bits.PWM3IP
#define _PWM4IP IPC17bits.PWM4IP
#define _PWM5IP IPC17bits.PWM5IP

/* IPC18 */
#define _PWM6IP IPC18bits.PWM6IP
#define _PWM7IP IPC18bits.PWM7IP
#define _PWM8IP IPC18bits.PWM8IP
#define _CNDIP IPC18bits.CNDIP

/* IPC19 */
#define _CMP1IP IPC19bits.CMP1IP
#define _CMP2IP IPC19bits.CMP2IP
#define _CMP3IP IPC19bits.CMP3IP

/* IPC20 */
#define _PTGWDTIP IPC20bits.PTGWDTIP
#define _PTG0IP IPC20bits.PTG0IP
#define _PTG1IP IPC20bits.PTG1IP

/* IPC21 */
#define _PTG2IP IPC21bits.PTG2IP
#define _PTG3IP IPC21bits.PTG3IP
#define _SENT1IP IPC21bits.SENT1IP
#define _SENT1EIP IPC21bits.SENT1EIP

/* IPC22 */
#define _SENT2IP IPC22bits.SENT2IP
#define _SENT2EIP IPC22bits.SENT2EIP
#define _ADCIP IPC22bits.ADCIP
#define _ADCAN0IP IPC22bits.ADCAN0IP

/* IPC23 */
#define _ADCAN1IP IPC23bits.ADCAN1IP
#define _ADCAN2IP IPC23bits.ADCAN2IP
#define _ADCAN3IP IPC23bits.ADCAN3IP
#define _ADCAN4IP IPC23bits.ADCAN4IP

/* IPC24 */
#define _ADCAN5IP IPC24bits.ADCAN5IP
#define _ADCAN6IP IPC24bits.ADCAN6IP
#define _ADCAN7IP IPC24bits.ADCAN7IP
#define _ADCAN8IP IPC24bits.ADCAN8IP

/* IPC25 */
#define _ADCAN9IP IPC25bits.ADCAN9IP
#define _ADCAN10IP IPC25bits.ADCAN10IP
#define _ADCAN11IP IPC25bits.ADCAN11IP
#define _ADCAN12IP IPC25bits.ADCAN12IP

/* IPC26 */
#define _ADCAN13IP IPC26bits.ADCAN13IP
#define _ADCAN14IP IPC26bits.ADCAN14IP
#define _ADCAN15IP IPC26bits.ADCAN15IP
#define _ADCAN16IP IPC26bits.ADCAN16IP

/* IPC27 */
#define _ADCAN17IP IPC27bits.ADCAN17IP
#define _ADCAN18IP IPC27bits.ADCAN18IP

/* IPC28 */
#define _ADFLTIP IPC28bits.ADFLTIP

/* IPC29 */
#define _ADCMP0IP IPC29bits.ADCMP0IP
#define _ADCMP1IP IPC29bits.ADCMP1IP
#define _ADCMP2IP IPC29bits.ADCMP2IP
#define _ADCMP3IP IPC29bits.ADCMP3IP

/* IPC30 */
#define _ADFLTR0IP IPC30bits.ADFLTR0IP
#define _ADFLTR1IP IPC30bits.ADFLTR1IP
#define _ADFLTR2IP IPC30bits.ADFLTR2IP
#define _ADFLTR3IP IPC30bits.ADFLTR3IP

/* IPC31 */
#define _CLC1PEIP IPC31bits.CLC1PEIP
#define _CLC2PEIP IPC31bits.CLC2PEIP
#define _SPI1IP IPC31bits.SPI1IP
#define _SPI2IP IPC31bits.SPI2IP

/* IPC32 */
#define _SPI3IP IPC32bits.SPI3IP

/* IPC35 */
#define _SI2C3IP IPC35bits.SI2C3IP
#define _MI2C3IP IPC35bits.MI2C3IP

/* IPC36 */
#define _I2C3BCIP IPC36bits.I2C3BCIP

/* IPC37 */
#define _CCP7IP IPC37bits.CCP7IP
#define _CCT7IP IPC37bits.CCT7IP

/* IPC38 */
#define _CCP8IP IPC38bits.CCP8IP
#define _CCT8IP IPC38bits.CCT8IP

/* IPC40 */
#define _ADC0EIP IPC40bits.ADC0EIP
#define _ADC1EIP IPC40bits.ADC1EIP

/* IPC42 */
#define _ADFIFOIP IPC42bits.ADFIFOIP
#define _PEVTAIP IPC42bits.PEVTAIP
#define _PEVTBIP IPC42bits.PEVTBIP
#define _PEVTCIP IPC42bits.PEVTCIP

/* IPC43 */
#define _PEVTDIP IPC43bits.PEVTDIP
#define _PEVTEIP IPC43bits.PEVTEIP
#define _PEVTFIP IPC43bits.PEVTFIP
#define _CLC3PEIP IPC43bits.CLC3PEIP

/* IPC44 */
#define _CLC4PEIP IPC44bits.CLC4PEIP
#define _CLC1NEIP IPC44bits.CLC1NEIP
#define _CLC2NEIP IPC44bits.CLC2NEIP
#define _CLC3NEIP IPC44bits.CLC3NEIP

/* IPC45 */
#define _CLC4NEIP IPC45bits.CLC4NEIP
#define _CCP9IP IPC45bits.CCP9IP
#define _CCT9IP IPC45bits.CCT9IP

/* IPC47 */
#define _U1EVTIP IPC47bits.U1EVTIP
#define _U2EVTIP IPC47bits.U2EVTIP
#define _U3EVTIP IPC47bits.U3EVTIP

/* IPC48 */
#define _ADCAN24IP IPC48bits.ADCAN24IP
#define _ADCAN25IP IPC48bits.ADCAN25IP

/* INTCON1 */
#define _OSCFAIL INTCON1bits.OSCFAIL
#define _STKERR INTCON1bits.STKERR
#define _ADDRERR INTCON1bits.ADDRERR
#define _MATHERR INTCON1bits.MATHERR
#define _DIV0ERR INTCON1bits.DIV0ERR
#define _SFTACERR INTCON1bits.SFTACERR
#define _COVTE INTCON1bits.COVTE
#define _OVBTE INTCON1bits.OVBTE
#define _OVATE INTCON1bits.OVATE
#define _COVBERR INTCON1bits.COVBERR
#define _COVAERR INTCON1bits.COVAERR
#define _OVBERR INTCON1bits.OVBERR
#define _OVAERR INTCON1bits.OVAERR
#define _NSTDIS INTCON1bits.NSTDIS

/* INTCON2 */
#define _INT0EP INTCON2bits.INT0EP
#define _INT1EP INTCON2bits.INT1EP
#define _INT2EP INTCON2bits.INT2EP
#define _INT3EP INTCON2bits.INT3EP
#define _AIVTEN INTCON2bits.AIVTEN
#define _SWTRAP INTCON2bits.SWTRAP
#define _DISI INTCON2bits.DISI
#define _GIE INTCON2bits.GIE

