gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
/* ADEISTATH */
#define _EISTAT16 ADEISTATHbits.EISTAT16
#define _EISTAT17 ADEISTATHbits.EISTAT17
#define _EISTAT18 ADEISTATHbits.EISTAT18
#define _EISTAT24 ADEISTATHbits.EISTAT24
#define _EISTAT25 ADEISTATHbits.EISTAT25

/* ADCON5L */
#define _C0PWR ADCON5Lbits.C0PWR
#define _C1PWR ADCON5Lbits.C1PWR
#define _SHRPWR ADCON5Lbits.SHRPWR
#define _C0RDY ADCON5Lbits.C0RDY
#define _C1RDY ADCON5Lbits.C1RDY
#define _SHRRDY ADCON5Lbits.SHRRDY

/* ADCON5H */
#define _C0CIE ADCON5Hbits.C0CIE
#define _C1CIE ADCON5Hbits.C1CIE
#define _SHRCIE ADCON5Hbits.SHRCIE
#define _WARMTIME ADCON5Hbits.WARMTIME
#define _C0C1E ADCON5Hbits.C0C1E
#define _C1C1E ADCON5Hbits.C1C1E

/* DACCTRL1L */
#define _FCLKDIV DACCTRL1Lbits.FCLKDIV
/* Bitname _CLKDIV cannot be defined because it is used by more than one SFR */
/* Bitname _CLKSEL cannot be defined because it is used by more than one SFR */
#define _DACSIDL DACCTRL1Lbits.DACSIDL
#define _DACON DACCTRL1Lbits.DACON
#define _FCLKDIV0 DACCTRL1Lbits.FCLKDIV0
#define _FCLKDIV1 DACCTRL1Lbits.FCLKDIV1
#define _FCLKDIV2 DACCTRL1Lbits.FCLKDIV2
/* Bitname _CLKDIV0 cannot be defined because it is used by more than one SFR */
/* Bitname _CLKDIV1 cannot be defined because it is used by more than one SFR */
/* Bitname _CLKSEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _CLKSEL1 cannot be defined because it is used by more than one SFR */

/* DACCTRL2L */
#define _TMODTIME DACCTRL2Lbits.TMODTIME
#define _TMODTIME0 DACCTRL2Lbits.TMODTIME0
#define _TMODTIME1 DACCTRL2Lbits.TMODTIME1
#define _TMODTIME2 DACCTRL2Lbits.TMODTIME2
#define _TMODTIME3 DACCTRL2Lbits.TMODTIME3
#define _TMODTIME4 DACCTRL2Lbits.TMODTIME4
#define _TMODTIME5 DACCTRL2Lbits.TMODTIME5
#define _TMODTIME6 DACCTRL2Lbits.TMODTIME6
#define _TMODTIME7 DACCTRL2Lbits.TMODTIME7
#define _TMODTIME8 DACCTRL2Lbits.TMODTIME8
#define _TMODTIME9 DACCTRL2Lbits.TMODTIME9

/* DACCTRL2H */
#define _SSTIME DACCTRL2Hbits.SSTIME
#define _SSTIME0 DACCTRL2Hbits.SSTIME0
#define _SSTIME1 DACCTRL2Hbits.SSTIME1
#define _SSTIME2 DACCTRL2Hbits.SSTIME2
#define _SSTIME3 DACCTRL2Hbits.SSTIME3
#define _SSTIME4 DACCTRL2Hbits.SSTIME4
#define _SSTIME5 DACCTRL2Hbits.SSTIME5
#define _SSTIME6 DACCTRL2Hbits.SSTIME6
#define _SSTIME7 DACCTRL2Hbits.SSTIME7
#define _SSTIME8 DACCTRL2Hbits.SSTIME8
#define _SSTIME9 DACCTRL2Hbits.SSTIME9

/* DAC1CONL */
/* Bitname _HYSSEL cannot be defined because it is used by more than one SFR */
/* Bitname _HYSPOL cannot be defined because it is used by more than one SFR */
/* Bitname _INSEL cannot be defined because it is used by more than one SFR */
/* Bitname _CMPPOL cannot be defined because it is used by more than one SFR */
/* Bitname _CMPSTAT cannot be defined because it is used by more than one SFR */
/* Bitname _FLTREN cannot be defined because it is used by more than one SFR */
/* Bitname _DACOEN cannot be defined because it is used by more than one SFR */
/* Bitname _CBE cannot be defined because it is used by more than one SFR */
/* Bitname _IRQM cannot be defined because it is used by more than one SFR */
/* Bitname _DACEN cannot be defined because it is used by more than one SFR */
/* Bitname _HYSSEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _HYSSEL1 cannot be defined because it is used by more than one SFR */
/* Bitname _IRQM0 cannot be defined because it is used by more than one SFR */
/* Bitname _IRQM1 cannot be defined because it is used by more than one SFR */

/* DAC1CONH */
/* Bitname _TMCB cannot be defined because it is used by more than one SFR */
/* Bitname _TMCB0 cannot be defined because it is used by more than one SFR */
/* Bitname _TMCB1 cannot be defined because it is used by more than one SFR */
/* Bitname _TMCB2 cannot be defined because it is used by more than one SFR */
/* Bitname _TMCB3 cannot be defined because it is used by more than one SFR */
/* Bitname _TMCB4 cannot be defined because it is used by more than one SFR */
/* Bitname _TMCB5 cannot be defined because it is used by more than one SFR */
/* Bitname _TMCB6 cannot be defined because it is used by more than one SFR */
/* Bitname _TMCB7 cannot be defined because it is used by more than one SFR */
/* Bitname _TMCB8 cannot be defined because it is used by more than one SFR */
/* Bitname _TMCB9 cannot be defined because it is used by more than one SFR */

/* DAC1DATL */
/* Bitname _DACLOW cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATL cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATL0 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATL1 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATL2 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATL3 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATL4 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATL5 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATL6 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATL7 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATL8 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATL9 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATL10 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATL11 cannot be defined because it is used by more than one SFR */

/* DAC1DATH */
/* Bitname _DACDAT cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATH cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATH0 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATH1 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATH2 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATH3 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATH4 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATH5 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATH6 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATH7 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATH8 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATH9 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATH10 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATH11 cannot be defined because it is used by more than one SFR */

/* SLP1CONL */
/* Bitname _SLPSTRT cannot be defined because it is used by more than one SFR */
/* Bitname _SLPSTOPB cannot be defined because it is used by more than one SFR */
/* Bitname _SLPSTOPA cannot be defined because it is used by more than one SFR */
/* Bitname _HCFSEL cannot be defined because it is used by more than one SFR */
/* Bitname _SLPSTRT0 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPSTRT1 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPSTRT2 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPSTRT3 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPSTOPB0 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPSTOPB1 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPSTOPB2 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPSTOPB3 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPSTOPA0 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPSTOPA1 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPSTOPA2 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPSTOPA3 cannot be defined because it is used by more than one SFR */
/* Bitname _HCFSEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _HCFSEL1 cannot be defined because it is used by more than one SFR */
/* Bitname _HCFSEL2 cannot be defined because it is used by more than one SFR */
/* Bitname _HCFSEL3 cannot be defined because it is used by more than one SFR */

/* SLP1CONH */
/* Bitname _PSE cannot be defined because it is used by more than one SFR */
/* Bitname _TWME cannot be defined because it is used by more than one SFR */
/* Bitname _HME cannot be defined because it is used by more than one SFR */
/* Bitname _SLOPEN cannot be defined because it is used by more than one SFR */

/* SLP1DAT */
/* Bitname _SLPDAT cannot be defined because it is used by more than one SFR */
/* Bitname _SLPDAT0 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPDAT1 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPDAT2 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPDAT3 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPDAT4 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPDAT5 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPDAT6 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPDAT7 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPDAT8 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPDAT9 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPDAT10 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPDAT11 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPDAT12 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPDAT13 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPDAT14 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPDAT15 cannot be defined because it is used by more than one SFR */

/* DAC2CONL */
/* Bitname _HYSSEL cannot be defined because it is used by more than one SFR */
/* Bitname _HYSPOL cannot be defined because it is used by more than one SFR */
/* Bitname _INSEL cannot be defined because it is used by more than one SFR */
/* Bitname _CMPPOL cannot be defined because it is used by more than one SFR */
/* Bitname _CMPSTAT cannot be defined because it is used by more than one SFR */
/* Bitname _FLTREN cannot be defined because it is used by more than one SFR */
/* Bitname _DACOEN cannot be defined because it is used by more than one SFR */
/* Bitname _CBE cannot be defined because it is used by more than one SFR */
/* Bitname _IRQM cannot be defined because it is used by more than one SFR */
/* Bitname _DACEN cannot be defined because it is used by more than one SFR */
/* Bitname _HYSSEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _HYSSEL1 cannot be defined because it is used by more than one SFR */
/* Bitname _IRQM0 cannot be defined because it is used by more than one SFR */
/* Bitname _IRQM1 cannot be defined because it is used by more than one SFR */

/* DAC2CONH */
/* Bitname _TMCB cannot be defined because it is used by more than one SFR */
/* Bitname _TMCB0 cannot be defined because it is used by more than one SFR */
/* Bitname _TMCB1 cannot be defined because it is used by more than one SFR */
/* Bitname _TMCB2 cannot be defined because it is used by more than one SFR */
/* Bitname _TMCB3 cannot be defined because it is used by more than one SFR */
/* Bitname _TMCB4 cannot be defined because it is used by more than one SFR */
/* Bitname _TMCB5 cannot be defined because it is used by more than one SFR */
/* Bitname _TMCB6 cannot be defined because it is used by more than one SFR */
/* Bitname _TMCB7 cannot be defined because it is used by more than one SFR */
/* Bitname _TMCB8 cannot be defined because it is used by more than one SFR */
/* Bitname _TMCB9 cannot be defined because it is used by more than one SFR */

/* DAC2DATL */
/* Bitname _DACLOW cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATL cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATL0 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATL1 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATL2 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATL3 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATL4 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATL5 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATL6 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATL7 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATL8 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATL9 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATL10 cannot be defined because it is used by more than one SFR */
/* Bitname _DACDATL11 cannot be defined because it is used by more than one SFR */

