gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
/* SLP3CONL */
/* Bitname _SLPSTRT cannot be defined because it is used by more than one SFR */
/* Bitname _SLPSTOPB cannot be defined because it is used by more than one SFR */
/* Bitname _SLPSTOPA cannot be defined because it is used by more than one SFR */
/* Bitname _HCFSEL cannot be defined because it is used by more than one SFR */
/* Bitname _SLPSTRT0 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPSTRT1 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPSTRT2 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPSTRT3 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPSTOPB0 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPSTOPB1 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPSTOPB2 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPSTOPB3 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPSTOPA0 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPSTOPA1 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPSTOPA2 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPSTOPA3 cannot be defined because it is used by more than one SFR */
/* Bitname _HCFSEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _HCFSEL1 cannot be defined because it is used by more than one SFR */
/* Bitname _HCFSEL2 cannot be defined because it is used by more than one SFR */
/* Bitname _HCFSEL3 cannot be defined because it is used by more than one SFR */

/* SLP3CONH */
/* Bitname _PSE cannot be defined because it is used by more than one SFR */
/* Bitname _TWME cannot be defined because it is used by more than one SFR */
/* Bitname _HME cannot be defined because it is used by more than one SFR */
/* Bitname _SLOPEN cannot be defined because it is used by more than one SFR */

/* SLP3DAT */
/* Bitname _SLPDAT cannot be defined because it is used by more than one SFR */
/* Bitname _SLPDAT0 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPDAT1 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPDAT2 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPDAT3 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPDAT4 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPDAT5 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPDAT6 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPDAT7 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPDAT8 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPDAT9 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPDAT10 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPDAT11 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPDAT12 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPDAT13 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPDAT14 cannot be defined because it is used by more than one SFR */
/* Bitname _SLPDAT15 cannot be defined because it is used by more than one SFR */

/* VREGCON */
#define _VREG1OV VREGCONbits.VREG1OV
#define _VREG2OV VREGCONbits.VREG2OV
#define _VREG3OV VREGCONbits.VREG3OV
#define _LPWREN VREGCONbits.LPWREN

/* RPCON */
#define _IOLOCK RPCONbits.IOLOCK

/* RPINR0 */
#define _INT1R RPINR0bits.INT1R

/* RPINR1 */
#define _INT2R RPINR1bits.INT2R
#define _INT3R RPINR1bits.INT3R

/* RPINR2 */
#define _T1CKR RPINR2bits.T1CKR

/* RPINR3 */
#define _TCKI1R RPINR3bits.TCKI1R
#define _ICM1R RPINR3bits.ICM1R

/* RPINR4 */
#define _TCKI2R RPINR4bits.TCKI2R
#define _ICM2R RPINR4bits.ICM2R

/* RPINR5 */
#define _TCKI3R RPINR5bits.TCKI3R
#define _ICM3R RPINR5bits.ICM3R

/* RPINR6 */
#define _TCKI4R RPINR6bits.TCKI4R
#define _ICM4R RPINR6bits.ICM4R

/* RPINR7 */
#define _TCKI5R RPINR7bits.TCKI5R
#define _ICM5R RPINR7bits.ICM5R

/* RPINR8 */
#define _TCKI6R RPINR8bits.TCKI6R
#define _ICM6R RPINR8bits.ICM6R

/* RPINR9 */
#define _TCKI7R RPINR9bits.TCKI7R
#define _ICM7R RPINR9bits.ICM7R

/* RPINR10 */
#define _TCKI8R RPINR10bits.TCKI8R
#define _ICM8R RPINR10bits.ICM8R

/* RPINR11 */
#define _OCFAR RPINR11bits.OCFAR
#define _OCFBR RPINR11bits.OCFBR

/* RPINR12 */
#define _PCI8R RPINR12bits.PCI8R
#define _PCI9R RPINR12bits.PCI9R

/* RPINR13 */
#define _PCI10R RPINR13bits.PCI10R
#define _PCI11R RPINR13bits.PCI11R

/* RPINR14 */
#define _QEIA1R RPINR14bits.QEIA1R
#define _QEIB1R RPINR14bits.QEIB1R

/* RPINR15 */
#define _QEINDX1R RPINR15bits.QEINDX1R
#define _QEIHOM1R RPINR15bits.QEIHOM1R

/* RPINR16 */
#define _QEIA2R RPINR16bits.QEIA2R
#define _QEIB2R RPINR16bits.QEIB2R

/* RPINR17 */
#define _QEINDX2R RPINR17bits.QEINDX2R
#define _QEIHOM2R RPINR17bits.QEIHOM2R

/* RPINR18 */
#define _U1RXR RPINR18bits.U1RXR
#define _U1DSRR RPINR18bits.U1DSRR

/* RPINR19 */
#define _U2RXR RPINR19bits.U2RXR
#define _U2DSRR RPINR19bits.U2DSRR

/* RPINR20 */
#define _SDI1R RPINR20bits.SDI1R
#define _SCK1R RPINR20bits.SCK1R

/* RPINR21 */
#define _SS1R RPINR21bits.SS1R
#define _REFOIR RPINR21bits.REFOIR

/* RPINR22 */
#define _SDI2R RPINR22bits.SDI2R
#define _SCK2R RPINR22bits.SCK2R

/* RPINR23 */
#define _SS2R RPINR23bits.SS2R

/* RPINR26 */
#define _CAN1RXR RPINR26bits.CAN1RXR

/* RPINR27 */
#define _U3RXR RPINR27bits.U3RXR
#define _U3DSRR RPINR27bits.U3DSRR

/* RPINR29 */
#define _SDI3R RPINR29bits.SDI3R
#define _SCK3R RPINR29bits.SCK3R

/* RPINR30 */
#define _SS3R RPINR30bits.SS3R

/* RPINR32 */
#define _TCKI9R RPINR32bits.TCKI9R

/* RPINR33 */
#define _ICM9R RPINR33bits.ICM9R

/* RPINR37 */
#define _OCFCR RPINR37bits.OCFCR
#define _PCI17R RPINR37bits.PCI17R

/* RPINR38 */
#define _PCI18R RPINR38bits.PCI18R

/* RPINR42 */
#define _PCI12R RPINR42bits.PCI12R
#define _PCI13R RPINR42bits.PCI13R

/* RPINR43 */
#define _PCI14R RPINR43bits.PCI14R
#define _PCI15R RPINR43bits.PCI15R

