gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
/* ANSELD */
#define _ANSELD10 ANSELDbits.ANSELD10
#define _ANSELD13 ANSELDbits.ANSELD13

/* TRISD */
#define _TRISD1 TRISDbits.TRISD1
#define _TRISD8 TRISDbits.TRISD8
#define _TRISD10 TRISDbits.TRISD10
#define _TRISD13 TRISDbits.TRISD13

/* PORTD */
#define _RD1 PORTDbits.RD1
#define _RD8 PORTDbits.RD8
#define _RD10 PORTDbits.RD10
#define _RD13 PORTDbits.RD13

/* LATD */
#define _LATD1 LATDbits.LATD1
#define _LATD8 LATDbits.LATD8
#define _LATD10 LATDbits.LATD10
#define _LATD13 LATDbits.LATD13

/* ODCD */
#define _ODCD1 ODCDbits.ODCD1
#define _ODCD8 ODCDbits.ODCD8
#define _ODCD10 ODCDbits.ODCD10
#define _ODCD13 ODCDbits.ODCD13

/* CNPUD */
#define _CNPUD1 CNPUDbits.CNPUD1
#define _CNPUD8 CNPUDbits.CNPUD8
#define _CNPUD10 CNPUDbits.CNPUD10
#define _CNPUD13 CNPUDbits.CNPUD13

/* CNPDD */
#define _CNPDD1 CNPDDbits.CNPDD1
#define _CNPDD8 CNPDDbits.CNPDD8
#define _CNPDD10 CNPDDbits.CNPDD10
#define _CNPDD13 CNPDDbits.CNPDD13

/* CNCOND */
/* Bitname _CNSTYLE cannot be defined because it is used by more than one SFR */
/* Bitname _ON cannot be defined because it is used by more than one SFR */

/* CNEN0D */
#define _CNEN0D1 CNEN0Dbits.CNEN0D1
#define _CNEN0D8 CNEN0Dbits.CNEN0D8
#define _CNEN0D10 CNEN0Dbits.CNEN0D10
#define _CNEN0D13 CNEN0Dbits.CNEN0D13

/* CNSTATD */
#define _CNSTATD1 CNSTATDbits.CNSTATD1
#define _CNSTATD8 CNSTATDbits.CNSTATD8
#define _CNSTATD10 CNSTATDbits.CNSTATD10
#define _CNSTATD13 CNSTATDbits.CNSTATD13

/* CNEN1D */
#define _CNEN1D1 CNEN1Dbits.CNEN1D1
#define _CNEN1D8 CNEN1Dbits.CNEN1D8
#define _CNEN1D10 CNEN1Dbits.CNEN1D10
#define _CNEN1D13 CNEN1Dbits.CNEN1D13

/* CNFD */
#define _CNFD1 CNFDbits.CNFD1
#define _CNFD8 CNFDbits.CNFD8
#define _CNFD10 CNFDbits.CNFD10
#define _CNFD13 CNFDbits.CNFD13

/* MBISTCON */
#define _MBISTEN MBISTCONbits.MBISTEN
#define _MBISTSTAT MBISTCONbits.MBISTSTAT
#define _MBISTDONE MBISTCONbits.MBISTDONE
/* Bitname _FLTINJ cannot be defined because it is used by more than one SFR */

/* U3MODE */
/* Bitname _MOD cannot be defined because it is used by more than one SFR */
/* Bitname _URXEN cannot be defined because it is used by more than one SFR */
/* Bitname _UTXEN cannot be defined because it is used by more than one SFR */
/* Bitname _ABAUD cannot be defined because it is used by more than one SFR */
/* Bitname _BRGH cannot be defined because it is used by more than one SFR */
/* Bitname _UTXBRK cannot be defined because it is used by more than one SFR */
/* Bitname _BRKOVR cannot be defined because it is used by more than one SFR */
/* Bitname _RXBIMD cannot be defined because it is used by more than one SFR */
/* Bitname _WAKE cannot be defined because it is used by more than one SFR */
/* Bitname _USIDL cannot be defined because it is used by more than one SFR */
/* Bitname _UARTEN cannot be defined because it is used by more than one SFR */
/* Bitname _MOD0 cannot be defined because it is used by more than one SFR */
/* Bitname _MOD1 cannot be defined because it is used by more than one SFR */
/* Bitname _MOD2 cannot be defined because it is used by more than one SFR */
/* Bitname _MOD3 cannot be defined because it is used by more than one SFR */

/* U3MODEH */
/* Bitname _FLO cannot be defined because it is used by more than one SFR */
/* Bitname _UTXINV cannot be defined because it is used by more than one SFR */
/* Bitname _C0EN cannot be defined because it is used by more than one SFR */
/* Bitname _STSEL cannot be defined because it is used by more than one SFR */
/* Bitname _URXINV cannot be defined because it is used by more than one SFR */
/* Bitname _RUNOVF cannot be defined because it is used by more than one SFR */
/* Bitname _HALFDPLX cannot be defined because it is used by more than one SFR */
/* Bitname _BCLKSEL cannot be defined because it is used by more than one SFR */
/* Bitname _BCLKMOD cannot be defined because it is used by more than one SFR */
/* Bitname _ACTIVE cannot be defined because it is used by more than one SFR */
/* Bitname _SLPEN cannot be defined because it is used by more than one SFR */
/* Bitname _FLO0 cannot be defined because it is used by more than one SFR */
/* Bitname _FLO1 cannot be defined because it is used by more than one SFR */
/* Bitname _STSEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _STSEL1 cannot be defined because it is used by more than one SFR */
/* Bitname _BCLKSEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _BCLKSEL1 cannot be defined because it is used by more than one SFR */

/* U3STA */
/* Bitname _TXCIF cannot be defined because it is used by more than one SFR */
/* Bitname _OERR cannot be defined because it is used by more than one SFR */
/* Bitname _RXBKIF cannot be defined because it is used by more than one SFR */
/* Bitname _FERR cannot be defined because it is used by more than one SFR */
/* Bitname _CERIF cannot be defined because it is used by more than one SFR */
/* Bitname _ABDOVF cannot be defined because it is used by more than one SFR */
/* Bitname _PERR cannot be defined because it is used by more than one SFR */
/* Bitname _TRMT cannot be defined because it is used by more than one SFR */
/* Bitname _TXCIE cannot be defined because it is used by more than one SFR */
/* Bitname _OERIE cannot be defined because it is used by more than one SFR */
/* Bitname _RXBKIE cannot be defined because it is used by more than one SFR */
/* Bitname _FERIE cannot be defined because it is used by more than one SFR */
/* Bitname _CERIE cannot be defined because it is used by more than one SFR */
/* Bitname _ABDOVE cannot be defined because it is used by more than one SFR */
/* Bitname _PERIE cannot be defined because it is used by more than one SFR */
/* Bitname _TXMTIE cannot be defined because it is used by more than one SFR */

/* U3STAH */
/* Bitname _URXBF cannot be defined because it is used by more than one SFR */
/* Bitname _URXBE cannot be defined because it is used by more than one SFR */
/* Bitname _XON cannot be defined because it is used by more than one SFR */
/* Bitname _RIDLE cannot be defined because it is used by more than one SFR */
/* Bitname _UTXBF cannot be defined because it is used by more than one SFR */
/* Bitname _UTXBE cannot be defined because it is used by more than one SFR */
/* Bitname _STPMD cannot be defined because it is used by more than one SFR */
/* Bitname _TXWRE cannot be defined because it is used by more than one SFR */
/* Bitname _URXISEL cannot be defined because it is used by more than one SFR */
/* Bitname _UTXISEL cannot be defined because it is used by more than one SFR */
/* Bitname _URXISEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _URXISEL1 cannot be defined because it is used by more than one SFR */
/* Bitname _URXISEL2 cannot be defined because it is used by more than one SFR */
/* Bitname _UTXISEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _UTXISEL1 cannot be defined because it is used by more than one SFR */
/* Bitname _UTXISEL2 cannot be defined because it is used by more than one SFR */

/* U3BRG */
/* Bitname _BRG cannot be defined because it is used by more than one SFR */
/* Bitname _BRG0 cannot be defined because it is used by more than one SFR */
/* Bitname _BRG1 cannot be defined because it is used by more than one SFR */
/* Bitname _BRG2 cannot be defined because it is used by more than one SFR */
/* Bitname _BRG3 cannot be defined because it is used by more than one SFR */
/* Bitname _BRG4 cannot be defined because it is used by more than one SFR */
/* Bitname _BRG5 cannot be defined because it is used by more than one SFR */
/* Bitname _BRG6 cannot be defined because it is used by more than one SFR */
/* Bitname _BRG7 cannot be defined because it is used by more than one SFR */
/* Bitname _BRG8 cannot be defined because it is used by more than one SFR */
/* Bitname _BRG9 cannot be defined because it is used by more than one SFR */
/* Bitname _BRG10 cannot be defined because it is used by more than one SFR */
/* Bitname _BRG11 cannot be defined because it is used by more than one SFR */
/* Bitname _BRG12 cannot be defined because it is used by more than one SFR */
/* Bitname _BRG13 cannot be defined because it is used by more than one SFR */
/* Bitname _BRG14 cannot be defined because it is used by more than one SFR */
/* Bitname _BRG15 cannot be defined because it is used by more than one SFR */

