gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
/* U3BRGH */
/* Bitname _BRG cannot be defined because it is used by more than one SFR */
/* Bitname _BRG16 cannot be defined because it is used by more than one SFR */
/* Bitname _BRG1 cannot be defined because it is used by more than one SFR */
/* Bitname _BRG18 cannot be defined because it is used by more than one SFR */
/* Bitname _BRG19 cannot be defined because it is used by more than one SFR */

/* U3RXREG */
/* Bitname _RXREG cannot be defined because it is used by more than one SFR */
/* Bitname _RXREG0 cannot be defined because it is used by more than one SFR */
/* Bitname _RXREG1 cannot be defined because it is used by more than one SFR */
/* Bitname _RXREG2 cannot be defined because it is used by more than one SFR */
/* Bitname _RXREG3 cannot be defined because it is used by more than one SFR */
/* Bitname _RXREG4 cannot be defined because it is used by more than one SFR */
/* Bitname _RXREG5 cannot be defined because it is used by more than one SFR */
/* Bitname _RXREG6 cannot be defined because it is used by more than one SFR */
/* Bitname _RXREG7 cannot be defined because it is used by more than one SFR */

/* U3TXREG */
/* Bitname _TXREG cannot be defined because it is used by more than one SFR */
/* Bitname _LAST cannot be defined because it is used by more than one SFR */
/* Bitname _TXREG0 cannot be defined because it is used by more than one SFR */
/* Bitname _TXREG1 cannot be defined because it is used by more than one SFR */
/* Bitname _TXREG2 cannot be defined because it is used by more than one SFR */
/* Bitname _TXREG3 cannot be defined because it is used by more than one SFR */
/* Bitname _TXREG4 cannot be defined because it is used by more than one SFR */
/* Bitname _TXREG5 cannot be defined because it is used by more than one SFR */
/* Bitname _TXREG6 cannot be defined because it is used by more than one SFR */
/* Bitname _TXREG7 cannot be defined because it is used by more than one SFR */

/* U3P1 */
/* Bitname _P1 cannot be defined because it is used by more than one SFR */
/* Bitname _P10 cannot be defined because it is used by more than one SFR */
/* Bitname _P11 cannot be defined because it is used by more than one SFR */
/* Bitname _P12 cannot be defined because it is used by more than one SFR */
/* Bitname _P13 cannot be defined because it is used by more than one SFR */
/* Bitname _P14 cannot be defined because it is used by more than one SFR */
/* Bitname _P15 cannot be defined because it is used by more than one SFR */
/* Bitname _P16 cannot be defined because it is used by more than one SFR */
/* Bitname _P17 cannot be defined because it is used by more than one SFR */
/* Bitname _P18 cannot be defined because it is used by more than one SFR */

/* U3P2 */
/* Bitname _P2 cannot be defined because it is used by more than one SFR */
/* Bitname _P20 cannot be defined because it is used by more than one SFR */
/* Bitname _P21 cannot be defined because it is used by more than one SFR */
/* Bitname _P22 cannot be defined because it is used by more than one SFR */
/* Bitname _P23 cannot be defined because it is used by more than one SFR */
/* Bitname _P24 cannot be defined because it is used by more than one SFR */
/* Bitname _P25 cannot be defined because it is used by more than one SFR */
/* Bitname _P26 cannot be defined because it is used by more than one SFR */
/* Bitname _P27 cannot be defined because it is used by more than one SFR */
/* Bitname _P28 cannot be defined because it is used by more than one SFR */

/* U3P3 */
/* Bitname _P3 cannot be defined because it is used by more than one SFR */
/* Bitname _P30 cannot be defined because it is used by more than one SFR */
/* Bitname _P31 cannot be defined because it is used by more than one SFR */
/* Bitname _P32 cannot be defined because it is used by more than one SFR */
/* Bitname _P33 cannot be defined because it is used by more than one SFR */
/* Bitname _P34 cannot be defined because it is used by more than one SFR */
/* Bitname _P35 cannot be defined because it is used by more than one SFR */
/* Bitname _P36 cannot be defined because it is used by more than one SFR */
/* Bitname _P37 cannot be defined because it is used by more than one SFR */
/* Bitname _P38 cannot be defined because it is used by more than one SFR */
/* Bitname _P39 cannot be defined because it is used by more than one SFR */
/* Bitname _P310 cannot be defined because it is used by more than one SFR */
/* Bitname _P311 cannot be defined because it is used by more than one SFR */
/* Bitname _P312 cannot be defined because it is used by more than one SFR */
/* Bitname _P313 cannot be defined because it is used by more than one SFR */
/* Bitname _P314 cannot be defined because it is used by more than one SFR */
/* Bitname _P315 cannot be defined because it is used by more than one SFR */

/* U3P3H */
/* Bitname _P3H cannot be defined because it is used by more than one SFR */
/* Bitname _P316 cannot be defined because it is used by more than one SFR */
/* Bitname _P317 cannot be defined because it is used by more than one SFR */
/* Bitname _P318 cannot be defined because it is used by more than one SFR */
/* Bitname _P319 cannot be defined because it is used by more than one SFR */
/* Bitname _P320 cannot be defined because it is used by more than one SFR */
/* Bitname _P321 cannot be defined because it is used by more than one SFR */
/* Bitname _P322 cannot be defined because it is used by more than one SFR */
/* Bitname _P323 cannot be defined because it is used by more than one SFR */

/* U3TXCHK */
/* Bitname _TXCHK cannot be defined because it is used by more than one SFR */
/* Bitname _TXCHK0 cannot be defined because it is used by more than one SFR */
/* Bitname _TXCHK1 cannot be defined because it is used by more than one SFR */
/* Bitname _TXCHK2 cannot be defined because it is used by more than one SFR */
/* Bitname _TXCHK3 cannot be defined because it is used by more than one SFR */
/* Bitname _TXCHK4 cannot be defined because it is used by more than one SFR */
/* Bitname _TXCHK5 cannot be defined because it is used by more than one SFR */
/* Bitname _TXCHK6 cannot be defined because it is used by more than one SFR */
/* Bitname _TXCHK7 cannot be defined because it is used by more than one SFR */

/* U3RXCHK */
/* Bitname _RXCHK cannot be defined because it is used by more than one SFR */

/* U3SCCON */
/* Bitname _PTRCL cannot be defined because it is used by more than one SFR */
/* Bitname _T0PD cannot be defined because it is used by more than one SFR */
/* Bitname _CONV cannot be defined because it is used by more than one SFR */
/* Bitname _TXRPT cannot be defined because it is used by more than one SFR */
/* Bitname _TXRPT0 cannot be defined because it is used by more than one SFR */
/* Bitname _TXRPT1 cannot be defined because it is used by more than one SFR */

/* U3SCINT */
/* Bitname _GTCIE cannot be defined because it is used by more than one SFR */
/* Bitname _WTCIE cannot be defined because it is used by more than one SFR */
/* Bitname _BTCIE cannot be defined because it is used by more than one SFR */
/* Bitname _TXRPTIE cannot be defined because it is used by more than one SFR */
/* Bitname _RXRPTIE cannot be defined because it is used by more than one SFR */
/* Bitname _GTCIF cannot be defined because it is used by more than one SFR */
/* Bitname _WTCIF cannot be defined because it is used by more than one SFR */
/* Bitname _BTCIF cannot be defined because it is used by more than one SFR */
/* Bitname _TXRPTIF cannot be defined because it is used by more than one SFR */
/* Bitname _RXRPTIF cannot be defined because it is used by more than one SFR */

/* U3INT */
/* Bitname _ABDIE cannot be defined because it is used by more than one SFR */
/* Bitname _ABDIF cannot be defined because it is used by more than one SFR */
/* Bitname _WUIF cannot be defined because it is used by more than one SFR */

/* I2C3CON1 */
/* Bitname _SEN cannot be defined because it is used by more than one SFR */
/* Bitname _RSEN cannot be defined because it is used by more than one SFR */
/* Bitname _PEN cannot be defined because it is used by more than one SFR */
/* Bitname _RCEN cannot be defined because it is used by more than one SFR */
/* Bitname _ACKEN cannot be defined because it is used by more than one SFR */
/* Bitname _ACKDT cannot be defined because it is used by more than one SFR */
/* Bitname _STREN cannot be defined because it is used by more than one SFR */
/* Bitname _GCEN cannot be defined because it is used by more than one SFR */
/* Bitname _SMEN cannot be defined because it is used by more than one SFR */
/* Bitname _DISSLW cannot be defined because it is used by more than one SFR */
/* Bitname _A10M cannot be defined because it is used by more than one SFR */
/* Bitname _STRICT cannot be defined because it is used by more than one SFR */
/* Bitname _SCLREL cannot be defined because it is used by more than one SFR */
/* Bitname _I2CSIDL cannot be defined because it is used by more than one SFR */
/* Bitname _I2CEN cannot be defined because it is used by more than one SFR */

