gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
/* I2C3CONL */
/* Bitname _SEN cannot be defined because it is used by more than one SFR */
/* Bitname _RSEN cannot be defined because it is used by more than one SFR */
/* Bitname _PEN cannot be defined because it is used by more than one SFR */
/* Bitname _RCEN cannot be defined because it is used by more than one SFR */
/* Bitname _ACKEN cannot be defined because it is used by more than one SFR */
/* Bitname _ACKDT cannot be defined because it is used by more than one SFR */
/* Bitname _STREN cannot be defined because it is used by more than one SFR */
/* Bitname _GCEN cannot be defined because it is used by more than one SFR */
/* Bitname _SMEN cannot be defined because it is used by more than one SFR */
/* Bitname _DISSLW cannot be defined because it is used by more than one SFR */
/* Bitname _A10M cannot be defined because it is used by more than one SFR */
/* Bitname _STRICT cannot be defined because it is used by more than one SFR */
/* Bitname _SCLREL cannot be defined because it is used by more than one SFR */
/* Bitname _I2CSIDL cannot be defined because it is used by more than one SFR */
/* Bitname _I2CEN cannot be defined because it is used by more than one SFR */

/* I2C3CON2 */
/* Bitname _DHEN cannot be defined because it is used by more than one SFR */
/* Bitname _AHEN cannot be defined because it is used by more than one SFR */
/* Bitname _SBCDE cannot be defined because it is used by more than one SFR */
/* Bitname _SDAHT cannot be defined because it is used by more than one SFR */
/* Bitname _BOEN cannot be defined because it is used by more than one SFR */
/* Bitname _SCIE cannot be defined because it is used by more than one SFR */
/* Bitname _PCIE cannot be defined because it is used by more than one SFR */

/* I2C3CONH */
/* Bitname _DHEN cannot be defined because it is used by more than one SFR */
/* Bitname _AHEN cannot be defined because it is used by more than one SFR */
/* Bitname _SBCDE cannot be defined because it is used by more than one SFR */
/* Bitname _SDAHT cannot be defined because it is used by more than one SFR */
/* Bitname _BOEN cannot be defined because it is used by more than one SFR */
/* Bitname _SCIE cannot be defined because it is used by more than one SFR */
/* Bitname _PCIE cannot be defined because it is used by more than one SFR */

/* I2C3STAT */
/* Bitname _TBF cannot be defined because it is used by more than one SFR */
/* Bitname _RBF cannot be defined because it is used by more than one SFR */
/* Bitname _R_W cannot be defined because it is used by more than one SFR */
/* Bitname _S cannot be defined because it is used by more than one SFR */
/* Bitname _P cannot be defined because it is used by more than one SFR */
/* Bitname _D_A cannot be defined because it is used by more than one SFR */
/* Bitname _I2COV cannot be defined because it is used by more than one SFR */
/* Bitname _IWCOL cannot be defined because it is used by more than one SFR */
/* Bitname _ADD10 cannot be defined because it is used by more than one SFR */
/* Bitname _GCSTAT cannot be defined because it is used by more than one SFR */
/* Bitname _BCL cannot be defined because it is used by more than one SFR */
/* Bitname _ACKTIM cannot be defined because it is used by more than one SFR */
/* Bitname _TRSTAT cannot be defined because it is used by more than one SFR */
/* Bitname _ACKSTAT cannot be defined because it is used by more than one SFR */

/* I2C3ADD */
/* Bitname _ADD cannot be defined because it is used by more than one SFR */

/* I2C3MSK */
/* Bitname _AMSK cannot be defined because it is used by more than one SFR */
/* Bitname _AMSK0 cannot be defined because it is used by more than one SFR */
/* Bitname _AMSK1 cannot be defined because it is used by more than one SFR */
/* Bitname _AMSK2 cannot be defined because it is used by more than one SFR */
/* Bitname _AMSK3 cannot be defined because it is used by more than one SFR */
/* Bitname _AMSK4 cannot be defined because it is used by more than one SFR */
/* Bitname _AMSK5 cannot be defined because it is used by more than one SFR */
/* Bitname _AMSK6 cannot be defined because it is used by more than one SFR */
/* Bitname _AMSK7 cannot be defined because it is used by more than one SFR */
/* Bitname _AMSK8 cannot be defined because it is used by more than one SFR */
/* Bitname _AMSK9 cannot be defined because it is used by more than one SFR */

/* I2C3TRN */
/* Bitname _I2CTXDATA cannot be defined because it is used by more than one SFR */

/* I2C3RCV */
/* Bitname _I2CRXDATA cannot be defined because it is used by more than one SFR */

/* RCON */
#define _POR RCONbits.POR
#define _BOR RCONbits.BOR
#define _IDLE RCONbits.IDLE
#define _SLEEP RCONbits.SLEEP
#define _WDTO RCONbits.WDTO
#define _SWR RCONbits.SWR
#define _EXTR RCONbits.EXTR
#define _VREGS RCONbits.VREGS
#define _CM RCONbits.CM
#define _IOPUWR RCONbits.IOPUWR
#define _TRAPR RCONbits.TRAPR

/* OSCCON */
#define _OSWEN OSCCONbits.OSWEN
#define _CF OSCCONbits.CF
/* Bitname _LOCK cannot be defined because it is used by more than one SFR */
#define _CLKLOCK OSCCONbits.CLKLOCK
#define _NOSC OSCCONbits.NOSC
#define _COSC OSCCONbits.COSC
#define _NOSC0 OSCCONbits.NOSC0
#define _NOSC1 OSCCONbits.NOSC1
#define _NOSC2 OSCCONbits.NOSC2
#define _COSC0 OSCCONbits.COSC0
#define _COSC1 OSCCONbits.COSC1
#define _COSC2 OSCCONbits.COSC2

/* CLKDIV */
#define _PLLPRE CLKDIVbits.PLLPRE
#define _FRCDIV CLKDIVbits.FRCDIV
#define _DOZEN CLKDIVbits.DOZEN
#define _DOZE CLKDIVbits.DOZE
#define _ROI CLKDIVbits.ROI
#define _PLLPRE0 CLKDIVbits.PLLPRE0
#define _PLLPRE1 CLKDIVbits.PLLPRE1
#define _PLLPRE2 CLKDIVbits.PLLPRE2
#define _PLLPRE3 CLKDIVbits.PLLPRE3
#define _PLLPRE4 CLKDIVbits.PLLPRE4
#define _PLLPRE5 CLKDIVbits.PLLPRE5
#define _FRCDIV0 CLKDIVbits.FRCDIV0
#define _FRCDIV1 CLKDIVbits.FRCDIV1
#define _FRCDIV2 CLKDIVbits.FRCDIV2
#define _DOZE0 CLKDIVbits.DOZE0
#define _DOZE1 CLKDIVbits.DOZE1
#define _DOZE2 CLKDIVbits.DOZE2

/* PLLFBD */
#define _PLLFBDIV PLLFBDbits.PLLFBDIV
#define _PLLFBDIV0 PLLFBDbits.PLLFBDIV0
#define _PLLFBDIV1 PLLFBDbits.PLLFBDIV1
#define _PLLFBDIV2 PLLFBDbits.PLLFBDIV2
#define _PLLFBDIV3 PLLFBDbits.PLLFBDIV3
#define _PLLFBDIV4 PLLFBDbits.PLLFBDIV4
#define _PLLFBDIV5 PLLFBDbits.PLLFBDIV5
#define _PLLFBDIV6 PLLFBDbits.PLLFBDIV6
#define _PLLFBDIV7 PLLFBDbits.PLLFBDIV7
#define _PLLFBDIV8 PLLFBDbits.PLLFBDIV8
#define _PLLFBDIV9 PLLFBDbits.PLLFBDIV9
#define _PLLFBDIV10 PLLFBDbits.PLLFBDIV10
#define _PLLFBDIV11 PLLFBDbits.PLLFBDIV11

/* PLLDIV */
#define _POST2DIV PLLDIVbits.POST2DIV
#define _POST1DIV PLLDIVbits.POST1DIV
#define _VCODIV PLLDIVbits.VCODIV
#define _POST2DIV0 PLLDIVbits.POST2DIV0
#define _POST2DIV1 PLLDIVbits.POST2DIV1
#define _POST2DIV2 PLLDIVbits.POST2DIV2
#define _POST1DIV0 PLLDIVbits.POST1DIV0
#define _POST1DIV1 PLLDIVbits.POST1DIV1
#define _POST1DIV2 PLLDIVbits.POST1DIV2
#define _VCODIV0 PLLDIVbits.VCODIV0
#define _VCODIV1 PLLDIVbits.VCODIV1

/* OSCTUN */
/* Bitname _TUN cannot be defined because it is used by more than one SFR */
#define _TUN0 OSCTUNbits.TUN0
#define _TUN1 OSCTUNbits.TUN1
#define _TUN2 OSCTUNbits.TUN2
#define _TUN3 OSCTUNbits.TUN3
#define _TUN4 OSCTUNbits.TUN4
#define _TUN5 OSCTUNbits.TUN5

/* ACLKCON1 */
#define _APLLPRE ACLKCON1bits.APLLPRE
#define _FRCSEL ACLKCON1bits.FRCSEL
#define _ASRCSEL ACLKCON1bits.ASRCSEL
#define _APLLCK ACLKCON1bits.APLLCK
#define _APLLEN ACLKCON1bits.APLLEN
#define _APLLPRE0 ACLKCON1bits.APLLPRE0
#define _APLLPRE1 ACLKCON1bits.APLLPRE1
#define _APLLPRE2 ACLKCON1bits.APLLPRE2
#define _APLLPRE3 ACLKCON1bits.APLLPRE3
#define _APLLPRE4 ACLKCON1bits.APLLPRE4
#define _APLLPRE5 ACLKCON1bits.APLLPRE5

