gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
#define _SENT2DATH_DATA12_POSITION               0x0000000A
#define _SENT2DATH_DATA12_MASK                   0x00000400
#define _SENT2DATH_DATA12_LENGTH                 0x00000001

#define _SENT2DATH_DATA13_POSITION               0x0000000B
#define _SENT2DATH_DATA13_MASK                   0x00000800
#define _SENT2DATH_DATA13_LENGTH                 0x00000001

#define _SENT2DATH_STAT0_POSITION                0x0000000C
#define _SENT2DATH_STAT0_MASK                    0x00001000
#define _SENT2DATH_STAT0_LENGTH                  0x00000001

#define _SENT2DATH_STAT1_POSITION                0x0000000D
#define _SENT2DATH_STAT1_MASK                    0x00002000
#define _SENT2DATH_STAT1_LENGTH                  0x00000001

#define _SENT2DATH_STAT2_POSITION                0x0000000E
#define _SENT2DATH_STAT2_MASK                    0x00004000
#define _SENT2DATH_STAT2_LENGTH                  0x00000001

#define _SENT2DATH_STAT3_POSITION                0x0000000F
#define _SENT2DATH_STAT3_MASK                    0x00008000
#define _SENT2DATH_STAT3_LENGTH                  0x00000001

#define _CRCCON1_MOD_POSITION                    0x00000002
#define _CRCCON1_MOD_MASK                        0x00000004
#define _CRCCON1_MOD_LENGTH                      0x00000001

#define _CRCCON1_LENDIAN_POSITION                0x00000003
#define _CRCCON1_LENDIAN_MASK                    0x00000008
#define _CRCCON1_LENDIAN_LENGTH                  0x00000001

#define _CRCCON1_CRCGO_POSITION                  0x00000004
#define _CRCCON1_CRCGO_MASK                      0x00000010
#define _CRCCON1_CRCGO_LENGTH                    0x00000001

#define _CRCCON1_CRCISEL_POSITION                0x00000005
#define _CRCCON1_CRCISEL_MASK                    0x00000020
#define _CRCCON1_CRCISEL_LENGTH                  0x00000001

#define _CRCCON1_CRCMPT_POSITION                 0x00000006
#define _CRCCON1_CRCMPT_MASK                     0x00000040
#define _CRCCON1_CRCMPT_LENGTH                   0x00000001

#define _CRCCON1_CRCFUL_POSITION                 0x00000007
#define _CRCCON1_CRCFUL_MASK                     0x00000080
#define _CRCCON1_CRCFUL_LENGTH                   0x00000001

#define _CRCCON1_VWORD_POSITION                  0x00000008
#define _CRCCON1_VWORD_MASK                      0x00001F00
#define _CRCCON1_VWORD_LENGTH                    0x00000005

#define _CRCCON1_CSIDL_POSITION                  0x0000000D
#define _CRCCON1_CSIDL_MASK                      0x00002000
#define _CRCCON1_CSIDL_LENGTH                    0x00000001

#define _CRCCON1_CRCEN_POSITION                  0x0000000F
#define _CRCCON1_CRCEN_MASK                      0x00008000
#define _CRCCON1_CRCEN_LENGTH                    0x00000001

#define _CRCCONL_MOD_POSITION                    0x00000002
#define _CRCCONL_MOD_MASK                        0x00000004
#define _CRCCONL_MOD_LENGTH                      0x00000001

#define _CRCCONL_LENDIAN_POSITION                0x00000003
#define _CRCCONL_LENDIAN_MASK                    0x00000008
#define _CRCCONL_LENDIAN_LENGTH                  0x00000001

#define _CRCCONL_CRCGO_POSITION                  0x00000004
#define _CRCCONL_CRCGO_MASK                      0x00000010
#define _CRCCONL_CRCGO_LENGTH                    0x00000001

#define _CRCCONL_CRCISEL_POSITION                0x00000005
#define _CRCCONL_CRCISEL_MASK                    0x00000020
#define _CRCCONL_CRCISEL_LENGTH                  0x00000001

#define _CRCCONL_CRCMPT_POSITION                 0x00000006
#define _CRCCONL_CRCMPT_MASK                     0x00000040
#define _CRCCONL_CRCMPT_LENGTH                   0x00000001

#define _CRCCONL_CRCFUL_POSITION                 0x00000007
#define _CRCCONL_CRCFUL_MASK                     0x00000080
#define _CRCCONL_CRCFUL_LENGTH                   0x00000001

#define _CRCCONL_VWORD_POSITION                  0x00000008
#define _CRCCONL_VWORD_MASK                      0x00001F00
#define _CRCCONL_VWORD_LENGTH                    0x00000005

#define _CRCCONL_CSIDL_POSITION                  0x0000000D
#define _CRCCONL_CSIDL_MASK                      0x00002000
#define _CRCCONL_CSIDL_LENGTH                    0x00000001

#define _CRCCONL_CRCEN_POSITION                  0x0000000F
#define _CRCCONL_CRCEN_MASK                      0x00008000
#define _CRCCONL_CRCEN_LENGTH                    0x00000001

#define _CRCCON2_PLEN_POSITION                   0x00000000
#define _CRCCON2_PLEN_MASK                       0x0000001F
#define _CRCCON2_PLEN_LENGTH                     0x00000005

#define _CRCCON2_DWIDTH_POSITION                 0x00000008
#define _CRCCON2_DWIDTH_MASK                     0x00001F00
#define _CRCCON2_DWIDTH_LENGTH                   0x00000005

#define _CRCCONH_PLEN_POSITION                   0x00000000
#define _CRCCONH_PLEN_MASK                       0x0000001F
#define _CRCCONH_PLEN_LENGTH                     0x00000005

#define _CRCCONH_DWIDTH_POSITION                 0x00000008
#define _CRCCONH_DWIDTH_MASK                     0x00001F00
#define _CRCCONH_DWIDTH_LENGTH                   0x00000005

#define _CRCXORL_X1_POSITION                     0x00000001
#define _CRCXORL_X1_MASK                         0x00000002
#define _CRCXORL_X1_LENGTH                       0x00000001

#define _CRCXORL_X2_POSITION                     0x00000002
#define _CRCXORL_X2_MASK                         0x00000004
#define _CRCXORL_X2_LENGTH                       0x00000001

#define _CRCXORL_X3_POSITION                     0x00000003
#define _CRCXORL_X3_MASK                         0x00000008
#define _CRCXORL_X3_LENGTH                       0x00000001

#define _CRCXORL_X4_POSITION                     0x00000004
#define _CRCXORL_X4_MASK                         0x00000010
#define _CRCXORL_X4_LENGTH                       0x00000001

#define _CRCXORL_X5_POSITION                     0x00000005
#define _CRCXORL_X5_MASK                         0x00000020
#define _CRCXORL_X5_LENGTH                       0x00000001

#define _CRCXORL_X6_POSITION                     0x00000006
#define _CRCXORL_X6_MASK                         0x00000040
#define _CRCXORL_X6_LENGTH                       0x00000001

#define _CRCXORL_X7_POSITION                     0x00000007
#define _CRCXORL_X7_MASK                         0x00000080
#define _CRCXORL_X7_LENGTH                       0x00000001

#define _CRCXORL_X8_POSITION                     0x00000008
#define _CRCXORL_X8_MASK                         0x00000100
#define _CRCXORL_X8_LENGTH                       0x00000001

#define _CRCXORL_X9_POSITION                     0x00000009
#define _CRCXORL_X9_MASK                         0x00000200
#define _CRCXORL_X9_LENGTH                       0x00000001

#define _CRCXORL_X10_POSITION                    0x0000000A
#define _CRCXORL_X10_MASK                        0x00000400
#define _CRCXORL_X10_LENGTH                      0x00000001

#define _CRCXORL_X11_POSITION                    0x0000000B
#define _CRCXORL_X11_MASK                        0x00000800
#define _CRCXORL_X11_LENGTH                      0x00000001

#define _CRCXORL_X12_POSITION                    0x0000000C
#define _CRCXORL_X12_MASK                        0x00001000
#define _CRCXORL_X12_LENGTH                      0x00000001

#define _CRCXORL_X13_POSITION                    0x0000000D
#define _CRCXORL_X13_MASK                        0x00002000
#define _CRCXORL_X13_LENGTH                      0x00000001

