gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
#define _CLC4GLSH_G4D2T_POSITION                 0x0000000B
#define _CLC4GLSH_G4D2T_MASK                     0x00000800
#define _CLC4GLSH_G4D2T_LENGTH                   0x00000001

#define _CLC4GLSH_G4D3N_POSITION                 0x0000000C
#define _CLC4GLSH_G4D3N_MASK                     0x00001000
#define _CLC4GLSH_G4D3N_LENGTH                   0x00000001

#define _CLC4GLSH_G4D3T_POSITION                 0x0000000D
#define _CLC4GLSH_G4D3T_MASK                     0x00002000
#define _CLC4GLSH_G4D3T_LENGTH                   0x00000001

#define _CLC4GLSH_G4D4N_POSITION                 0x0000000E
#define _CLC4GLSH_G4D4N_MASK                     0x00004000
#define _CLC4GLSH_G4D4N_LENGTH                   0x00000001

#define _CLC4GLSH_G4D4T_POSITION                 0x0000000F
#define _CLC4GLSH_G4D4T_MASK                     0x00008000
#define _CLC4GLSH_G4D4T_LENGTH                   0x00000001

#define _ECCCONL_FLTINJ_POSITION                 0x00000000
#define _ECCCONL_FLTINJ_MASK                     0x00000001
#define _ECCCONL_FLTINJ_LENGTH                   0x00000001

#define _ECCCONH_FLT1PTR_POSITION                0x00000000
#define _ECCCONH_FLT1PTR_MASK                    0x000000FF
#define _ECCCONH_FLT1PTR_LENGTH                  0x00000008

#define _ECCCONH_FLT2PTR_POSITION                0x00000008
#define _ECCCONH_FLT2PTR_MASK                    0x0000FF00
#define _ECCCONH_FLT2PTR_LENGTH                  0x00000008

#define _ECCCONH_FTL2PTR_POSITION                0x00000008
#define _ECCCONH_FTL2PTR_MASK                    0x0000FF00
#define _ECCCONH_FTL2PTR_LENGTH                  0x00000008

#define _ECCSTATL_SECIN_POSITION                 0x00000000
#define _ECCSTATL_SECIN_MASK                     0x000000FF
#define _ECCSTATL_SECIN_LENGTH                   0x00000008

#define _ECCSTATL_SECOUT_POSITION                0x00000008
#define _ECCSTATL_SECOUT_MASK                    0x0000FF00
#define _ECCSTATL_SECOUT_LENGTH                  0x00000008

#define _ECCSTATH_SYND_POSITION                  0x00000000
#define _ECCSTATH_SYND_MASK                      0x000000FF
#define _ECCSTATH_SYND_LENGTH                    0x00000008

#define _ECCSTATH_DEDIN_POSITION                 0x00000008
#define _ECCSTATH_DEDIN_MASK                     0x00000100
#define _ECCSTATH_DEDIN_LENGTH                   0x00000001

#define _ECCSTATH_DEDOUT_POSITION                0x00000009
#define _ECCSTATH_DEDOUT_MASK                    0x00000200
#define _ECCSTATH_DEDOUT_LENGTH                  0x00000001

#define _T1CON_TCS_POSITION                      0x00000001
#define _T1CON_TCS_MASK                          0x00000002
#define _T1CON_TCS_LENGTH                        0x00000001

#define _T1CON_TSYNC_POSITION                    0x00000002
#define _T1CON_TSYNC_MASK                        0x00000004
#define _T1CON_TSYNC_LENGTH                      0x00000001

#define _T1CON_TCKPS_POSITION                    0x00000004
#define _T1CON_TCKPS_MASK                        0x00000030
#define _T1CON_TCKPS_LENGTH                      0x00000002

#define _T1CON_TGATE_POSITION                    0x00000007
#define _T1CON_TGATE_MASK                        0x00000080
#define _T1CON_TGATE_LENGTH                      0x00000001

#define _T1CON_TECS_POSITION                     0x00000008
#define _T1CON_TECS_MASK                         0x00000300
#define _T1CON_TECS_LENGTH                       0x00000002

#define _T1CON_PRWIP_POSITION                    0x0000000A
#define _T1CON_PRWIP_MASK                        0x00000400
#define _T1CON_PRWIP_LENGTH                      0x00000001

#define _T1CON_TMWIP_POSITION                    0x0000000B
#define _T1CON_TMWIP_MASK                        0x00000800
#define _T1CON_TMWIP_LENGTH                      0x00000001

#define _T1CON_TMWDIS_POSITION                   0x0000000C
#define _T1CON_TMWDIS_MASK                       0x00001000
#define _T1CON_TMWDIS_LENGTH                     0x00000001

#define _T1CON_TSIDL_POSITION                    0x0000000D
#define _T1CON_TSIDL_MASK                        0x00002000
#define _T1CON_TSIDL_LENGTH                      0x00000001

#define _T1CON_TON_POSITION                      0x0000000F
#define _T1CON_TON_MASK                          0x00008000
#define _T1CON_TON_LENGTH                        0x00000001

#define _QEI1CON_CCM_POSITION                    0x00000000
#define _QEI1CON_CCM_MASK                        0x00000003
#define _QEI1CON_CCM_LENGTH                      0x00000002

#define _QEI1CON_GATEN_POSITION                  0x00000002
#define _QEI1CON_GATEN_MASK                      0x00000004
#define _QEI1CON_GATEN_LENGTH                    0x00000001

#define _QEI1CON_CNTPOL_POSITION                 0x00000003
#define _QEI1CON_CNTPOL_MASK                     0x00000008
#define _QEI1CON_CNTPOL_LENGTH                   0x00000001

#define _QEI1CON_INTDIV_POSITION                 0x00000004
#define _QEI1CON_INTDIV_MASK                     0x00000070
#define _QEI1CON_INTDIV_LENGTH                   0x00000003

#define _QEI1CON_IMV_POSITION                    0x00000008
#define _QEI1CON_IMV_MASK                        0x00000300
#define _QEI1CON_IMV_LENGTH                      0x00000002

#define _QEI1CON_PIMOD_POSITION                  0x0000000A
#define _QEI1CON_PIMOD_MASK                      0x00001C00
#define _QEI1CON_PIMOD_LENGTH                    0x00000003

#define _QEI1CON_QEISIDL_POSITION                0x0000000D
#define _QEI1CON_QEISIDL_MASK                    0x00002000
#define _QEI1CON_QEISIDL_LENGTH                  0x00000001

#define _QEI1CON_QEIEN_POSITION                  0x0000000F
#define _QEI1CON_QEIEN_MASK                      0x00008000
#define _QEI1CON_QEIEN_LENGTH                    0x00000001

#define _QEI1IOC_QEA_POSITION                    0x00000000
#define _QEI1IOC_QEA_MASK                        0x00000001
#define _QEI1IOC_QEA_LENGTH                      0x00000001

#define _QEI1IOC_QEB_POSITION                    0x00000001
#define _QEI1IOC_QEB_MASK                        0x00000002
#define _QEI1IOC_QEB_LENGTH                      0x00000001

