gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
#define _I2C2STAT_IWCOL_POSITION                 0x00000007
#define _I2C2STAT_IWCOL_MASK                     0x00000080
#define _I2C2STAT_IWCOL_LENGTH                   0x00000001

#define _I2C2STAT_ADD10_POSITION                 0x00000008
#define _I2C2STAT_ADD10_MASK                     0x00000100
#define _I2C2STAT_ADD10_LENGTH                   0x00000001

#define _I2C2STAT_GCSTAT_POSITION                0x00000009
#define _I2C2STAT_GCSTAT_MASK                    0x00000200
#define _I2C2STAT_GCSTAT_LENGTH                  0x00000001

#define _I2C2STAT_BCL_POSITION                   0x0000000A
#define _I2C2STAT_BCL_MASK                       0x00000400
#define _I2C2STAT_BCL_LENGTH                     0x00000001

#define _I2C2STAT_ACKTIM_POSITION                0x0000000D
#define _I2C2STAT_ACKTIM_MASK                    0x00002000
#define _I2C2STAT_ACKTIM_LENGTH                  0x00000001

#define _I2C2STAT_TRSTAT_POSITION                0x0000000E
#define _I2C2STAT_TRSTAT_MASK                    0x00004000
#define _I2C2STAT_TRSTAT_LENGTH                  0x00000001

#define _I2C2STAT_ACKSTAT_POSITION               0x0000000F
#define _I2C2STAT_ACKSTAT_MASK                   0x00008000
#define _I2C2STAT_ACKSTAT_LENGTH                 0x00000001

#define _I2C2ADD_ADD_POSITION                    0x00000000
#define _I2C2ADD_ADD_MASK                        0x000003FF
#define _I2C2ADD_ADD_LENGTH                      0x0000000A

#define _I2C2MSK_AMSK_POSITION                   0x00000000
#define _I2C2MSK_AMSK_MASK                       0x000003FF
#define _I2C2MSK_AMSK_LENGTH                     0x0000000A

#define _I2C2MSK_AMSK0_POSITION                  0x00000000
#define _I2C2MSK_AMSK0_MASK                      0x00000001
#define _I2C2MSK_AMSK0_LENGTH                    0x00000001

#define _I2C2MSK_AMSK1_POSITION                  0x00000001
#define _I2C2MSK_AMSK1_MASK                      0x00000002
#define _I2C2MSK_AMSK1_LENGTH                    0x00000001

#define _I2C2MSK_AMSK2_POSITION                  0x00000002
#define _I2C2MSK_AMSK2_MASK                      0x00000004
#define _I2C2MSK_AMSK2_LENGTH                    0x00000001

#define _I2C2MSK_AMSK3_POSITION                  0x00000003
#define _I2C2MSK_AMSK3_MASK                      0x00000008
#define _I2C2MSK_AMSK3_LENGTH                    0x00000001

#define _I2C2MSK_AMSK4_POSITION                  0x00000004
#define _I2C2MSK_AMSK4_MASK                      0x00000010
#define _I2C2MSK_AMSK4_LENGTH                    0x00000001

#define _I2C2MSK_AMSK5_POSITION                  0x00000005
#define _I2C2MSK_AMSK5_MASK                      0x00000020
#define _I2C2MSK_AMSK5_LENGTH                    0x00000001

#define _I2C2MSK_AMSK6_POSITION                  0x00000006
#define _I2C2MSK_AMSK6_MASK                      0x00000040
#define _I2C2MSK_AMSK6_LENGTH                    0x00000001

#define _I2C2MSK_AMSK7_POSITION                  0x00000007
#define _I2C2MSK_AMSK7_MASK                      0x00000080
#define _I2C2MSK_AMSK7_LENGTH                    0x00000001

#define _I2C2MSK_AMSK8_POSITION                  0x00000008
#define _I2C2MSK_AMSK8_MASK                      0x00000100
#define _I2C2MSK_AMSK8_LENGTH                    0x00000001

#define _I2C2MSK_AMSK9_POSITION                  0x00000009
#define _I2C2MSK_AMSK9_MASK                      0x00000200
#define _I2C2MSK_AMSK9_LENGTH                    0x00000001

#define _I2C2TRN_I2CTXDATA_POSITION              0x00000000
#define _I2C2TRN_I2CTXDATA_MASK                  0x000000FF
#define _I2C2TRN_I2CTXDATA_LENGTH                0x00000008

#define _I2C2RCV_I2CRXDATA_POSITION              0x00000000
#define _I2C2RCV_I2CRXDATA_MASK                  0x000000FF
#define _I2C2RCV_I2CRXDATA_LENGTH                0x00000008

#define _U1MODE_MOD_POSITION                     0x00000000
#define _U1MODE_MOD_MASK                         0x0000000F
#define _U1MODE_MOD_LENGTH                       0x00000004

#define _U1MODE_URXEN_POSITION                   0x00000004
#define _U1MODE_URXEN_MASK                       0x00000010
#define _U1MODE_URXEN_LENGTH                     0x00000001

#define _U1MODE_UTXEN_POSITION                   0x00000005
#define _U1MODE_UTXEN_MASK                       0x00000020
#define _U1MODE_UTXEN_LENGTH                     0x00000001

#define _U1MODE_ABAUD_POSITION                   0x00000006
#define _U1MODE_ABAUD_MASK                       0x00000040
#define _U1MODE_ABAUD_LENGTH                     0x00000001

#define _U1MODE_BRGH_POSITION                    0x00000007
#define _U1MODE_BRGH_MASK                        0x00000080
#define _U1MODE_BRGH_LENGTH                      0x00000001

#define _U1MODE_UTXBRK_POSITION                  0x00000008
#define _U1MODE_UTXBRK_MASK                      0x00000100
#define _U1MODE_UTXBRK_LENGTH                    0x00000001

#define _U1MODE_BRKOVR_POSITION                  0x00000009
#define _U1MODE_BRKOVR_MASK                      0x00000200
#define _U1MODE_BRKOVR_LENGTH                    0x00000001

#define _U1MODE_RXBIMD_POSITION                  0x0000000B
#define _U1MODE_RXBIMD_MASK                      0x00000800
#define _U1MODE_RXBIMD_LENGTH                    0x00000001

#define _U1MODE_WAKE_POSITION                    0x0000000C
#define _U1MODE_WAKE_MASK                        0x00001000
#define _U1MODE_WAKE_LENGTH                      0x00000001

#define _U1MODE_USIDL_POSITION                   0x0000000D
#define _U1MODE_USIDL_MASK                       0x00002000
#define _U1MODE_USIDL_LENGTH                     0x00000001

#define _U1MODE_UARTEN_POSITION                  0x0000000F
#define _U1MODE_UARTEN_MASK                      0x00008000
#define _U1MODE_UARTEN_LENGTH                    0x00000001

#define _U1MODE_MOD0_POSITION                    0x00000000
#define _U1MODE_MOD0_MASK                        0x00000001
#define _U1MODE_MOD0_LENGTH                      0x00000001

#define _U1MODE_MOD1_POSITION                    0x00000001
#define _U1MODE_MOD1_MASK                        0x00000002
#define _U1MODE_MOD1_LENGTH                      0x00000001

#define _U1MODE_MOD2_POSITION                    0x00000002
#define _U1MODE_MOD2_MASK                        0x00000004
#define _U1MODE_MOD2_LENGTH                      0x00000001

#define _U1MODE_MOD3_POSITION                    0x00000003
#define _U1MODE_MOD3_MASK                        0x00000008
#define _U1MODE_MOD3_LENGTH                      0x00000001

