gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
#define _U1STAH_UTXBF_POSITION                   0x00000004
#define _U1STAH_UTXBF_MASK                       0x00000010
#define _U1STAH_UTXBF_LENGTH                     0x00000001

#define _U1STAH_UTXBE_POSITION                   0x00000005
#define _U1STAH_UTXBE_MASK                       0x00000020
#define _U1STAH_UTXBE_LENGTH                     0x00000001

#define _U1STAH_STPMD_POSITION                   0x00000006
#define _U1STAH_STPMD_MASK                       0x00000040
#define _U1STAH_STPMD_LENGTH                     0x00000001

#define _U1STAH_TXWRE_POSITION                   0x00000007
#define _U1STAH_TXWRE_MASK                       0x00000080
#define _U1STAH_TXWRE_LENGTH                     0x00000001

#define _U1STAH_URXISEL_POSITION                 0x00000008
#define _U1STAH_URXISEL_MASK                     0x00000700
#define _U1STAH_URXISEL_LENGTH                   0x00000003

#define _U1STAH_UTXISEL_POSITION                 0x0000000C
#define _U1STAH_UTXISEL_MASK                     0x00007000
#define _U1STAH_UTXISEL_LENGTH                   0x00000003

#define _U1STAH_URXISEL0_POSITION                0x00000008
#define _U1STAH_URXISEL0_MASK                    0x00000100
#define _U1STAH_URXISEL0_LENGTH                  0x00000001

#define _U1STAH_URXISEL1_POSITION                0x00000009
#define _U1STAH_URXISEL1_MASK                    0x00000200
#define _U1STAH_URXISEL1_LENGTH                  0x00000001

#define _U1STAH_URXISEL2_POSITION                0x0000000A
#define _U1STAH_URXISEL2_MASK                    0x00000400
#define _U1STAH_URXISEL2_LENGTH                  0x00000001

#define _U1STAH_UTXISEL0_POSITION                0x0000000C
#define _U1STAH_UTXISEL0_MASK                    0x00001000
#define _U1STAH_UTXISEL0_LENGTH                  0x00000001

#define _U1STAH_UTXISEL1_POSITION                0x0000000D
#define _U1STAH_UTXISEL1_MASK                    0x00002000
#define _U1STAH_UTXISEL1_LENGTH                  0x00000001

#define _U1STAH_UTXISEL2_POSITION                0x0000000E
#define _U1STAH_UTXISEL2_MASK                    0x00004000
#define _U1STAH_UTXISEL2_LENGTH                  0x00000001

#define _U1BRG_BRG_POSITION                      0x00000000
#define _U1BRG_BRG_MASK                          0x0000FFFF
#define _U1BRG_BRG_LENGTH                        0x00000010

#define _U1BRG_BRG0_POSITION                     0x00000000
#define _U1BRG_BRG0_MASK                         0x00000001
#define _U1BRG_BRG0_LENGTH                       0x00000001

#define _U1BRG_BRG1_POSITION                     0x00000001
#define _U1BRG_BRG1_MASK                         0x00000002
#define _U1BRG_BRG1_LENGTH                       0x00000001

#define _U1BRG_BRG2_POSITION                     0x00000002
#define _U1BRG_BRG2_MASK                         0x00000004
#define _U1BRG_BRG2_LENGTH                       0x00000001

#define _U1BRG_BRG3_POSITION                     0x00000003
#define _U1BRG_BRG3_MASK                         0x00000008
#define _U1BRG_BRG3_LENGTH                       0x00000001

#define _U1BRG_BRG4_POSITION                     0x00000004
#define _U1BRG_BRG4_MASK                         0x00000010
#define _U1BRG_BRG4_LENGTH                       0x00000001

#define _U1BRG_BRG5_POSITION                     0x00000005
#define _U1BRG_BRG5_MASK                         0x00000020
#define _U1BRG_BRG5_LENGTH                       0x00000001

#define _U1BRG_BRG6_POSITION                     0x00000006
#define _U1BRG_BRG6_MASK                         0x00000040
#define _U1BRG_BRG6_LENGTH                       0x00000001

#define _U1BRG_BRG7_POSITION                     0x00000007
#define _U1BRG_BRG7_MASK                         0x00000080
#define _U1BRG_BRG7_LENGTH                       0x00000001

#define _U1BRG_BRG8_POSITION                     0x00000008
#define _U1BRG_BRG8_MASK                         0x00000100
#define _U1BRG_BRG8_LENGTH                       0x00000001

#define _U1BRG_BRG9_POSITION                     0x00000009
#define _U1BRG_BRG9_MASK                         0x00000200
#define _U1BRG_BRG9_LENGTH                       0x00000001

#define _U1BRG_BRG10_POSITION                    0x0000000A
#define _U1BRG_BRG10_MASK                        0x00000400
#define _U1BRG_BRG10_LENGTH                      0x00000001

#define _U1BRG_BRG11_POSITION                    0x0000000B
#define _U1BRG_BRG11_MASK                        0x00000800
#define _U1BRG_BRG11_LENGTH                      0x00000001

#define _U1BRG_BRG12_POSITION                    0x0000000C
#define _U1BRG_BRG12_MASK                        0x00001000
#define _U1BRG_BRG12_LENGTH                      0x00000001

#define _U1BRG_BRG13_POSITION                    0x0000000D
#define _U1BRG_BRG13_MASK                        0x00002000
#define _U1BRG_BRG13_LENGTH                      0x00000001

#define _U1BRG_BRG14_POSITION                    0x0000000E
#define _U1BRG_BRG14_MASK                        0x00004000
#define _U1BRG_BRG14_LENGTH                      0x00000001

#define _U1BRG_BRG15_POSITION                    0x0000000F
#define _U1BRG_BRG15_MASK                        0x00008000
#define _U1BRG_BRG15_LENGTH                      0x00000001

#define _U1BRGH_BRG_POSITION                     0x00000000
#define _U1BRGH_BRG_MASK                         0x0000000F
#define _U1BRGH_BRG_LENGTH                       0x00000004

#define _U1BRGH_BRG16_POSITION                   0x00000000
#define _U1BRGH_BRG16_MASK                       0x00000001
#define _U1BRGH_BRG16_LENGTH                     0x00000001

#define _U1BRGH_BRG1_POSITION                    0x00000001
#define _U1BRGH_BRG1_MASK                        0x00000002
#define _U1BRGH_BRG1_LENGTH                      0x00000001

#define _U1BRGH_BRG18_POSITION                   0x00000002
#define _U1BRGH_BRG18_MASK                       0x00000004
#define _U1BRGH_BRG18_LENGTH                     0x00000001

#define _U1BRGH_BRG19_POSITION                   0x00000003
#define _U1BRGH_BRG19_MASK                       0x00000008
#define _U1BRGH_BRG19_LENGTH                     0x00000001

