gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
#define _U1RXREG_RXREG_POSITION                  0x00000000
#define _U1RXREG_RXREG_MASK                      0x000000FF
#define _U1RXREG_RXREG_LENGTH                    0x00000008

#define _U1RXREG_RXREG0_POSITION                 0x00000000
#define _U1RXREG_RXREG0_MASK                     0x00000001
#define _U1RXREG_RXREG0_LENGTH                   0x00000001

#define _U1RXREG_RXREG1_POSITION                 0x00000001
#define _U1RXREG_RXREG1_MASK                     0x00000002
#define _U1RXREG_RXREG1_LENGTH                   0x00000001

#define _U1RXREG_RXREG2_POSITION                 0x00000002
#define _U1RXREG_RXREG2_MASK                     0x00000004
#define _U1RXREG_RXREG2_LENGTH                   0x00000001

#define _U1RXREG_RXREG3_POSITION                 0x00000003
#define _U1RXREG_RXREG3_MASK                     0x00000008
#define _U1RXREG_RXREG3_LENGTH                   0x00000001

#define _U1RXREG_RXREG4_POSITION                 0x00000004
#define _U1RXREG_RXREG4_MASK                     0x00000010
#define _U1RXREG_RXREG4_LENGTH                   0x00000001

#define _U1RXREG_RXREG5_POSITION                 0x00000005
#define _U1RXREG_RXREG5_MASK                     0x00000020
#define _U1RXREG_RXREG5_LENGTH                   0x00000001

#define _U1RXREG_RXREG6_POSITION                 0x00000006
#define _U1RXREG_RXREG6_MASK                     0x00000040
#define _U1RXREG_RXREG6_LENGTH                   0x00000001

#define _U1RXREG_RXREG7_POSITION                 0x00000007
#define _U1RXREG_RXREG7_MASK                     0x00000080
#define _U1RXREG_RXREG7_LENGTH                   0x00000001

#define _U1TXREG_TXREG_POSITION                  0x00000000
#define _U1TXREG_TXREG_MASK                      0x000000FF
#define _U1TXREG_TXREG_LENGTH                    0x00000008

#define _U1TXREG_LAST_POSITION                   0x0000000F
#define _U1TXREG_LAST_MASK                       0x00008000
#define _U1TXREG_LAST_LENGTH                     0x00000001

#define _U1TXREG_TXREG0_POSITION                 0x00000000
#define _U1TXREG_TXREG0_MASK                     0x00000001
#define _U1TXREG_TXREG0_LENGTH                   0x00000001

#define _U1TXREG_TXREG1_POSITION                 0x00000001
#define _U1TXREG_TXREG1_MASK                     0x00000002
#define _U1TXREG_TXREG1_LENGTH                   0x00000001

#define _U1TXREG_TXREG2_POSITION                 0x00000002
#define _U1TXREG_TXREG2_MASK                     0x00000004
#define _U1TXREG_TXREG2_LENGTH                   0x00000001

#define _U1TXREG_TXREG3_POSITION                 0x00000003
#define _U1TXREG_TXREG3_MASK                     0x00000008
#define _U1TXREG_TXREG3_LENGTH                   0x00000001

#define _U1TXREG_TXREG4_POSITION                 0x00000004
#define _U1TXREG_TXREG4_MASK                     0x00000010
#define _U1TXREG_TXREG4_LENGTH                   0x00000001

#define _U1TXREG_TXREG5_POSITION                 0x00000005
#define _U1TXREG_TXREG5_MASK                     0x00000020
#define _U1TXREG_TXREG5_LENGTH                   0x00000001

#define _U1TXREG_TXREG6_POSITION                 0x00000006
#define _U1TXREG_TXREG6_MASK                     0x00000040
#define _U1TXREG_TXREG6_LENGTH                   0x00000001

#define _U1TXREG_TXREG7_POSITION                 0x00000007
#define _U1TXREG_TXREG7_MASK                     0x00000080
#define _U1TXREG_TXREG7_LENGTH                   0x00000001

#define _U1P1_P1_POSITION                        0x00000000
#define _U1P1_P1_MASK                            0x000001FF
#define _U1P1_P1_LENGTH                          0x00000009

#define _U1P1_P10_POSITION                       0x00000000
#define _U1P1_P10_MASK                           0x00000001
#define _U1P1_P10_LENGTH                         0x00000001

#define _U1P1_P11_POSITION                       0x00000001
#define _U1P1_P11_MASK                           0x00000002
#define _U1P1_P11_LENGTH                         0x00000001

#define _U1P1_P12_POSITION                       0x00000002
#define _U1P1_P12_MASK                           0x00000004
#define _U1P1_P12_LENGTH                         0x00000001

#define _U1P1_P13_POSITION                       0x00000003
#define _U1P1_P13_MASK                           0x00000008
#define _U1P1_P13_LENGTH                         0x00000001

#define _U1P1_P14_POSITION                       0x00000004
#define _U1P1_P14_MASK                           0x00000010
#define _U1P1_P14_LENGTH                         0x00000001

#define _U1P1_P15_POSITION                       0x00000005
#define _U1P1_P15_MASK                           0x00000020
#define _U1P1_P15_LENGTH                         0x00000001

#define _U1P1_P16_POSITION                       0x00000006
#define _U1P1_P16_MASK                           0x00000040
#define _U1P1_P16_LENGTH                         0x00000001

#define _U1P1_P17_POSITION                       0x00000007
#define _U1P1_P17_MASK                           0x00000080
#define _U1P1_P17_LENGTH                         0x00000001

#define _U1P1_P18_POSITION                       0x00000008
#define _U1P1_P18_MASK                           0x00000100
#define _U1P1_P18_LENGTH                         0x00000001

#define _U1P2_P2_POSITION                        0x00000000
#define _U1P2_P2_MASK                            0x000001FF
#define _U1P2_P2_LENGTH                          0x00000009

#define _U1P2_P20_POSITION                       0x00000000
#define _U1P2_P20_MASK                           0x00000001
#define _U1P2_P20_LENGTH                         0x00000001

#define _U1P2_P21_POSITION                       0x00000001
#define _U1P2_P21_MASK                           0x00000002
#define _U1P2_P21_LENGTH                         0x00000001

#define _U1P2_P22_POSITION                       0x00000002
#define _U1P2_P22_MASK                           0x00000004
#define _U1P2_P22_LENGTH                         0x00000001

#define _U1P2_P23_POSITION                       0x00000003
#define _U1P2_P23_MASK                           0x00000008
#define _U1P2_P23_LENGTH                         0x00000001

