gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
#define _U2MODE_MOD1_POSITION                    0x00000001
#define _U2MODE_MOD1_MASK                        0x00000002
#define _U2MODE_MOD1_LENGTH                      0x00000001

#define _U2MODE_MOD2_POSITION                    0x00000002
#define _U2MODE_MOD2_MASK                        0x00000004
#define _U2MODE_MOD2_LENGTH                      0x00000001

#define _U2MODE_MOD3_POSITION                    0x00000003
#define _U2MODE_MOD3_MASK                        0x00000008
#define _U2MODE_MOD3_LENGTH                      0x00000001

#define _U2MODEH_FLO_POSITION                    0x00000000
#define _U2MODEH_FLO_MASK                        0x00000003
#define _U2MODEH_FLO_LENGTH                      0x00000002

#define _U2MODEH_UTXINV_POSITION                 0x00000002
#define _U2MODEH_UTXINV_MASK                     0x00000004
#define _U2MODEH_UTXINV_LENGTH                   0x00000001

#define _U2MODEH_C0EN_POSITION                   0x00000003
#define _U2MODEH_C0EN_MASK                       0x00000008
#define _U2MODEH_C0EN_LENGTH                     0x00000001

#define _U2MODEH_STSEL_POSITION                  0x00000004
#define _U2MODEH_STSEL_MASK                      0x00000030
#define _U2MODEH_STSEL_LENGTH                    0x00000002

#define _U2MODEH_URXINV_POSITION                 0x00000006
#define _U2MODEH_URXINV_MASK                     0x00000040
#define _U2MODEH_URXINV_LENGTH                   0x00000001

#define _U2MODEH_RUNOVF_POSITION                 0x00000007
#define _U2MODEH_RUNOVF_MASK                     0x00000080
#define _U2MODEH_RUNOVF_LENGTH                   0x00000001

#define _U2MODEH_HALFDPLX_POSITION               0x00000008
#define _U2MODEH_HALFDPLX_MASK                   0x00000100
#define _U2MODEH_HALFDPLX_LENGTH                 0x00000001

#define _U2MODEH_BCLKSEL_POSITION                0x00000009
#define _U2MODEH_BCLKSEL_MASK                    0x00000600
#define _U2MODEH_BCLKSEL_LENGTH                  0x00000002

#define _U2MODEH_BCLKMOD_POSITION                0x0000000B
#define _U2MODEH_BCLKMOD_MASK                    0x00000800
#define _U2MODEH_BCLKMOD_LENGTH                  0x00000001

#define _U2MODEH_ACTIVE_POSITION                 0x0000000E
#define _U2MODEH_ACTIVE_MASK                     0x00004000
#define _U2MODEH_ACTIVE_LENGTH                   0x00000001

#define _U2MODEH_SLPEN_POSITION                  0x0000000F
#define _U2MODEH_SLPEN_MASK                      0x00008000
#define _U2MODEH_SLPEN_LENGTH                    0x00000001

#define _U2MODEH_FLO0_POSITION                   0x00000000
#define _U2MODEH_FLO0_MASK                       0x00000001
#define _U2MODEH_FLO0_LENGTH                     0x00000001

#define _U2MODEH_FLO1_POSITION                   0x00000001
#define _U2MODEH_FLO1_MASK                       0x00000002
#define _U2MODEH_FLO1_LENGTH                     0x00000001

#define _U2MODEH_STSEL0_POSITION                 0x00000004
#define _U2MODEH_STSEL0_MASK                     0x00000010
#define _U2MODEH_STSEL0_LENGTH                   0x00000001

#define _U2MODEH_STSEL1_POSITION                 0x00000005
#define _U2MODEH_STSEL1_MASK                     0x00000020
#define _U2MODEH_STSEL1_LENGTH                   0x00000001

#define _U2MODEH_BCLKSEL0_POSITION               0x00000009
#define _U2MODEH_BCLKSEL0_MASK                   0x00000200
#define _U2MODEH_BCLKSEL0_LENGTH                 0x00000001

#define _U2MODEH_BCLKSEL1_POSITION               0x0000000A
#define _U2MODEH_BCLKSEL1_MASK                   0x00000400
#define _U2MODEH_BCLKSEL1_LENGTH                 0x00000001

#define _U2STA_TXCIF_POSITION                    0x00000000
#define _U2STA_TXCIF_MASK                        0x00000001
#define _U2STA_TXCIF_LENGTH                      0x00000001

#define _U2STA_OERR_POSITION                     0x00000001
#define _U2STA_OERR_MASK                         0x00000002
#define _U2STA_OERR_LENGTH                       0x00000001

#define _U2STA_RXBKIF_POSITION                   0x00000002
#define _U2STA_RXBKIF_MASK                       0x00000004
#define _U2STA_RXBKIF_LENGTH                     0x00000001

#define _U2STA_FERR_POSITION                     0x00000003
#define _U2STA_FERR_MASK                         0x00000008
#define _U2STA_FERR_LENGTH                       0x00000001

#define _U2STA_CERIF_POSITION                    0x00000004
#define _U2STA_CERIF_MASK                        0x00000010
#define _U2STA_CERIF_LENGTH                      0x00000001

#define _U2STA_ABDOVF_POSITION                   0x00000005
#define _U2STA_ABDOVF_MASK                       0x00000020
#define _U2STA_ABDOVF_LENGTH                     0x00000001

#define _U2STA_PERR_POSITION                     0x00000006
#define _U2STA_PERR_MASK                         0x00000040
#define _U2STA_PERR_LENGTH                       0x00000001

#define _U2STA_TRMT_POSITION                     0x00000007
#define _U2STA_TRMT_MASK                         0x00000080
#define _U2STA_TRMT_LENGTH                       0x00000001

#define _U2STA_TXCIE_POSITION                    0x00000008
#define _U2STA_TXCIE_MASK                        0x00000100
#define _U2STA_TXCIE_LENGTH                      0x00000001

#define _U2STA_OERIE_POSITION                    0x00000009
#define _U2STA_OERIE_MASK                        0x00000200
#define _U2STA_OERIE_LENGTH                      0x00000001

#define _U2STA_RXBKIE_POSITION                   0x0000000A
#define _U2STA_RXBKIE_MASK                       0x00000400
#define _U2STA_RXBKIE_LENGTH                     0x00000001

#define _U2STA_FERIE_POSITION                    0x0000000B
#define _U2STA_FERIE_MASK                        0x00000800
#define _U2STA_FERIE_LENGTH                      0x00000001

#define _U2STA_CERIE_POSITION                    0x0000000C
#define _U2STA_CERIE_MASK                        0x00001000
#define _U2STA_CERIE_LENGTH                      0x00000001

#define _U2STA_ABDOVE_POSITION                   0x0000000D
#define _U2STA_ABDOVE_MASK                       0x00002000
#define _U2STA_ABDOVE_LENGTH                     0x00000001

#define _U2STA_PERIE_POSITION                    0x0000000E
#define _U2STA_PERIE_MASK                        0x00004000
#define _U2STA_PERIE_LENGTH                      0x00000001

#define _U2STA_TXMTIE_POSITION                   0x0000000F
#define _U2STA_TXMTIE_MASK                       0x00008000
#define _U2STA_TXMTIE_LENGTH                     0x00000001

#define _U2STAH_URXBF_POSITION                   0x00000000
#define _U2STAH_URXBF_MASK                       0x00000001
#define _U2STAH_URXBF_LENGTH                     0x00000001

#define _U2STAH_URXBE_POSITION                   0x00000001
#define _U2STAH_URXBE_MASK                       0x00000002
#define _U2STAH_URXBE_LENGTH                     0x00000001

#define _U2STAH_XON_POSITION                     0x00000002
#define _U2STAH_XON_MASK                         0x00000004
#define _U2STAH_XON_LENGTH                       0x00000001

#define _U2STAH_RIDLE_POSITION                   0x00000003
#define _U2STAH_RIDLE_MASK                       0x00000008
#define _U2STAH_RIDLE_LENGTH                     0x00000001

