gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
#define _PG2FFPCIL_PPS_POSITION                  0x00000005
#define _PG2FFPCIL_PPS_MASK                      0x00000020
#define _PG2FFPCIL_PPS_LENGTH                    0x00000001

#define _PG2FFPCIL_PSYNC_POSITION                0x00000006
#define _PG2FFPCIL_PSYNC_MASK                    0x00000040
#define _PG2FFPCIL_PSYNC_LENGTH                  0x00000001

#define _PG2FFPCIL_SWTERM_POSITION               0x00000007
#define _PG2FFPCIL_SWTERM_MASK                   0x00000080
#define _PG2FFPCIL_SWTERM_LENGTH                 0x00000001

#define _PG2FFPCIL_AQSS_POSITION                 0x00000008
#define _PG2FFPCIL_AQSS_MASK                     0x00000700
#define _PG2FFPCIL_AQSS_LENGTH                   0x00000003

#define _PG2FFPCIL_AQPS_POSITION                 0x0000000B
#define _PG2FFPCIL_AQPS_MASK                     0x00000800
#define _PG2FFPCIL_AQPS_LENGTH                   0x00000001

#define _PG2FFPCIL_TERM_POSITION                 0x0000000C
#define _PG2FFPCIL_TERM_MASK                     0x00007000
#define _PG2FFPCIL_TERM_LENGTH                   0x00000003

#define _PG2FFPCIL_TSYNCDIS_POSITION             0x0000000F
#define _PG2FFPCIL_TSYNCDIS_MASK                 0x00008000
#define _PG2FFPCIL_TSYNCDIS_LENGTH               0x00000001

#define _PG2FFPCIH_TQSS_POSITION                 0x00000000
#define _PG2FFPCIH_TQSS_MASK                     0x00000007
#define _PG2FFPCIH_TQSS_LENGTH                   0x00000003

#define _PG2FFPCIH_TQPS_POSITION                 0x00000003
#define _PG2FFPCIH_TQPS_MASK                     0x00000008
#define _PG2FFPCIH_TQPS_LENGTH                   0x00000001

#define _PG2FFPCIH_LATMOD_POSITION               0x00000004
#define _PG2FFPCIH_LATMOD_MASK                   0x00000010
#define _PG2FFPCIH_LATMOD_LENGTH                 0x00000001

#define _PG2FFPCIH_SWPCIM_POSITION               0x00000005
#define _PG2FFPCIH_SWPCIM_MASK                   0x00000060
#define _PG2FFPCIH_SWPCIM_LENGTH                 0x00000002

#define _PG2FFPCIH_SWPCI_POSITION                0x00000007
#define _PG2FFPCIH_SWPCI_MASK                    0x00000080
#define _PG2FFPCIH_SWPCI_LENGTH                  0x00000001

#define _PG2FFPCIH_ACP_POSITION                  0x00000008
#define _PG2FFPCIH_ACP_MASK                      0x00000700
#define _PG2FFPCIH_ACP_LENGTH                    0x00000003

#define _PG2FFPCIH_BPSEL_POSITION                0x0000000C
#define _PG2FFPCIH_BPSEL_MASK                    0x00007000
#define _PG2FFPCIH_BPSEL_LENGTH                  0x00000003

#define _PG2FFPCIH_BPEN_POSITION                 0x0000000F
#define _PG2FFPCIH_BPEN_MASK                     0x00008000
#define _PG2FFPCIH_BPEN_LENGTH                   0x00000001

#define _PG2FFPCIH_PCIGT_POSITION                0x00000004
#define _PG2FFPCIH_PCIGT_MASK                    0x00000010
#define _PG2FFPCIH_PCIGT_LENGTH                  0x00000001

#define _PG2SPCIL_PSS_POSITION                   0x00000000
#define _PG2SPCIL_PSS_MASK                       0x0000001F
#define _PG2SPCIL_PSS_LENGTH                     0x00000005

#define _PG2SPCIL_PPS_POSITION                   0x00000005
#define _PG2SPCIL_PPS_MASK                       0x00000020
#define _PG2SPCIL_PPS_LENGTH                     0x00000001

#define _PG2SPCIL_PSYNC_POSITION                 0x00000006
#define _PG2SPCIL_PSYNC_MASK                     0x00000040
#define _PG2SPCIL_PSYNC_LENGTH                   0x00000001

#define _PG2SPCIL_SWTERM_POSITION                0x00000007
#define _PG2SPCIL_SWTERM_MASK                    0x00000080
#define _PG2SPCIL_SWTERM_LENGTH                  0x00000001

#define _PG2SPCIL_AQSS_POSITION                  0x00000008
#define _PG2SPCIL_AQSS_MASK                      0x00000700
#define _PG2SPCIL_AQSS_LENGTH                    0x00000003

#define _PG2SPCIL_AQPS_POSITION                  0x0000000B
#define _PG2SPCIL_AQPS_MASK                      0x00000800
#define _PG2SPCIL_AQPS_LENGTH                    0x00000001

#define _PG2SPCIL_TERM_POSITION                  0x0000000C
#define _PG2SPCIL_TERM_MASK                      0x00007000
#define _PG2SPCIL_TERM_LENGTH                    0x00000003

#define _PG2SPCIL_TSYNCDIS_POSITION              0x0000000F
#define _PG2SPCIL_TSYNCDIS_MASK                  0x00008000
#define _PG2SPCIL_TSYNCDIS_LENGTH                0x00000001

#define _PG2SPCIH_TQSS_POSITION                  0x00000000
#define _PG2SPCIH_TQSS_MASK                      0x00000007
#define _PG2SPCIH_TQSS_LENGTH                    0x00000003

#define _PG2SPCIH_TQPS_POSITION                  0x00000003
#define _PG2SPCIH_TQPS_MASK                      0x00000008
#define _PG2SPCIH_TQPS_LENGTH                    0x00000001

#define _PG2SPCIH_LATMOD_POSITION                0x00000004
#define _PG2SPCIH_LATMOD_MASK                    0x00000010
#define _PG2SPCIH_LATMOD_LENGTH                  0x00000001

#define _PG2SPCIH_SWPCIM_POSITION                0x00000005
#define _PG2SPCIH_SWPCIM_MASK                    0x00000060
#define _PG2SPCIH_SWPCIM_LENGTH                  0x00000002

#define _PG2SPCIH_SWPCI_POSITION                 0x00000007
#define _PG2SPCIH_SWPCI_MASK                     0x00000080
#define _PG2SPCIH_SWPCI_LENGTH                   0x00000001

#define _PG2SPCIH_ACP_POSITION                   0x00000008
#define _PG2SPCIH_ACP_MASK                       0x00000700
#define _PG2SPCIH_ACP_LENGTH                     0x00000003

#define _PG2SPCIH_BPSEL_POSITION                 0x0000000C
#define _PG2SPCIH_BPSEL_MASK                     0x00007000
#define _PG2SPCIH_BPSEL_LENGTH                   0x00000003

#define _PG2SPCIH_BPEN_POSITION                  0x0000000F
#define _PG2SPCIH_BPEN_MASK                      0x00008000
#define _PG2SPCIH_BPEN_LENGTH                    0x00000001

#define _PG2SPCIH_PCIGT_POSITION                 0x00000004
#define _PG2SPCIH_PCIGT_MASK                     0x00000010
#define _PG2SPCIH_PCIGT_LENGTH                   0x00000001

#define _PG2LEBH_PLF_POSITION                    0x00000000
#define _PG2LEBH_PLF_MASK                        0x00000001
#define _PG2LEBH_PLF_LENGTH                      0x00000001

