gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
#define _PG2LEBH_PLR_POSITION                    0x00000001
#define _PG2LEBH_PLR_MASK                        0x00000002
#define _PG2LEBH_PLR_LENGTH                      0x00000001

#define _PG2LEBH_PHF_POSITION                    0x00000002
#define _PG2LEBH_PHF_MASK                        0x00000004
#define _PG2LEBH_PHF_LENGTH                      0x00000001

#define _PG2LEBH_PHR_POSITION                    0x00000003
#define _PG2LEBH_PHR_MASK                        0x00000008
#define _PG2LEBH_PHR_LENGTH                      0x00000001

#define _PG2LEBH_PWMPCI_POSITION                 0x00000008
#define _PG2LEBH_PWMPCI_MASK                     0x00000700
#define _PG2LEBH_PWMPCI_LENGTH                   0x00000003

#define _PG2DCA_DCA_POSITION                     0x00000000
#define _PG2DCA_DCA_MASK                         0x000000FF
#define _PG2DCA_DCA_LENGTH                       0x00000008

#define _PG2DTL_DTL_POSITION                     0x00000000
#define _PG2DTL_DTL_MASK                         0x00003FFF
#define _PG2DTL_DTL_LENGTH                       0x0000000E

#define _PG2DTH_DTH_POSITION                     0x00000000
#define _PG2DTH_DTH_MASK                         0x00003FFF
#define _PG2DTH_DTH_LENGTH                       0x0000000E

#define _PG3CONL_MODSEL_POSITION                 0x00000000
#define _PG3CONL_MODSEL_MASK                     0x00000007
#define _PG3CONL_MODSEL_LENGTH                   0x00000003

#define _PG3CONL_CLKSEL_POSITION                 0x00000003
#define _PG3CONL_CLKSEL_MASK                     0x00000018
#define _PG3CONL_CLKSEL_LENGTH                   0x00000002

#define _PG3CONL_HREN_POSITION                   0x00000007
#define _PG3CONL_HREN_MASK                       0x00000080
#define _PG3CONL_HREN_LENGTH                     0x00000001

#define _PG3CONL_TRGCNT_POSITION                 0x00000008
#define _PG3CONL_TRGCNT_MASK                     0x00000700
#define _PG3CONL_TRGCNT_LENGTH                   0x00000003

#define _PG3CONL_ON_POSITION                     0x0000000F
#define _PG3CONL_ON_MASK                         0x00008000
#define _PG3CONL_ON_LENGTH                       0x00000001

#define _PG3CONH_SOCS_POSITION                   0x00000000
#define _PG3CONH_SOCS_MASK                       0x0000000F
#define _PG3CONH_SOCS_LENGTH                     0x00000004

#define _PG3CONH_TRGMOD_POSITION                 0x00000006
#define _PG3CONH_TRGMOD_MASK                     0x00000040
#define _PG3CONH_TRGMOD_LENGTH                   0x00000001

#define _PG3CONH_UPDMOD_POSITION                 0x00000008
#define _PG3CONH_UPDMOD_MASK                     0x00000700
#define _PG3CONH_UPDMOD_LENGTH                   0x00000003

#define _PG3CONH_MSTEN_POSITION                  0x0000000B
#define _PG3CONH_MSTEN_MASK                      0x00000800
#define _PG3CONH_MSTEN_LENGTH                    0x00000001

#define _PG3CONH_MPHSEL_POSITION                 0x0000000D
#define _PG3CONH_MPHSEL_MASK                     0x00002000
#define _PG3CONH_MPHSEL_LENGTH                   0x00000001

#define _PG3CONH_MPERSEL_POSITION                0x0000000E
#define _PG3CONH_MPERSEL_MASK                    0x00004000
#define _PG3CONH_MPERSEL_LENGTH                  0x00000001

#define _PG3CONH_MDCSEL_POSITION                 0x0000000F
#define _PG3CONH_MDCSEL_MASK                     0x00008000
#define _PG3CONH_MDCSEL_LENGTH                   0x00000001

#define _PG3STAT_TRIG_POSITION                   0x00000000
#define _PG3STAT_TRIG_MASK                       0x00000001
#define _PG3STAT_TRIG_LENGTH                     0x00000001

#define _PG3STAT_CAHALF_POSITION                 0x00000001
#define _PG3STAT_CAHALF_MASK                     0x00000002
#define _PG3STAT_CAHALF_LENGTH                   0x00000001

#define _PG3STAT_STEER_POSITION                  0x00000002
#define _PG3STAT_STEER_MASK                      0x00000004
#define _PG3STAT_STEER_LENGTH                    0x00000001

#define _PG3STAT_UPDREQ_POSITION                 0x00000003
#define _PG3STAT_UPDREQ_MASK                     0x00000008
#define _PG3STAT_UPDREQ_LENGTH                   0x00000001

#define _PG3STAT_UPDATE_POSITION                 0x00000004
#define _PG3STAT_UPDATE_MASK                     0x00000010
#define _PG3STAT_UPDATE_LENGTH                   0x00000001

#define _PG3STAT_CAP_POSITION                    0x00000005
#define _PG3STAT_CAP_MASK                        0x00000020
#define _PG3STAT_CAP_LENGTH                      0x00000001

#define _PG3STAT_TRCLR_POSITION                  0x00000006
#define _PG3STAT_TRCLR_MASK                      0x00000040
#define _PG3STAT_TRCLR_LENGTH                    0x00000001

#define _PG3STAT_TRSET_POSITION                  0x00000007
#define _PG3STAT_TRSET_MASK                      0x00000080
#define _PG3STAT_TRSET_LENGTH                    0x00000001

#define _PG3STAT_FFACT_POSITION                  0x00000008
#define _PG3STAT_FFACT_MASK                      0x00000100
#define _PG3STAT_FFACT_LENGTH                    0x00000001

#define _PG3STAT_CLACT_POSITION                  0x00000009
#define _PG3STAT_CLACT_MASK                      0x00000200
#define _PG3STAT_CLACT_LENGTH                    0x00000001

#define _PG3STAT_FLTACT_POSITION                 0x0000000A
#define _PG3STAT_FLTACT_MASK                     0x00000400
#define _PG3STAT_FLTACT_LENGTH                   0x00000001

#define _PG3STAT_SACT_POSITION                   0x0000000B
#define _PG3STAT_SACT_MASK                       0x00000800
#define _PG3STAT_SACT_LENGTH                     0x00000001

#define _PG3STAT_FFEVT_POSITION                  0x0000000C
#define _PG3STAT_FFEVT_MASK                      0x00001000
#define _PG3STAT_FFEVT_LENGTH                    0x00000001

#define _PG3STAT_CLEVT_POSITION                  0x0000000D
#define _PG3STAT_CLEVT_MASK                      0x00002000
#define _PG3STAT_CLEVT_LENGTH                    0x00000001

#define _PG3STAT_FLTEVT_POSITION                 0x0000000E
#define _PG3STAT_FLTEVT_MASK                     0x00004000
#define _PG3STAT_FLTEVT_LENGTH                   0x00000001

#define _PG3STAT_SEVT_POSITION                   0x0000000F
#define _PG3STAT_SEVT_MASK                       0x00008000
#define _PG3STAT_SEVT_LENGTH                     0x00000001

#define _PG3IOCONL_DBDAT_POSITION                0x00000000
#define _PG3IOCONL_DBDAT_MASK                    0x00000003
#define _PG3IOCONL_DBDAT_LENGTH                  0x00000002

#define _PG3IOCONL_FFDAT_POSITION                0x00000002
#define _PG3IOCONL_FFDAT_MASK                    0x0000000C
#define _PG3IOCONL_FFDAT_LENGTH                  0x00000002

#define _PG3IOCONL_CLDAT_POSITION                0x00000004
#define _PG3IOCONL_CLDAT_MASK                    0x00000030
#define _PG3IOCONL_CLDAT_LENGTH                  0x00000002

#define _PG3IOCONL_FLTDAT_POSITION               0x00000006
#define _PG3IOCONL_FLTDAT_MASK                   0x000000C0
#define _PG3IOCONL_FLTDAT_LENGTH                 0x00000002

#define _PG3IOCONL_OSYNC_POSITION                0x00000008
#define _PG3IOCONL_OSYNC_MASK                    0x00000300
#define _PG3IOCONL_OSYNC_LENGTH                  0x00000002

#define _PG3IOCONL_OVRDAT_POSITION               0x0000000A
#define _PG3IOCONL_OVRDAT_MASK                   0x00000C00
#define _PG3IOCONL_OVRDAT_LENGTH                 0x00000002

#define _PG3IOCONL_OVRENL_POSITION               0x0000000C
#define _PG3IOCONL_OVRENL_MASK                   0x00001000
#define _PG3IOCONL_OVRENL_LENGTH                 0x00000001

