gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
#define _PG5SPCIH_LATMOD_POSITION                0x00000004
#define _PG5SPCIH_LATMOD_MASK                    0x00000010
#define _PG5SPCIH_LATMOD_LENGTH                  0x00000001

#define _PG5SPCIH_SWPCIM_POSITION                0x00000005
#define _PG5SPCIH_SWPCIM_MASK                    0x00000060
#define _PG5SPCIH_SWPCIM_LENGTH                  0x00000002

#define _PG5SPCIH_SWPCI_POSITION                 0x00000007
#define _PG5SPCIH_SWPCI_MASK                     0x00000080
#define _PG5SPCIH_SWPCI_LENGTH                   0x00000001

#define _PG5SPCIH_ACP_POSITION                   0x00000008
#define _PG5SPCIH_ACP_MASK                       0x00000700
#define _PG5SPCIH_ACP_LENGTH                     0x00000003

#define _PG5SPCIH_BPSEL_POSITION                 0x0000000C
#define _PG5SPCIH_BPSEL_MASK                     0x00007000
#define _PG5SPCIH_BPSEL_LENGTH                   0x00000003

#define _PG5SPCIH_BPEN_POSITION                  0x0000000F
#define _PG5SPCIH_BPEN_MASK                      0x00008000
#define _PG5SPCIH_BPEN_LENGTH                    0x00000001

#define _PG5SPCIH_PCIGT_POSITION                 0x00000004
#define _PG5SPCIH_PCIGT_MASK                     0x00000010
#define _PG5SPCIH_PCIGT_LENGTH                   0x00000001

#define _PG5LEBH_PLF_POSITION                    0x00000000
#define _PG5LEBH_PLF_MASK                        0x00000001
#define _PG5LEBH_PLF_LENGTH                      0x00000001

#define _PG5LEBH_PLR_POSITION                    0x00000001
#define _PG5LEBH_PLR_MASK                        0x00000002
#define _PG5LEBH_PLR_LENGTH                      0x00000001

#define _PG5LEBH_PHF_POSITION                    0x00000002
#define _PG5LEBH_PHF_MASK                        0x00000004
#define _PG5LEBH_PHF_LENGTH                      0x00000001

#define _PG5LEBH_PHR_POSITION                    0x00000003
#define _PG5LEBH_PHR_MASK                        0x00000008
#define _PG5LEBH_PHR_LENGTH                      0x00000001

#define _PG5LEBH_PWMPCI_POSITION                 0x00000008
#define _PG5LEBH_PWMPCI_MASK                     0x00000700
#define _PG5LEBH_PWMPCI_LENGTH                   0x00000003

#define _PG5DCA_DCA_POSITION                     0x00000000
#define _PG5DCA_DCA_MASK                         0x000000FF
#define _PG5DCA_DCA_LENGTH                       0x00000008

#define _PG5DTL_DTL_POSITION                     0x00000000
#define _PG5DTL_DTL_MASK                         0x00003FFF
#define _PG5DTL_DTL_LENGTH                       0x0000000E

#define _PG5DTH_DTH_POSITION                     0x00000000
#define _PG5DTH_DTH_MASK                         0x00003FFF
#define _PG5DTH_DTH_LENGTH                       0x0000000E

#define _PG6CONL_MODSEL_POSITION                 0x00000000
#define _PG6CONL_MODSEL_MASK                     0x00000007
#define _PG6CONL_MODSEL_LENGTH                   0x00000003

#define _PG6CONL_CLKSEL_POSITION                 0x00000003
#define _PG6CONL_CLKSEL_MASK                     0x00000018
#define _PG6CONL_CLKSEL_LENGTH                   0x00000002

#define _PG6CONL_HREN_POSITION                   0x00000007
#define _PG6CONL_HREN_MASK                       0x00000080
#define _PG6CONL_HREN_LENGTH                     0x00000001

#define _PG6CONL_TRGCNT_POSITION                 0x00000008
#define _PG6CONL_TRGCNT_MASK                     0x00000700
#define _PG6CONL_TRGCNT_LENGTH                   0x00000003

#define _PG6CONL_ON_POSITION                     0x0000000F
#define _PG6CONL_ON_MASK                         0x00008000
#define _PG6CONL_ON_LENGTH                       0x00000001

#define _PG6CONH_SOCS_POSITION                   0x00000000
#define _PG6CONH_SOCS_MASK                       0x0000000F
#define _PG6CONH_SOCS_LENGTH                     0x00000004

#define _PG6CONH_TRGMOD_POSITION                 0x00000006
#define _PG6CONH_TRGMOD_MASK                     0x00000040
#define _PG6CONH_TRGMOD_LENGTH                   0x00000001

#define _PG6CONH_UPDMOD_POSITION                 0x00000008
#define _PG6CONH_UPDMOD_MASK                     0x00000700
#define _PG6CONH_UPDMOD_LENGTH                   0x00000003

#define _PG6CONH_MSTEN_POSITION                  0x0000000B
#define _PG6CONH_MSTEN_MASK                      0x00000800
#define _PG6CONH_MSTEN_LENGTH                    0x00000001

#define _PG6CONH_MPHSEL_POSITION                 0x0000000D
#define _PG6CONH_MPHSEL_MASK                     0x00002000
#define _PG6CONH_MPHSEL_LENGTH                   0x00000001

#define _PG6CONH_MPERSEL_POSITION                0x0000000E
#define _PG6CONH_MPERSEL_MASK                    0x00004000
#define _PG6CONH_MPERSEL_LENGTH                  0x00000001

#define _PG6CONH_MDCSEL_POSITION                 0x0000000F
#define _PG6CONH_MDCSEL_MASK                     0x00008000
#define _PG6CONH_MDCSEL_LENGTH                   0x00000001

#define _PG6STAT_TRIG_POSITION                   0x00000000
#define _PG6STAT_TRIG_MASK                       0x00000001
#define _PG6STAT_TRIG_LENGTH                     0x00000001

#define _PG6STAT_CAHALF_POSITION                 0x00000001
#define _PG6STAT_CAHALF_MASK                     0x00000002
#define _PG6STAT_CAHALF_LENGTH                   0x00000001

#define _PG6STAT_STEER_POSITION                  0x00000002
#define _PG6STAT_STEER_MASK                      0x00000004
#define _PG6STAT_STEER_LENGTH                    0x00000001

#define _PG6STAT_UPDREQ_POSITION                 0x00000003
#define _PG6STAT_UPDREQ_MASK                     0x00000008
#define _PG6STAT_UPDREQ_LENGTH                   0x00000001

#define _PG6STAT_UPDATE_POSITION                 0x00000004
#define _PG6STAT_UPDATE_MASK                     0x00000010
#define _PG6STAT_UPDATE_LENGTH                   0x00000001

#define _PG6STAT_CAP_POSITION                    0x00000005
#define _PG6STAT_CAP_MASK                        0x00000020
#define _PG6STAT_CAP_LENGTH                      0x00000001

#define _PG6STAT_TRCLR_POSITION                  0x00000006
#define _PG6STAT_TRCLR_MASK                      0x00000040
#define _PG6STAT_TRCLR_LENGTH                    0x00000001

#define _PG6STAT_TRSET_POSITION                  0x00000007
#define _PG6STAT_TRSET_MASK                      0x00000080
#define _PG6STAT_TRSET_LENGTH                    0x00000001

#define _PG6STAT_FFACT_POSITION                  0x00000008
#define _PG6STAT_FFACT_MASK                      0x00000100
#define _PG6STAT_FFACT_LENGTH                    0x00000001

#define _PG6STAT_CLACT_POSITION                  0x00000009
#define _PG6STAT_CLACT_MASK                      0x00000200
#define _PG6STAT_CLACT_LENGTH                    0x00000001

