gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
#define _PG8EVTH_ADTR2EN2_POSITION               0x00000006
#define _PG8EVTH_ADTR2EN2_MASK                   0x00000040
#define _PG8EVTH_ADTR2EN2_LENGTH                 0x00000001

#define _PG8EVTH_ADTR2EN3_POSITION               0x00000007
#define _PG8EVTH_ADTR2EN3_MASK                   0x00000080
#define _PG8EVTH_ADTR2EN3_LENGTH                 0x00000001

#define _PG8EVTH_IEVTSEL_POSITION                0x00000008
#define _PG8EVTH_IEVTSEL_MASK                    0x00000300
#define _PG8EVTH_IEVTSEL_LENGTH                  0x00000002

#define _PG8EVTH_SIEN_POSITION                   0x0000000C
#define _PG8EVTH_SIEN_MASK                       0x00001000
#define _PG8EVTH_SIEN_LENGTH                     0x00000001

#define _PG8EVTH_FFIEN_POSITION                  0x0000000D
#define _PG8EVTH_FFIEN_MASK                      0x00002000
#define _PG8EVTH_FFIEN_LENGTH                    0x00000001

#define _PG8EVTH_CLIEN_POSITION                  0x0000000E
#define _PG8EVTH_CLIEN_MASK                      0x00004000
#define _PG8EVTH_CLIEN_LENGTH                    0x00000001

#define _PG8EVTH_FLTIEN_POSITION                 0x0000000F
#define _PG8EVTH_FLTIEN_MASK                     0x00008000
#define _PG8EVTH_FLTIEN_LENGTH                   0x00000001

#define _PG8FPCIL_PSS_POSITION                   0x00000000
#define _PG8FPCIL_PSS_MASK                       0x0000001F
#define _PG8FPCIL_PSS_LENGTH                     0x00000005

#define _PG8FPCIL_PPS_POSITION                   0x00000005
#define _PG8FPCIL_PPS_MASK                       0x00000020
#define _PG8FPCIL_PPS_LENGTH                     0x00000001

#define _PG8FPCIL_PSYNC_POSITION                 0x00000006
#define _PG8FPCIL_PSYNC_MASK                     0x00000040
#define _PG8FPCIL_PSYNC_LENGTH                   0x00000001

#define _PG8FPCIL_SWTERM_POSITION                0x00000007
#define _PG8FPCIL_SWTERM_MASK                    0x00000080
#define _PG8FPCIL_SWTERM_LENGTH                  0x00000001

#define _PG8FPCIL_AQSS_POSITION                  0x00000008
#define _PG8FPCIL_AQSS_MASK                      0x00000700
#define _PG8FPCIL_AQSS_LENGTH                    0x00000003

#define _PG8FPCIL_AQPS_POSITION                  0x0000000B
#define _PG8FPCIL_AQPS_MASK                      0x00000800
#define _PG8FPCIL_AQPS_LENGTH                    0x00000001

#define _PG8FPCIL_TERM_POSITION                  0x0000000C
#define _PG8FPCIL_TERM_MASK                      0x00007000
#define _PG8FPCIL_TERM_LENGTH                    0x00000003

#define _PG8FPCIL_TSYNCDIS_POSITION              0x0000000F
#define _PG8FPCIL_TSYNCDIS_MASK                  0x00008000
#define _PG8FPCIL_TSYNCDIS_LENGTH                0x00000001

#define _PG8FPCIH_TQSS_POSITION                  0x00000000
#define _PG8FPCIH_TQSS_MASK                      0x00000007
#define _PG8FPCIH_TQSS_LENGTH                    0x00000003

#define _PG8FPCIH_TQPS_POSITION                  0x00000003
#define _PG8FPCIH_TQPS_MASK                      0x00000008
#define _PG8FPCIH_TQPS_LENGTH                    0x00000001

#define _PG8FPCIH_LATMOD_POSITION                0x00000004
#define _PG8FPCIH_LATMOD_MASK                    0x00000010
#define _PG8FPCIH_LATMOD_LENGTH                  0x00000001

#define _PG8FPCIH_SWPCIM_POSITION                0x00000005
#define _PG8FPCIH_SWPCIM_MASK                    0x00000060
#define _PG8FPCIH_SWPCIM_LENGTH                  0x00000002

#define _PG8FPCIH_SWPCI_POSITION                 0x00000007
#define _PG8FPCIH_SWPCI_MASK                     0x00000080
#define _PG8FPCIH_SWPCI_LENGTH                   0x00000001

#define _PG8FPCIH_ACP_POSITION                   0x00000008
#define _PG8FPCIH_ACP_MASK                       0x00000700
#define _PG8FPCIH_ACP_LENGTH                     0x00000003

#define _PG8FPCIH_BPSEL_POSITION                 0x0000000C
#define _PG8FPCIH_BPSEL_MASK                     0x00007000
#define _PG8FPCIH_BPSEL_LENGTH                   0x00000003

#define _PG8FPCIH_BPEN_POSITION                  0x0000000F
#define _PG8FPCIH_BPEN_MASK                      0x00008000
#define _PG8FPCIH_BPEN_LENGTH                    0x00000001

#define _PG8FPCIH_PCIGT_POSITION                 0x00000004
#define _PG8FPCIH_PCIGT_MASK                     0x00000010
#define _PG8FPCIH_PCIGT_LENGTH                   0x00000001

#define _PG8CLPCIL_PSS_POSITION                  0x00000000
#define _PG8CLPCIL_PSS_MASK                      0x0000001F
#define _PG8CLPCIL_PSS_LENGTH                    0x00000005

#define _PG8CLPCIL_PPS_POSITION                  0x00000005
#define _PG8CLPCIL_PPS_MASK                      0x00000020
#define _PG8CLPCIL_PPS_LENGTH                    0x00000001

#define _PG8CLPCIL_PSYNC_POSITION                0x00000006
#define _PG8CLPCIL_PSYNC_MASK                    0x00000040
#define _PG8CLPCIL_PSYNC_LENGTH                  0x00000001

#define _PG8CLPCIL_SWTERM_POSITION               0x00000007
#define _PG8CLPCIL_SWTERM_MASK                   0x00000080
#define _PG8CLPCIL_SWTERM_LENGTH                 0x00000001

#define _PG8CLPCIL_AQSS_POSITION                 0x00000008
#define _PG8CLPCIL_AQSS_MASK                     0x00000700
#define _PG8CLPCIL_AQSS_LENGTH                   0x00000003

#define _PG8CLPCIL_AQPS_POSITION                 0x0000000B
#define _PG8CLPCIL_AQPS_MASK                     0x00000800
#define _PG8CLPCIL_AQPS_LENGTH                   0x00000001

#define _PG8CLPCIL_TERM_POSITION                 0x0000000C
#define _PG8CLPCIL_TERM_MASK                     0x00007000
#define _PG8CLPCIL_TERM_LENGTH                   0x00000003

#define _PG8CLPCIL_TSYNCDIS_POSITION             0x0000000F
#define _PG8CLPCIL_TSYNCDIS_MASK                 0x00008000
#define _PG8CLPCIL_TSYNCDIS_LENGTH               0x00000001

#define _PG8CLPCIH_TQSS_POSITION                 0x00000000
#define _PG8CLPCIH_TQSS_MASK                     0x00000007
#define _PG8CLPCIH_TQSS_LENGTH                   0x00000003

#define _PG8CLPCIH_TQPS_POSITION                 0x00000003
#define _PG8CLPCIH_TQPS_MASK                     0x00000008
#define _PG8CLPCIH_TQPS_LENGTH                   0x00000001

#define _PG8CLPCIH_LATMOD_POSITION               0x00000004
#define _PG8CLPCIH_LATMOD_MASK                   0x00000010
#define _PG8CLPCIH_LATMOD_LENGTH                 0x00000001

#define _PG8CLPCIH_SWPCIM_POSITION               0x00000005
#define _PG8CLPCIH_SWPCIM_MASK                   0x00000060
#define _PG8CLPCIH_SWPCIM_LENGTH                 0x00000002

#define _PG8CLPCIH_SWPCI_POSITION                0x00000007
#define _PG8CLPCIH_SWPCI_MASK                    0x00000080
#define _PG8CLPCIH_SWPCI_LENGTH                  0x00000001

