gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
#define _C1CONH_TXBWS0_POSITION                  0x0000000C
#define _C1CONH_TXBWS0_MASK                      0x00001000
#define _C1CONH_TXBWS0_LENGTH                    0x00000001

#define _C1CONH_TXBWS1_POSITION                  0x0000000D
#define _C1CONH_TXBWS1_MASK                      0x00002000
#define _C1CONH_TXBWS1_LENGTH                    0x00000001

#define _C1CONH_TXBWS2_POSITION                  0x0000000E
#define _C1CONH_TXBWS2_MASK                      0x00004000
#define _C1CONH_TXBWS2_LENGTH                    0x00000001

#define _C1CONH_TXBWS3_POSITION                  0x0000000F
#define _C1CONH_TXBWS3_MASK                      0x00008000
#define _C1CONH_TXBWS3_LENGTH                    0x00000001

#define _C1NBTCFGL_SJW_POSITION                  0x00000000
#define _C1NBTCFGL_SJW_MASK                      0x0000007F
#define _C1NBTCFGL_SJW_LENGTH                    0x00000007

#define _C1NBTCFGL_TSEG2_POSITION                0x00000008
#define _C1NBTCFGL_TSEG2_MASK                    0x00007F00
#define _C1NBTCFGL_TSEG2_LENGTH                  0x00000007

#define _C1NBTCFGL_SJW0_POSITION                 0x00000000
#define _C1NBTCFGL_SJW0_MASK                     0x00000001
#define _C1NBTCFGL_SJW0_LENGTH                   0x00000001

#define _C1NBTCFGL_SJW1_POSITION                 0x00000001
#define _C1NBTCFGL_SJW1_MASK                     0x00000002
#define _C1NBTCFGL_SJW1_LENGTH                   0x00000001

#define _C1NBTCFGL_SJW2_POSITION                 0x00000002
#define _C1NBTCFGL_SJW2_MASK                     0x00000004
#define _C1NBTCFGL_SJW2_LENGTH                   0x00000001

#define _C1NBTCFGL_SJW3_POSITION                 0x00000003
#define _C1NBTCFGL_SJW3_MASK                     0x00000008
#define _C1NBTCFGL_SJW3_LENGTH                   0x00000001

#define _C1NBTCFGL_SJW4_POSITION                 0x00000004
#define _C1NBTCFGL_SJW4_MASK                     0x00000010
#define _C1NBTCFGL_SJW4_LENGTH                   0x00000001

#define _C1NBTCFGL_SJW5_POSITION                 0x00000005
#define _C1NBTCFGL_SJW5_MASK                     0x00000020
#define _C1NBTCFGL_SJW5_LENGTH                   0x00000001

#define _C1NBTCFGL_SJW6_POSITION                 0x00000006
#define _C1NBTCFGL_SJW6_MASK                     0x00000040
#define _C1NBTCFGL_SJW6_LENGTH                   0x00000001

#define _C1NBTCFGL_TSEG20_POSITION               0x00000008
#define _C1NBTCFGL_TSEG20_MASK                   0x00000100
#define _C1NBTCFGL_TSEG20_LENGTH                 0x00000001

#define _C1NBTCFGL_TSEG21_POSITION               0x00000009
#define _C1NBTCFGL_TSEG21_MASK                   0x00000200
#define _C1NBTCFGL_TSEG21_LENGTH                 0x00000001

#define _C1NBTCFGL_TSEG22_POSITION               0x0000000A
#define _C1NBTCFGL_TSEG22_MASK                   0x00000400
#define _C1NBTCFGL_TSEG22_LENGTH                 0x00000001

#define _C1NBTCFGL_TSEG23_POSITION               0x0000000B
#define _C1NBTCFGL_TSEG23_MASK                   0x00000800
#define _C1NBTCFGL_TSEG23_LENGTH                 0x00000001

#define _C1NBTCFGL_TSEG24_POSITION               0x0000000C
#define _C1NBTCFGL_TSEG24_MASK                   0x00001000
#define _C1NBTCFGL_TSEG24_LENGTH                 0x00000001

#define _C1NBTCFGL_TSEG25_POSITION               0x0000000D
#define _C1NBTCFGL_TSEG25_MASK                   0x00002000
#define _C1NBTCFGL_TSEG25_LENGTH                 0x00000001

#define _C1NBTCFGL_TSEG26_POSITION               0x0000000E
#define _C1NBTCFGL_TSEG26_MASK                   0x00004000
#define _C1NBTCFGL_TSEG26_LENGTH                 0x00000001

#define _C1NBTCFGH_TSEG1_POSITION                0x00000000
#define _C1NBTCFGH_TSEG1_MASK                    0x000000FF
#define _C1NBTCFGH_TSEG1_LENGTH                  0x00000008

#define _C1NBTCFGH_BRP_POSITION                  0x00000008
#define _C1NBTCFGH_BRP_MASK                      0x0000FF00
#define _C1NBTCFGH_BRP_LENGTH                    0x00000008

#define _C1NBTCFGH_TSEG10_POSITION               0x00000000
#define _C1NBTCFGH_TSEG10_MASK                   0x00000001
#define _C1NBTCFGH_TSEG10_LENGTH                 0x00000001

#define _C1NBTCFGH_TSEG11_POSITION               0x00000001
#define _C1NBTCFGH_TSEG11_MASK                   0x00000002
#define _C1NBTCFGH_TSEG11_LENGTH                 0x00000001

#define _C1NBTCFGH_TSEG12_POSITION               0x00000002
#define _C1NBTCFGH_TSEG12_MASK                   0x00000004
#define _C1NBTCFGH_TSEG12_LENGTH                 0x00000001

#define _C1NBTCFGH_TSEG13_POSITION               0x00000003
#define _C1NBTCFGH_TSEG13_MASK                   0x00000008
#define _C1NBTCFGH_TSEG13_LENGTH                 0x00000001

#define _C1NBTCFGH_TSEG14_POSITION               0x00000004
#define _C1NBTCFGH_TSEG14_MASK                   0x00000010
#define _C1NBTCFGH_TSEG14_LENGTH                 0x00000001

#define _C1NBTCFGH_TSEG15_POSITION               0x00000005
#define _C1NBTCFGH_TSEG15_MASK                   0x00000020
#define _C1NBTCFGH_TSEG15_LENGTH                 0x00000001

#define _C1NBTCFGH_TSEG16_POSITION               0x00000006
#define _C1NBTCFGH_TSEG16_MASK                   0x00000040
#define _C1NBTCFGH_TSEG16_LENGTH                 0x00000001

#define _C1NBTCFGH_TSEG17_POSITION               0x00000007
#define _C1NBTCFGH_TSEG17_MASK                   0x00000080
#define _C1NBTCFGH_TSEG17_LENGTH                 0x00000001

#define _C1NBTCFGH_BRP0_POSITION                 0x00000008
#define _C1NBTCFGH_BRP0_MASK                     0x00000100
#define _C1NBTCFGH_BRP0_LENGTH                   0x00000001

#define _C1NBTCFGH_BRP1_POSITION                 0x00000009
#define _C1NBTCFGH_BRP1_MASK                     0x00000200
#define _C1NBTCFGH_BRP1_LENGTH                   0x00000001

#define _C1NBTCFGH_BRP2_POSITION                 0x0000000A
#define _C1NBTCFGH_BRP2_MASK                     0x00000400
#define _C1NBTCFGH_BRP2_LENGTH                   0x00000001

#define _C1NBTCFGH_BRP3_POSITION                 0x0000000B
#define _C1NBTCFGH_BRP3_MASK                     0x00000800
#define _C1NBTCFGH_BRP3_LENGTH                   0x00000001

#define _C1NBTCFGH_BRP4_POSITION                 0x0000000C
#define _C1NBTCFGH_BRP4_MASK                     0x00001000
#define _C1NBTCFGH_BRP4_LENGTH                   0x00000001

#define _C1NBTCFGH_BRP5_POSITION                 0x0000000D
#define _C1NBTCFGH_BRP5_MASK                     0x00002000
#define _C1NBTCFGH_BRP5_LENGTH                   0x00000001

