gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
#define _C1NBTCFGH_BRP6_POSITION                 0x0000000E
#define _C1NBTCFGH_BRP6_MASK                     0x00004000
#define _C1NBTCFGH_BRP6_LENGTH                   0x00000001

#define _C1NBTCFGH_BRP7_POSITION                 0x0000000F
#define _C1NBTCFGH_BRP7_MASK                     0x00008000
#define _C1NBTCFGH_BRP7_LENGTH                   0x00000001

#define _C1DBTCFGL_SJW_POSITION                  0x00000000
#define _C1DBTCFGL_SJW_MASK                      0x0000000F
#define _C1DBTCFGL_SJW_LENGTH                    0x00000004

#define _C1DBTCFGL_TSEG2_POSITION                0x00000008
#define _C1DBTCFGL_TSEG2_MASK                    0x00000F00
#define _C1DBTCFGL_TSEG2_LENGTH                  0x00000004

#define _C1DBTCFGL_SJW0_POSITION                 0x00000000
#define _C1DBTCFGL_SJW0_MASK                     0x00000001
#define _C1DBTCFGL_SJW0_LENGTH                   0x00000001

#define _C1DBTCFGL_SJW1_POSITION                 0x00000001
#define _C1DBTCFGL_SJW1_MASK                     0x00000002
#define _C1DBTCFGL_SJW1_LENGTH                   0x00000001

#define _C1DBTCFGL_SJW2_POSITION                 0x00000002
#define _C1DBTCFGL_SJW2_MASK                     0x00000004
#define _C1DBTCFGL_SJW2_LENGTH                   0x00000001

#define _C1DBTCFGL_SJW3_POSITION                 0x00000003
#define _C1DBTCFGL_SJW3_MASK                     0x00000008
#define _C1DBTCFGL_SJW3_LENGTH                   0x00000001

#define _C1DBTCFGL_TSEG20_POSITION               0x00000008
#define _C1DBTCFGL_TSEG20_MASK                   0x00000100
#define _C1DBTCFGL_TSEG20_LENGTH                 0x00000001

#define _C1DBTCFGL_TSEG21_POSITION               0x00000009
#define _C1DBTCFGL_TSEG21_MASK                   0x00000200
#define _C1DBTCFGL_TSEG21_LENGTH                 0x00000001

#define _C1DBTCFGL_TSEG22_POSITION               0x0000000A
#define _C1DBTCFGL_TSEG22_MASK                   0x00000400
#define _C1DBTCFGL_TSEG22_LENGTH                 0x00000001

#define _C1DBTCFGL_TSEG23_POSITION               0x0000000B
#define _C1DBTCFGL_TSEG23_MASK                   0x00000800
#define _C1DBTCFGL_TSEG23_LENGTH                 0x00000001

#define _C1DBTCFGH_TSEG1_POSITION                0x00000000
#define _C1DBTCFGH_TSEG1_MASK                    0x0000001F
#define _C1DBTCFGH_TSEG1_LENGTH                  0x00000005

#define _C1DBTCFGH_BRP_POSITION                  0x00000008
#define _C1DBTCFGH_BRP_MASK                      0x0000FF00
#define _C1DBTCFGH_BRP_LENGTH                    0x00000008

#define _C1DBTCFGH_TSEG10_POSITION               0x00000000
#define _C1DBTCFGH_TSEG10_MASK                   0x00000001
#define _C1DBTCFGH_TSEG10_LENGTH                 0x00000001

#define _C1DBTCFGH_TSEG11_POSITION               0x00000001
#define _C1DBTCFGH_TSEG11_MASK                   0x00000002
#define _C1DBTCFGH_TSEG11_LENGTH                 0x00000001

#define _C1DBTCFGH_TSEG12_POSITION               0x00000002
#define _C1DBTCFGH_TSEG12_MASK                   0x00000004
#define _C1DBTCFGH_TSEG12_LENGTH                 0x00000001

#define _C1DBTCFGH_TSEG13_POSITION               0x00000003
#define _C1DBTCFGH_TSEG13_MASK                   0x00000008
#define _C1DBTCFGH_TSEG13_LENGTH                 0x00000001

#define _C1DBTCFGH_TSEG14_POSITION               0x00000004
#define _C1DBTCFGH_TSEG14_MASK                   0x00000010
#define _C1DBTCFGH_TSEG14_LENGTH                 0x00000001

#define _C1DBTCFGH_BRP0_POSITION                 0x00000008
#define _C1DBTCFGH_BRP0_MASK                     0x00000100
#define _C1DBTCFGH_BRP0_LENGTH                   0x00000001

#define _C1DBTCFGH_BRP1_POSITION                 0x00000009
#define _C1DBTCFGH_BRP1_MASK                     0x00000200
#define _C1DBTCFGH_BRP1_LENGTH                   0x00000001

#define _C1DBTCFGH_BRP2_POSITION                 0x0000000A
#define _C1DBTCFGH_BRP2_MASK                     0x00000400
#define _C1DBTCFGH_BRP2_LENGTH                   0x00000001

#define _C1DBTCFGH_BRP3_POSITION                 0x0000000B
#define _C1DBTCFGH_BRP3_MASK                     0x00000800
#define _C1DBTCFGH_BRP3_LENGTH                   0x00000001

#define _C1DBTCFGH_BRP4_POSITION                 0x0000000C
#define _C1DBTCFGH_BRP4_MASK                     0x00001000
#define _C1DBTCFGH_BRP4_LENGTH                   0x00000001

#define _C1DBTCFGH_BRP5_POSITION                 0x0000000D
#define _C1DBTCFGH_BRP5_MASK                     0x00002000
#define _C1DBTCFGH_BRP5_LENGTH                   0x00000001

#define _C1DBTCFGH_BRP6_POSITION                 0x0000000E
#define _C1DBTCFGH_BRP6_MASK                     0x00004000
#define _C1DBTCFGH_BRP6_LENGTH                   0x00000001

#define _C1DBTCFGH_BRP7_POSITION                 0x0000000F
#define _C1DBTCFGH_BRP7_MASK                     0x00008000
#define _C1DBTCFGH_BRP7_LENGTH                   0x00000001

#define _C1TDCL_TDCV_POSITION                    0x00000000
#define _C1TDCL_TDCV_MASK                        0x0000003F
#define _C1TDCL_TDCV_LENGTH                      0x00000006

#define _C1TDCL_TDCO_POSITION                    0x00000008
#define _C1TDCL_TDCO_MASK                        0x00007F00
#define _C1TDCL_TDCO_LENGTH                      0x00000007

#define _C1TDCL_TDCV0_POSITION                   0x00000000
#define _C1TDCL_TDCV0_MASK                       0x00000001
#define _C1TDCL_TDCV0_LENGTH                     0x00000001

#define _C1TDCL_TDCV1_POSITION                   0x00000001
#define _C1TDCL_TDCV1_MASK                       0x00000002
#define _C1TDCL_TDCV1_LENGTH                     0x00000001

#define _C1TDCL_TDCV2_POSITION                   0x00000002
#define _C1TDCL_TDCV2_MASK                       0x00000004
#define _C1TDCL_TDCV2_LENGTH                     0x00000001

#define _C1TDCL_TDCV3_POSITION                   0x00000003
#define _C1TDCL_TDCV3_MASK                       0x00000008
#define _C1TDCL_TDCV3_LENGTH                     0x00000001

#define _C1TDCL_TDCV4_POSITION                   0x00000004
#define _C1TDCL_TDCV4_MASK                       0x00000010
#define _C1TDCL_TDCV4_LENGTH                     0x00000001

