gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
#define _C1TDCL_TDCV5_POSITION                   0x00000005
#define _C1TDCL_TDCV5_MASK                       0x00000020
#define _C1TDCL_TDCV5_LENGTH                     0x00000001

#define _C1TDCL_TDCO0_POSITION                   0x00000008
#define _C1TDCL_TDCO0_MASK                       0x00000100
#define _C1TDCL_TDCO0_LENGTH                     0x00000001

#define _C1TDCL_TDCO1_POSITION                   0x00000009
#define _C1TDCL_TDCO1_MASK                       0x00000200
#define _C1TDCL_TDCO1_LENGTH                     0x00000001

#define _C1TDCL_TDCO2_POSITION                   0x0000000A
#define _C1TDCL_TDCO2_MASK                       0x00000400
#define _C1TDCL_TDCO2_LENGTH                     0x00000001

#define _C1TDCL_TDCO3_POSITION                   0x0000000B
#define _C1TDCL_TDCO3_MASK                       0x00000800
#define _C1TDCL_TDCO3_LENGTH                     0x00000001

#define _C1TDCL_TDCO4_POSITION                   0x0000000C
#define _C1TDCL_TDCO4_MASK                       0x00001000
#define _C1TDCL_TDCO4_LENGTH                     0x00000001

#define _C1TDCL_TDCO5_POSITION                   0x0000000D
#define _C1TDCL_TDCO5_MASK                       0x00002000
#define _C1TDCL_TDCO5_LENGTH                     0x00000001

#define _C1TDCL_TDCO6_POSITION                   0x0000000E
#define _C1TDCL_TDCO6_MASK                       0x00004000
#define _C1TDCL_TDCO6_LENGTH                     0x00000001

#define _C1TDCH_TDCMOD_POSITION                  0x00000000
#define _C1TDCH_TDCMOD_MASK                      0x00000003
#define _C1TDCH_TDCMOD_LENGTH                    0x00000002

#define _C1TDCH_SID11EN_POSITION                 0x00000008
#define _C1TDCH_SID11EN_MASK                     0x00000100
#define _C1TDCH_SID11EN_LENGTH                   0x00000001

#define _C1TDCH_EDGFLTEN_POSITION                0x00000009
#define _C1TDCH_EDGFLTEN_MASK                    0x00000200
#define _C1TDCH_EDGFLTEN_LENGTH                  0x00000001

#define _C1TDCH_TDCMOD0_POSITION                 0x00000000
#define _C1TDCH_TDCMOD0_MASK                     0x00000001
#define _C1TDCH_TDCMOD0_LENGTH                   0x00000001

#define _C1TDCH_TDCMOD1_POSITION                 0x00000001
#define _C1TDCH_TDCMOD1_MASK                     0x00000002
#define _C1TDCH_TDCMOD1_LENGTH                   0x00000001

#define _C1TBCL_TBC_POSITION                     0x00000000
#define _C1TBCL_TBC_MASK                         0x0000FFFF
#define _C1TBCL_TBC_LENGTH                       0x00000010

#define _C1TBCL_TBC0_POSITION                    0x00000000
#define _C1TBCL_TBC0_MASK                        0x00000001
#define _C1TBCL_TBC0_LENGTH                      0x00000001

#define _C1TBCL_TBC1_POSITION                    0x00000001
#define _C1TBCL_TBC1_MASK                        0x00000002
#define _C1TBCL_TBC1_LENGTH                      0x00000001

#define _C1TBCL_TBC2_POSITION                    0x00000002
#define _C1TBCL_TBC2_MASK                        0x00000004
#define _C1TBCL_TBC2_LENGTH                      0x00000001

#define _C1TBCL_TBC3_POSITION                    0x00000003
#define _C1TBCL_TBC3_MASK                        0x00000008
#define _C1TBCL_TBC3_LENGTH                      0x00000001

#define _C1TBCL_TBC4_POSITION                    0x00000004
#define _C1TBCL_TBC4_MASK                        0x00000010
#define _C1TBCL_TBC4_LENGTH                      0x00000001

#define _C1TBCL_TBC5_POSITION                    0x00000005
#define _C1TBCL_TBC5_MASK                        0x00000020
#define _C1TBCL_TBC5_LENGTH                      0x00000001

#define _C1TBCL_TBC6_POSITION                    0x00000006
#define _C1TBCL_TBC6_MASK                        0x00000040
#define _C1TBCL_TBC6_LENGTH                      0x00000001

#define _C1TBCL_TBC7_POSITION                    0x00000007
#define _C1TBCL_TBC7_MASK                        0x00000080
#define _C1TBCL_TBC7_LENGTH                      0x00000001

#define _C1TBCL_TBC8_POSITION                    0x00000008
#define _C1TBCL_TBC8_MASK                        0x00000100
#define _C1TBCL_TBC8_LENGTH                      0x00000001

#define _C1TBCL_TBC9_POSITION                    0x00000009
#define _C1TBCL_TBC9_MASK                        0x00000200
#define _C1TBCL_TBC9_LENGTH                      0x00000001

#define _C1TBCL_TBC10_POSITION                   0x0000000A
#define _C1TBCL_TBC10_MASK                       0x00000400
#define _C1TBCL_TBC10_LENGTH                     0x00000001

#define _C1TBCL_TBC11_POSITION                   0x0000000B
#define _C1TBCL_TBC11_MASK                       0x00000800
#define _C1TBCL_TBC11_LENGTH                     0x00000001

#define _C1TBCL_TBC12_POSITION                   0x0000000C
#define _C1TBCL_TBC12_MASK                       0x00001000
#define _C1TBCL_TBC12_LENGTH                     0x00000001

#define _C1TBCL_TBC13_POSITION                   0x0000000D
#define _C1TBCL_TBC13_MASK                       0x00002000
#define _C1TBCL_TBC13_LENGTH                     0x00000001

#define _C1TBCL_TBC14_POSITION                   0x0000000E
#define _C1TBCL_TBC14_MASK                       0x00004000
#define _C1TBCL_TBC14_LENGTH                     0x00000001

#define _C1TBCL_TBC15_POSITION                   0x0000000F
#define _C1TBCL_TBC15_MASK                       0x00008000
#define _C1TBCL_TBC15_LENGTH                     0x00000001

#define _C1TBCH_TBC_POSITION                     0x00000000
#define _C1TBCH_TBC_MASK                         0x0000FFFF
#define _C1TBCH_TBC_LENGTH                       0x00000010

#define _C1TBCH_TBC16_POSITION                   0x00000000
#define _C1TBCH_TBC16_MASK                       0x00000001
#define _C1TBCH_TBC16_LENGTH                     0x00000001

#define _C1TBCH_TBC17_POSITION                   0x00000001
#define _C1TBCH_TBC17_MASK                       0x00000002
#define _C1TBCH_TBC17_LENGTH                     0x00000001

#define _C1TBCH_TBC18_POSITION                   0x00000002
#define _C1TBCH_TBC18_MASK                       0x00000004
#define _C1TBCH_TBC18_LENGTH                     0x00000001

#define _C1TBCH_TBC19_POSITION                   0x00000003
#define _C1TBCH_TBC19_MASK                       0x00000008
#define _C1TBCH_TBC19_LENGTH                     0x00000001

