gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
#define _C1TBCH_TBC20_POSITION                   0x00000004
#define _C1TBCH_TBC20_MASK                       0x00000010
#define _C1TBCH_TBC20_LENGTH                     0x00000001

#define _C1TBCH_TBC21_POSITION                   0x00000005
#define _C1TBCH_TBC21_MASK                       0x00000020
#define _C1TBCH_TBC21_LENGTH                     0x00000001

#define _C1TBCH_TBC22_POSITION                   0x00000006
#define _C1TBCH_TBC22_MASK                       0x00000040
#define _C1TBCH_TBC22_LENGTH                     0x00000001

#define _C1TBCH_TBC23_POSITION                   0x00000007
#define _C1TBCH_TBC23_MASK                       0x00000080
#define _C1TBCH_TBC23_LENGTH                     0x00000001

#define _C1TBCH_TBC24_POSITION                   0x00000008
#define _C1TBCH_TBC24_MASK                       0x00000100
#define _C1TBCH_TBC24_LENGTH                     0x00000001

#define _C1TBCH_TBC25_POSITION                   0x00000009
#define _C1TBCH_TBC25_MASK                       0x00000200
#define _C1TBCH_TBC25_LENGTH                     0x00000001

#define _C1TBCH_TBC26_POSITION                   0x0000000A
#define _C1TBCH_TBC26_MASK                       0x00000400
#define _C1TBCH_TBC26_LENGTH                     0x00000001

#define _C1TBCH_TBC27_POSITION                   0x0000000B
#define _C1TBCH_TBC27_MASK                       0x00000800
#define _C1TBCH_TBC27_LENGTH                     0x00000001

#define _C1TBCH_TBC28_POSITION                   0x0000000C
#define _C1TBCH_TBC28_MASK                       0x00001000
#define _C1TBCH_TBC28_LENGTH                     0x00000001

#define _C1TBCH_TBC29_POSITION                   0x0000000D
#define _C1TBCH_TBC29_MASK                       0x00002000
#define _C1TBCH_TBC29_LENGTH                     0x00000001

#define _C1TBCH_TBC30_POSITION                   0x0000000E
#define _C1TBCH_TBC30_MASK                       0x00004000
#define _C1TBCH_TBC30_LENGTH                     0x00000001

#define _C1TBCH_TBC31_POSITION                   0x0000000F
#define _C1TBCH_TBC31_MASK                       0x00008000
#define _C1TBCH_TBC31_LENGTH                     0x00000001

#define _C1TSCONL_TBCPRE_POSITION                0x00000000
#define _C1TSCONL_TBCPRE_MASK                    0x000003FF
#define _C1TSCONL_TBCPRE_LENGTH                  0x0000000A

#define _C1TSCONL_TBCPRE0_POSITION               0x00000000
#define _C1TSCONL_TBCPRE0_MASK                   0x00000001
#define _C1TSCONL_TBCPRE0_LENGTH                 0x00000001

#define _C1TSCONL_TBCPRE1_POSITION               0x00000001
#define _C1TSCONL_TBCPRE1_MASK                   0x00000002
#define _C1TSCONL_TBCPRE1_LENGTH                 0x00000001

#define _C1TSCONL_TBCPRE2_POSITION               0x00000002
#define _C1TSCONL_TBCPRE2_MASK                   0x00000004
#define _C1TSCONL_TBCPRE2_LENGTH                 0x00000001

#define _C1TSCONL_TBCPRE3_POSITION               0x00000003
#define _C1TSCONL_TBCPRE3_MASK                   0x00000008
#define _C1TSCONL_TBCPRE3_LENGTH                 0x00000001

#define _C1TSCONL_TBCPRE4_POSITION               0x00000004
#define _C1TSCONL_TBCPRE4_MASK                   0x00000010
#define _C1TSCONL_TBCPRE4_LENGTH                 0x00000001

#define _C1TSCONL_TBCPRE5_POSITION               0x00000005
#define _C1TSCONL_TBCPRE5_MASK                   0x00000020
#define _C1TSCONL_TBCPRE5_LENGTH                 0x00000001

#define _C1TSCONL_TBCPRE6_POSITION               0x00000006
#define _C1TSCONL_TBCPRE6_MASK                   0x00000040
#define _C1TSCONL_TBCPRE6_LENGTH                 0x00000001

#define _C1TSCONL_TBCPRE7_POSITION               0x00000007
#define _C1TSCONL_TBCPRE7_MASK                   0x00000080
#define _C1TSCONL_TBCPRE7_LENGTH                 0x00000001

#define _C1TSCONL_TBCPRE8_POSITION               0x00000008
#define _C1TSCONL_TBCPRE8_MASK                   0x00000100
#define _C1TSCONL_TBCPRE8_LENGTH                 0x00000001

#define _C1TSCONL_TBCPRE9_POSITION               0x00000009
#define _C1TSCONL_TBCPRE9_MASK                   0x00000200
#define _C1TSCONL_TBCPRE9_LENGTH                 0x00000001

#define _C1TSCONH_TBCEN_POSITION                 0x00000000
#define _C1TSCONH_TBCEN_MASK                     0x00000001
#define _C1TSCONH_TBCEN_LENGTH                   0x00000001

#define _C1TSCONH_TSEOF_POSITION                 0x00000001
#define _C1TSCONH_TSEOF_MASK                     0x00000002
#define _C1TSCONH_TSEOF_LENGTH                   0x00000001

#define _C1TSCONH_TSRES_POSITION                 0x00000002
#define _C1TSCONH_TSRES_MASK                     0x00000004
#define _C1TSCONH_TSRES_LENGTH                   0x00000001

#define _C1VECL_ICODE_POSITION                   0x00000000
#define _C1VECL_ICODE_MASK                       0x0000007F
#define _C1VECL_ICODE_LENGTH                     0x00000007

#define _C1VECL_FILHIT_POSITION                  0x00000008
#define _C1VECL_FILHIT_MASK                      0x00001F00
#define _C1VECL_FILHIT_LENGTH                    0x00000005

#define _C1VECL_ICODE0_POSITION                  0x00000000
#define _C1VECL_ICODE0_MASK                      0x00000001
#define _C1VECL_ICODE0_LENGTH                    0x00000001

#define _C1VECL_ICODE1_POSITION                  0x00000001
#define _C1VECL_ICODE1_MASK                      0x00000002
#define _C1VECL_ICODE1_LENGTH                    0x00000001

#define _C1VECL_ICODE2_POSITION                  0x00000002
#define _C1VECL_ICODE2_MASK                      0x00000004
#define _C1VECL_ICODE2_LENGTH                    0x00000001

#define _C1VECL_ICODE3_POSITION                  0x00000003
#define _C1VECL_ICODE3_MASK                      0x00000008
#define _C1VECL_ICODE3_LENGTH                    0x00000001

#define _C1VECL_ICODE4_POSITION                  0x00000004
#define _C1VECL_ICODE4_MASK                      0x00000010
#define _C1VECL_ICODE4_LENGTH                    0x00000001

#define _C1VECL_ICODE5_POSITION                  0x00000005
#define _C1VECL_ICODE5_MASK                      0x00000020
#define _C1VECL_ICODE5_LENGTH                    0x00000001

#define _C1VECL_ICODE6_POSITION                  0x00000006
#define _C1VECL_ICODE6_MASK                      0x00000040
#define _C1VECL_ICODE6_LENGTH                    0x00000001

#define _C1VECL_FILHIT0_POSITION                 0x00000008
#define _C1VECL_FILHIT0_MASK                     0x00000100
#define _C1VECL_FILHIT0_LENGTH                   0x00000001

#define _C1VECL_FILHIT1_POSITION                 0x00000009
#define _C1VECL_FILHIT1_MASK                     0x00000200
#define _C1VECL_FILHIT1_LENGTH                   0x00000001

