gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
#define _C1VECL_FILHIT2_POSITION                 0x0000000A
#define _C1VECL_FILHIT2_MASK                     0x00000400
#define _C1VECL_FILHIT2_LENGTH                   0x00000001

#define _C1VECL_FILHIT3_POSITION                 0x0000000B
#define _C1VECL_FILHIT3_MASK                     0x00000800
#define _C1VECL_FILHIT3_LENGTH                   0x00000001

#define _C1VECL_FILHIT4_POSITION                 0x0000000C
#define _C1VECL_FILHIT4_MASK                     0x00001000
#define _C1VECL_FILHIT4_LENGTH                   0x00000001

#define _C1VECH_TXCODE_POSITION                  0x00000000
#define _C1VECH_TXCODE_MASK                      0x0000007F
#define _C1VECH_TXCODE_LENGTH                    0x00000007

#define _C1VECH_RXCODE_POSITION                  0x00000008
#define _C1VECH_RXCODE_MASK                      0x00007F00
#define _C1VECH_RXCODE_LENGTH                    0x00000007

#define _C1VECH_TXCODE0_POSITION                 0x00000000
#define _C1VECH_TXCODE0_MASK                     0x00000001
#define _C1VECH_TXCODE0_LENGTH                   0x00000001

#define _C1VECH_TXCODE1_POSITION                 0x00000001
#define _C1VECH_TXCODE1_MASK                     0x00000002
#define _C1VECH_TXCODE1_LENGTH                   0x00000001

#define _C1VECH_TXCODE2_POSITION                 0x00000002
#define _C1VECH_TXCODE2_MASK                     0x00000004
#define _C1VECH_TXCODE2_LENGTH                   0x00000001

#define _C1VECH_TXCODE3_POSITION                 0x00000003
#define _C1VECH_TXCODE3_MASK                     0x00000008
#define _C1VECH_TXCODE3_LENGTH                   0x00000001

#define _C1VECH_TXCODE4_POSITION                 0x00000004
#define _C1VECH_TXCODE4_MASK                     0x00000010
#define _C1VECH_TXCODE4_LENGTH                   0x00000001

#define _C1VECH_TXCODE5_POSITION                 0x00000005
#define _C1VECH_TXCODE5_MASK                     0x00000020
#define _C1VECH_TXCODE5_LENGTH                   0x00000001

#define _C1VECH_TXCODE6_POSITION                 0x00000006
#define _C1VECH_TXCODE6_MASK                     0x00000040
#define _C1VECH_TXCODE6_LENGTH                   0x00000001

#define _C1VECH_RXCODE0_POSITION                 0x00000008
#define _C1VECH_RXCODE0_MASK                     0x00000100
#define _C1VECH_RXCODE0_LENGTH                   0x00000001

#define _C1VECH_RXCODE1_POSITION                 0x00000009
#define _C1VECH_RXCODE1_MASK                     0x00000200
#define _C1VECH_RXCODE1_LENGTH                   0x00000001

#define _C1VECH_RXCODE2_POSITION                 0x0000000A
#define _C1VECH_RXCODE2_MASK                     0x00000400
#define _C1VECH_RXCODE2_LENGTH                   0x00000001

#define _C1VECH_RXCODE3_POSITION                 0x0000000B
#define _C1VECH_RXCODE3_MASK                     0x00000800
#define _C1VECH_RXCODE3_LENGTH                   0x00000001

#define _C1VECH_RXCODE4_POSITION                 0x0000000C
#define _C1VECH_RXCODE4_MASK                     0x00001000
#define _C1VECH_RXCODE4_LENGTH                   0x00000001

#define _C1VECH_RXCODE5_POSITION                 0x0000000D
#define _C1VECH_RXCODE5_MASK                     0x00002000
#define _C1VECH_RXCODE5_LENGTH                   0x00000001

#define _C1VECH_RXCODE6_POSITION                 0x0000000E
#define _C1VECH_RXCODE6_MASK                     0x00004000
#define _C1VECH_RXCODE6_LENGTH                   0x00000001

#define _C1INTL_TXIF_POSITION                    0x00000000
#define _C1INTL_TXIF_MASK                        0x00000001
#define _C1INTL_TXIF_LENGTH                      0x00000001

#define _C1INTL_RXIF_POSITION                    0x00000001
#define _C1INTL_RXIF_MASK                        0x00000002
#define _C1INTL_RXIF_LENGTH                      0x00000001

#define _C1INTL_TBCIF_POSITION                   0x00000002
#define _C1INTL_TBCIF_MASK                       0x00000004
#define _C1INTL_TBCIF_LENGTH                     0x00000001

#define _C1INTL_MODIF_POSITION                   0x00000003
#define _C1INTL_MODIF_MASK                       0x00000008
#define _C1INTL_MODIF_LENGTH                     0x00000001

#define _C1INTL_TEFIF_POSITION                   0x00000004
#define _C1INTL_TEFIF_MASK                       0x00000010
#define _C1INTL_TEFIF_LENGTH                     0x00000001

#define _C1INTL_TXATIF_POSITION                  0x0000000A
#define _C1INTL_TXATIF_MASK                      0x00000400
#define _C1INTL_TXATIF_LENGTH                    0x00000001

#define _C1INTL_RXOVIF_POSITION                  0x0000000B
#define _C1INTL_RXOVIF_MASK                      0x00000800
#define _C1INTL_RXOVIF_LENGTH                    0x00000001

#define _C1INTL_SERRIF_POSITION                  0x0000000C
#define _C1INTL_SERRIF_MASK                      0x00001000
#define _C1INTL_SERRIF_LENGTH                    0x00000001

#define _C1INTL_CERRIF_POSITION                  0x0000000D
#define _C1INTL_CERRIF_MASK                      0x00002000
#define _C1INTL_CERRIF_LENGTH                    0x00000001

#define _C1INTL_WAKIF_POSITION                   0x0000000E
#define _C1INTL_WAKIF_MASK                       0x00004000
#define _C1INTL_WAKIF_LENGTH                     0x00000001

#define _C1INTL_IVMIF_POSITION                   0x0000000F
#define _C1INTL_IVMIF_MASK                       0x00008000
#define _C1INTL_IVMIF_LENGTH                     0x00000001

#define _C1INTH_TXIE_POSITION                    0x00000000
#define _C1INTH_TXIE_MASK                        0x00000001
#define _C1INTH_TXIE_LENGTH                      0x00000001

#define _C1INTH_RXIE_POSITION                    0x00000001
#define _C1INTH_RXIE_MASK                        0x00000002
#define _C1INTH_RXIE_LENGTH                      0x00000001

#define _C1INTH_TBCIE_POSITION                   0x00000002
#define _C1INTH_TBCIE_MASK                       0x00000004
#define _C1INTH_TBCIE_LENGTH                     0x00000001

#define _C1INTH_MODIE_POSITION                   0x00000003
#define _C1INTH_MODIE_MASK                       0x00000008
#define _C1INTH_MODIE_LENGTH                     0x00000001

#define _C1INTH_TEFIE_POSITION                   0x00000004
#define _C1INTH_TEFIE_MASK                       0x00000010
#define _C1INTH_TEFIE_LENGTH                     0x00000001

#define _C1INTH_TXATIE_POSITION                  0x0000000A
#define _C1INTH_TXATIE_MASK                      0x00000400
#define _C1INTH_TXATIE_LENGTH                    0x00000001

#define _C1INTH_RXOVIE_POSITION                  0x0000000B
#define _C1INTH_RXOVIE_MASK                      0x00000800
#define _C1INTH_RXOVIE_LENGTH                    0x00000001

#define _C1INTH_SERRIE_POSITION                  0x0000000C
#define _C1INTH_SERRIE_MASK                      0x00001000
#define _C1INTH_SERRIE_LENGTH                    0x00000001

#define _C1INTH_CERRIE_POSITION                  0x0000000D
#define _C1INTH_CERRIE_MASK                      0x00002000
#define _C1INTH_CERRIE_LENGTH                    0x00000001

