gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
#define _C1INTH_WAKIE_POSITION                   0x0000000E
#define _C1INTH_WAKIE_MASK                       0x00004000
#define _C1INTH_WAKIE_LENGTH                     0x00000001

#define _C1INTH_IVMIE_POSITION                   0x0000000F
#define _C1INTH_IVMIE_MASK                       0x00008000
#define _C1INTH_IVMIE_LENGTH                     0x00000001

#define _C1RXIFL_RFIF_POSITION                   0x00000001
#define _C1RXIFL_RFIF_MASK                       0x0000FFFE
#define _C1RXIFL_RFIF_LENGTH                     0x0000000F

#define _C1RXIFL_RFIF1_POSITION                  0x00000001
#define _C1RXIFL_RFIF1_MASK                      0x00000002
#define _C1RXIFL_RFIF1_LENGTH                    0x00000001

#define _C1RXIFL_RFIF2_POSITION                  0x00000002
#define _C1RXIFL_RFIF2_MASK                      0x00000004
#define _C1RXIFL_RFIF2_LENGTH                    0x00000001

#define _C1RXIFL_RFIF3_POSITION                  0x00000003
#define _C1RXIFL_RFIF3_MASK                      0x00000008
#define _C1RXIFL_RFIF3_LENGTH                    0x00000001

#define _C1RXIFL_RFIF4_POSITION                  0x00000004
#define _C1RXIFL_RFIF4_MASK                      0x00000010
#define _C1RXIFL_RFIF4_LENGTH                    0x00000001

#define _C1RXIFL_RFIF5_POSITION                  0x00000005
#define _C1RXIFL_RFIF5_MASK                      0x00000020
#define _C1RXIFL_RFIF5_LENGTH                    0x00000001

#define _C1RXIFL_RFIF6_POSITION                  0x00000006
#define _C1RXIFL_RFIF6_MASK                      0x00000040
#define _C1RXIFL_RFIF6_LENGTH                    0x00000001

#define _C1RXIFL_RFIF7_POSITION                  0x00000007
#define _C1RXIFL_RFIF7_MASK                      0x00000080
#define _C1RXIFL_RFIF7_LENGTH                    0x00000001

#define _C1RXIFL_RFIF8_POSITION                  0x00000008
#define _C1RXIFL_RFIF8_MASK                      0x00000100
#define _C1RXIFL_RFIF8_LENGTH                    0x00000001

#define _C1RXIFL_RFIF9_POSITION                  0x00000009
#define _C1RXIFL_RFIF9_MASK                      0x00000200
#define _C1RXIFL_RFIF9_LENGTH                    0x00000001

#define _C1RXIFL_RFIF10_POSITION                 0x0000000A
#define _C1RXIFL_RFIF10_MASK                     0x00000400
#define _C1RXIFL_RFIF10_LENGTH                   0x00000001

#define _C1RXIFL_RFIF11_POSITION                 0x0000000B
#define _C1RXIFL_RFIF11_MASK                     0x00000800
#define _C1RXIFL_RFIF11_LENGTH                   0x00000001

#define _C1RXIFL_RFIF12_POSITION                 0x0000000C
#define _C1RXIFL_RFIF12_MASK                     0x00001000
#define _C1RXIFL_RFIF12_LENGTH                   0x00000001

#define _C1RXIFL_RFIF13_POSITION                 0x0000000D
#define _C1RXIFL_RFIF13_MASK                     0x00002000
#define _C1RXIFL_RFIF13_LENGTH                   0x00000001

#define _C1RXIFL_RFIF14_POSITION                 0x0000000E
#define _C1RXIFL_RFIF14_MASK                     0x00004000
#define _C1RXIFL_RFIF14_LENGTH                   0x00000001

#define _C1RXIFL_RFIF15_POSITION                 0x0000000F
#define _C1RXIFL_RFIF15_MASK                     0x00008000
#define _C1RXIFL_RFIF15_LENGTH                   0x00000001

#define _C1RXIFH_RFIF_POSITION                   0x00000000
#define _C1RXIFH_RFIF_MASK                       0x0000FFFF
#define _C1RXIFH_RFIF_LENGTH                     0x00000010

#define _C1RXIFH_RFIF16_POSITION                 0x00000000
#define _C1RXIFH_RFIF16_MASK                     0x00000001
#define _C1RXIFH_RFIF16_LENGTH                   0x00000001

#define _C1RXIFH_RFIF17_POSITION                 0x00000001
#define _C1RXIFH_RFIF17_MASK                     0x00000002
#define _C1RXIFH_RFIF17_LENGTH                   0x00000001

#define _C1RXIFH_RFIF18_POSITION                 0x00000002
#define _C1RXIFH_RFIF18_MASK                     0x00000004
#define _C1RXIFH_RFIF18_LENGTH                   0x00000001

#define _C1RXIFH_RFIF19_POSITION                 0x00000003
#define _C1RXIFH_RFIF19_MASK                     0x00000008
#define _C1RXIFH_RFIF19_LENGTH                   0x00000001

#define _C1RXIFH_RFIF20_POSITION                 0x00000004
#define _C1RXIFH_RFIF20_MASK                     0x00000010
#define _C1RXIFH_RFIF20_LENGTH                   0x00000001

#define _C1RXIFH_RFIF21_POSITION                 0x00000005
#define _C1RXIFH_RFIF21_MASK                     0x00000020
#define _C1RXIFH_RFIF21_LENGTH                   0x00000001

#define _C1RXIFH_RFIF22_POSITION                 0x00000006
#define _C1RXIFH_RFIF22_MASK                     0x00000040
#define _C1RXIFH_RFIF22_LENGTH                   0x00000001

#define _C1RXIFH_RFIF23_POSITION                 0x00000007
#define _C1RXIFH_RFIF23_MASK                     0x00000080
#define _C1RXIFH_RFIF23_LENGTH                   0x00000001

#define _C1RXIFH_RFIF24_POSITION                 0x00000008
#define _C1RXIFH_RFIF24_MASK                     0x00000100
#define _C1RXIFH_RFIF24_LENGTH                   0x00000001

#define _C1RXIFH_RFIF25_POSITION                 0x00000009
#define _C1RXIFH_RFIF25_MASK                     0x00000200
#define _C1RXIFH_RFIF25_LENGTH                   0x00000001

#define _C1RXIFH_RFIF26_POSITION                 0x0000000A
#define _C1RXIFH_RFIF26_MASK                     0x00000400
#define _C1RXIFH_RFIF26_LENGTH                   0x00000001

#define _C1RXIFH_RFIF27_POSITION                 0x0000000B
#define _C1RXIFH_RFIF27_MASK                     0x00000800
#define _C1RXIFH_RFIF27_LENGTH                   0x00000001

#define _C1RXIFH_RFIF28_POSITION                 0x0000000C
#define _C1RXIFH_RFIF28_MASK                     0x00001000
#define _C1RXIFH_RFIF28_LENGTH                   0x00000001

#define _C1RXIFH_RFIF29_POSITION                 0x0000000D
#define _C1RXIFH_RFIF29_MASK                     0x00002000
#define _C1RXIFH_RFIF29_LENGTH                   0x00000001

#define _C1RXIFH_RFIF30_POSITION                 0x0000000E
#define _C1RXIFH_RFIF30_MASK                     0x00004000
#define _C1RXIFH_RFIF30_LENGTH                   0x00000001

#define _C1RXIFH_RFIF31_POSITION                 0x0000000F
#define _C1RXIFH_RFIF31_MASK                     0x00008000
#define _C1RXIFH_RFIF31_LENGTH                   0x00000001

#define _C1TXIFL_TFIF_POSITION                   0x00000000
#define _C1TXIFL_TFIF_MASK                       0x0000FFFF
#define _C1TXIFL_TFIF_LENGTH                     0x00000010

