gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
#define _C1TXIFL_TFIF0_POSITION                  0x00000000
#define _C1TXIFL_TFIF0_MASK                      0x00000001
#define _C1TXIFL_TFIF0_LENGTH                    0x00000001

#define _C1TXIFL_TFIF1_POSITION                  0x00000001
#define _C1TXIFL_TFIF1_MASK                      0x00000002
#define _C1TXIFL_TFIF1_LENGTH                    0x00000001

#define _C1TXIFL_TFIF2_POSITION                  0x00000002
#define _C1TXIFL_TFIF2_MASK                      0x00000004
#define _C1TXIFL_TFIF2_LENGTH                    0x00000001

#define _C1TXIFL_TFIF3_POSITION                  0x00000003
#define _C1TXIFL_TFIF3_MASK                      0x00000008
#define _C1TXIFL_TFIF3_LENGTH                    0x00000001

#define _C1TXIFL_TFIF4_POSITION                  0x00000004
#define _C1TXIFL_TFIF4_MASK                      0x00000010
#define _C1TXIFL_TFIF4_LENGTH                    0x00000001

#define _C1TXIFL_TFIF5_POSITION                  0x00000005
#define _C1TXIFL_TFIF5_MASK                      0x00000020
#define _C1TXIFL_TFIF5_LENGTH                    0x00000001

#define _C1TXIFL_TFIF6_POSITION                  0x00000006
#define _C1TXIFL_TFIF6_MASK                      0x00000040
#define _C1TXIFL_TFIF6_LENGTH                    0x00000001

#define _C1TXIFL_TFIF7_POSITION                  0x00000007
#define _C1TXIFL_TFIF7_MASK                      0x00000080
#define _C1TXIFL_TFIF7_LENGTH                    0x00000001

#define _C1TXIFL_TFIF8_POSITION                  0x00000008
#define _C1TXIFL_TFIF8_MASK                      0x00000100
#define _C1TXIFL_TFIF8_LENGTH                    0x00000001

#define _C1TXIFL_TFIF9_POSITION                  0x00000009
#define _C1TXIFL_TFIF9_MASK                      0x00000200
#define _C1TXIFL_TFIF9_LENGTH                    0x00000001

#define _C1TXIFL_TFIF10_POSITION                 0x0000000A
#define _C1TXIFL_TFIF10_MASK                     0x00000400
#define _C1TXIFL_TFIF10_LENGTH                   0x00000001

#define _C1TXIFL_TFIF11_POSITION                 0x0000000B
#define _C1TXIFL_TFIF11_MASK                     0x00000800
#define _C1TXIFL_TFIF11_LENGTH                   0x00000001

#define _C1TXIFL_TFIF12_POSITION                 0x0000000C
#define _C1TXIFL_TFIF12_MASK                     0x00001000
#define _C1TXIFL_TFIF12_LENGTH                   0x00000001

#define _C1TXIFL_TFIF13_POSITION                 0x0000000D
#define _C1TXIFL_TFIF13_MASK                     0x00002000
#define _C1TXIFL_TFIF13_LENGTH                   0x00000001

#define _C1TXIFL_TFIF14_POSITION                 0x0000000E
#define _C1TXIFL_TFIF14_MASK                     0x00004000
#define _C1TXIFL_TFIF14_LENGTH                   0x00000001

#define _C1TXIFL_TFIF15_POSITION                 0x0000000F
#define _C1TXIFL_TFIF15_MASK                     0x00008000
#define _C1TXIFL_TFIF15_LENGTH                   0x00000001

#define _C1TXIFH_TFIF_POSITION                   0x00000000
#define _C1TXIFH_TFIF_MASK                       0x0000FFFF
#define _C1TXIFH_TFIF_LENGTH                     0x00000010

#define _C1TXIFH_TFIF16_POSITION                 0x00000000
#define _C1TXIFH_TFIF16_MASK                     0x00000001
#define _C1TXIFH_TFIF16_LENGTH                   0x00000001

#define _C1TXIFH_TFIF17_POSITION                 0x00000001
#define _C1TXIFH_TFIF17_MASK                     0x00000002
#define _C1TXIFH_TFIF17_LENGTH                   0x00000001

#define _C1TXIFH_TFIF18_POSITION                 0x00000002
#define _C1TXIFH_TFIF18_MASK                     0x00000004
#define _C1TXIFH_TFIF18_LENGTH                   0x00000001

#define _C1TXIFH_TFIF19_POSITION                 0x00000003
#define _C1TXIFH_TFIF19_MASK                     0x00000008
#define _C1TXIFH_TFIF19_LENGTH                   0x00000001

#define _C1TXIFH_TFIF20_POSITION                 0x00000004
#define _C1TXIFH_TFIF20_MASK                     0x00000010
#define _C1TXIFH_TFIF20_LENGTH                   0x00000001

#define _C1TXIFH_TFIF21_POSITION                 0x00000005
#define _C1TXIFH_TFIF21_MASK                     0x00000020
#define _C1TXIFH_TFIF21_LENGTH                   0x00000001

#define _C1TXIFH_TFIF22_POSITION                 0x00000006
#define _C1TXIFH_TFIF22_MASK                     0x00000040
#define _C1TXIFH_TFIF22_LENGTH                   0x00000001

#define _C1TXIFH_TFIF23_POSITION                 0x00000007
#define _C1TXIFH_TFIF23_MASK                     0x00000080
#define _C1TXIFH_TFIF23_LENGTH                   0x00000001

#define _C1TXIFH_TFIF24_POSITION                 0x00000008
#define _C1TXIFH_TFIF24_MASK                     0x00000100
#define _C1TXIFH_TFIF24_LENGTH                   0x00000001

#define _C1TXIFH_TFIF25_POSITION                 0x00000009
#define _C1TXIFH_TFIF25_MASK                     0x00000200
#define _C1TXIFH_TFIF25_LENGTH                   0x00000001

#define _C1TXIFH_TFIF26_POSITION                 0x0000000A
#define _C1TXIFH_TFIF26_MASK                     0x00000400
#define _C1TXIFH_TFIF26_LENGTH                   0x00000001

#define _C1TXIFH_TFIF27_POSITION                 0x0000000B
#define _C1TXIFH_TFIF27_MASK                     0x00000800
#define _C1TXIFH_TFIF27_LENGTH                   0x00000001

#define _C1TXIFH_TFIF28_POSITION                 0x0000000C
#define _C1TXIFH_TFIF28_MASK                     0x00001000
#define _C1TXIFH_TFIF28_LENGTH                   0x00000001

#define _C1TXIFH_TFIF29_POSITION                 0x0000000D
#define _C1TXIFH_TFIF29_MASK                     0x00002000
#define _C1TXIFH_TFIF29_LENGTH                   0x00000001

#define _C1TXIFH_TFIF30_POSITION                 0x0000000E
#define _C1TXIFH_TFIF30_MASK                     0x00004000
#define _C1TXIFH_TFIF30_LENGTH                   0x00000001

#define _C1TXIFH_TFIF31_POSITION                 0x0000000F
#define _C1TXIFH_TFIF31_MASK                     0x00008000
#define _C1TXIFH_TFIF31_LENGTH                   0x00000001

#define _C1RXOVIFL_RFOVIF_POSITION               0x00000001
#define _C1RXOVIFL_RFOVIF_MASK                   0x0000FFFE
#define _C1RXOVIFL_RFOVIF_LENGTH                 0x0000000F

#define _C1RXOVIFL_RFOVIF1_POSITION              0x00000001
#define _C1RXOVIFL_RFOVIF1_MASK                  0x00000002
#define _C1RXOVIFL_RFOVIF1_LENGTH                0x00000001

#define _C1RXOVIFL_RFOVIF2_POSITION              0x00000002
#define _C1RXOVIFL_RFOVIF2_MASK                  0x00000004
#define _C1RXOVIFL_RFOVIF2_LENGTH                0x00000001

#define _C1RXOVIFL_RFOVIF3_POSITION              0x00000003
#define _C1RXOVIFL_RFOVIF3_MASK                  0x00000008
#define _C1RXOVIFL_RFOVIF3_LENGTH                0x00000001

#define _C1RXOVIFL_RFOVIF4_POSITION              0x00000004
#define _C1RXOVIFL_RFOVIF4_MASK                  0x00000010
#define _C1RXOVIFL_RFOVIF4_LENGTH                0x00000001

#define _C1RXOVIFL_RFOVIF5_POSITION              0x00000005
#define _C1RXOVIFL_RFOVIF5_MASK                  0x00000020
#define _C1RXOVIFL_RFOVIF5_LENGTH                0x00000001

#define _C1RXOVIFL_RFOVIF6_POSITION              0x00000006
#define _C1RXOVIFL_RFOVIF6_MASK                  0x00000040
#define _C1RXOVIFL_RFOVIF6_LENGTH                0x00000001

#define _C1RXOVIFL_RFOVIF7_POSITION              0x00000007
#define _C1RXOVIFL_RFOVIF7_MASK                  0x00000080
#define _C1RXOVIFL_RFOVIF7_LENGTH                0x00000001

#define _C1RXOVIFL_RFOVIF8_POSITION              0x00000008
#define _C1RXOVIFL_RFOVIF8_MASK                  0x00000100
#define _C1RXOVIFL_RFOVIF8_LENGTH                0x00000001

#define _C1RXOVIFL_RFOVIF9_POSITION              0x00000009
#define _C1RXOVIFL_RFOVIF9_MASK                  0x00000200
#define _C1RXOVIFL_RFOVIF9_LENGTH                0x00000001

#define _C1RXOVIFL_RFOVIF10_POSITION             0x0000000A
#define _C1RXOVIFL_RFOVIF10_MASK                 0x00000400
#define _C1RXOVIFL_RFOVIF10_LENGTH               0x00000001

#define _C1RXOVIFL_RFOVIF11_POSITION             0x0000000B
#define _C1RXOVIFL_RFOVIF11_MASK                 0x00000800
#define _C1RXOVIFL_RFOVIF11_LENGTH               0x00000001

#define _C1RXOVIFL_RFOVIF12_POSITION             0x0000000C
#define _C1RXOVIFL_RFOVIF12_MASK                 0x00001000
#define _C1RXOVIFL_RFOVIF12_LENGTH               0x00000001

#define _C1RXOVIFL_RFOVIF13_POSITION             0x0000000D
#define _C1RXOVIFL_RFOVIF13_MASK                 0x00002000
#define _C1RXOVIFL_RFOVIF13_LENGTH               0x00000001

#define _C1RXOVIFL_RFOVIF14_POSITION             0x0000000E
#define _C1RXOVIFL_RFOVIF14_MASK                 0x00004000
#define _C1RXOVIFL_RFOVIF14_LENGTH               0x00000001

#define _C1RXOVIFL_RFOVIF15_POSITION             0x0000000F
#define _C1RXOVIFL_RFOVIF15_MASK                 0x00008000
#define _C1RXOVIFL_RFOVIF15_LENGTH               0x00000001

