gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
#define _C1RXOVIFH_RFOVIF_POSITION               0x00000000
#define _C1RXOVIFH_RFOVIF_MASK                   0x0000FFFF
#define _C1RXOVIFH_RFOVIF_LENGTH                 0x00000010

#define _C1RXOVIFH_RFOVIF16_POSITION             0x00000000
#define _C1RXOVIFH_RFOVIF16_MASK                 0x00000001
#define _C1RXOVIFH_RFOVIF16_LENGTH               0x00000001

#define _C1RXOVIFH_RFOVIF17_POSITION             0x00000001
#define _C1RXOVIFH_RFOVIF17_MASK                 0x00000002
#define _C1RXOVIFH_RFOVIF17_LENGTH               0x00000001

#define _C1RXOVIFH_RFOVIF18_POSITION             0x00000002
#define _C1RXOVIFH_RFOVIF18_MASK                 0x00000004
#define _C1RXOVIFH_RFOVIF18_LENGTH               0x00000001

#define _C1RXOVIFH_RFOVIF19_POSITION             0x00000003
#define _C1RXOVIFH_RFOVIF19_MASK                 0x00000008
#define _C1RXOVIFH_RFOVIF19_LENGTH               0x00000001

#define _C1RXOVIFH_RFOVIF20_POSITION             0x00000004
#define _C1RXOVIFH_RFOVIF20_MASK                 0x00000010
#define _C1RXOVIFH_RFOVIF20_LENGTH               0x00000001

#define _C1RXOVIFH_RFOVIF21_POSITION             0x00000005
#define _C1RXOVIFH_RFOVIF21_MASK                 0x00000020
#define _C1RXOVIFH_RFOVIF21_LENGTH               0x00000001

#define _C1RXOVIFH_RFOVIF22_POSITION             0x00000006
#define _C1RXOVIFH_RFOVIF22_MASK                 0x00000040
#define _C1RXOVIFH_RFOVIF22_LENGTH               0x00000001

#define _C1RXOVIFH_RFOVIF23_POSITION             0x00000007
#define _C1RXOVIFH_RFOVIF23_MASK                 0x00000080
#define _C1RXOVIFH_RFOVIF23_LENGTH               0x00000001

#define _C1RXOVIFH_RFOVIF24_POSITION             0x00000008
#define _C1RXOVIFH_RFOVIF24_MASK                 0x00000100
#define _C1RXOVIFH_RFOVIF24_LENGTH               0x00000001

#define _C1RXOVIFH_RFOVIF25_POSITION             0x00000009
#define _C1RXOVIFH_RFOVIF25_MASK                 0x00000200
#define _C1RXOVIFH_RFOVIF25_LENGTH               0x00000001

#define _C1RXOVIFH_RFOVIF26_POSITION             0x0000000A
#define _C1RXOVIFH_RFOVIF26_MASK                 0x00000400
#define _C1RXOVIFH_RFOVIF26_LENGTH               0x00000001

#define _C1RXOVIFH_RFOVIF27_POSITION             0x0000000B
#define _C1RXOVIFH_RFOVIF27_MASK                 0x00000800
#define _C1RXOVIFH_RFOVIF27_LENGTH               0x00000001

#define _C1RXOVIFH_RFOVIF28_POSITION             0x0000000C
#define _C1RXOVIFH_RFOVIF28_MASK                 0x00001000
#define _C1RXOVIFH_RFOVIF28_LENGTH               0x00000001

#define _C1RXOVIFH_RFOVIF29_POSITION             0x0000000D
#define _C1RXOVIFH_RFOVIF29_MASK                 0x00002000
#define _C1RXOVIFH_RFOVIF29_LENGTH               0x00000001

#define _C1RXOVIFH_RFOVIF30_POSITION             0x0000000E
#define _C1RXOVIFH_RFOVIF30_MASK                 0x00004000
#define _C1RXOVIFH_RFOVIF30_LENGTH               0x00000001

#define _C1RXOVIFH_RFOVIF31_POSITION             0x0000000F
#define _C1RXOVIFH_RFOVIF31_MASK                 0x00008000
#define _C1RXOVIFH_RFOVIF31_LENGTH               0x00000001

#define _C1TXATIFL_TFATIF_POSITION               0x00000000
#define _C1TXATIFL_TFATIF_MASK                   0x0000FFFF
#define _C1TXATIFL_TFATIF_LENGTH                 0x00000010

#define _C1TXATIFL_TFATIF0_POSITION              0x00000000
#define _C1TXATIFL_TFATIF0_MASK                  0x00000001
#define _C1TXATIFL_TFATIF0_LENGTH                0x00000001

#define _C1TXATIFL_TFATIF1_POSITION              0x00000001
#define _C1TXATIFL_TFATIF1_MASK                  0x00000002
#define _C1TXATIFL_TFATIF1_LENGTH                0x00000001

#define _C1TXATIFL_TFATIF2_POSITION              0x00000002
#define _C1TXATIFL_TFATIF2_MASK                  0x00000004
#define _C1TXATIFL_TFATIF2_LENGTH                0x00000001

#define _C1TXATIFL_TFATIF3_POSITION              0x00000003
#define _C1TXATIFL_TFATIF3_MASK                  0x00000008
#define _C1TXATIFL_TFATIF3_LENGTH                0x00000001

#define _C1TXATIFL_TFATIF4_POSITION              0x00000004
#define _C1TXATIFL_TFATIF4_MASK                  0x00000010
#define _C1TXATIFL_TFATIF4_LENGTH                0x00000001

#define _C1TXATIFL_TFATIF5_POSITION              0x00000005
#define _C1TXATIFL_TFATIF5_MASK                  0x00000020
#define _C1TXATIFL_TFATIF5_LENGTH                0x00000001

#define _C1TXATIFL_TFATIF6_POSITION              0x00000006
#define _C1TXATIFL_TFATIF6_MASK                  0x00000040
#define _C1TXATIFL_TFATIF6_LENGTH                0x00000001

#define _C1TXATIFL_TFATIF7_POSITION              0x00000007
#define _C1TXATIFL_TFATIF7_MASK                  0x00000080
#define _C1TXATIFL_TFATIF7_LENGTH                0x00000001

#define _C1TXATIFL_TFATIF8_POSITION              0x00000008
#define _C1TXATIFL_TFATIF8_MASK                  0x00000100
#define _C1TXATIFL_TFATIF8_LENGTH                0x00000001

#define _C1TXATIFL_TFATIF9_POSITION              0x00000009
#define _C1TXATIFL_TFATIF9_MASK                  0x00000200
#define _C1TXATIFL_TFATIF9_LENGTH                0x00000001

#define _C1TXATIFL_TFATIF10_POSITION             0x0000000A
#define _C1TXATIFL_TFATIF10_MASK                 0x00000400
#define _C1TXATIFL_TFATIF10_LENGTH               0x00000001

#define _C1TXATIFL_TFATIF11_POSITION             0x0000000B
#define _C1TXATIFL_TFATIF11_MASK                 0x00000800
#define _C1TXATIFL_TFATIF11_LENGTH               0x00000001

#define _C1TXATIFL_TFATIF12_POSITION             0x0000000C
#define _C1TXATIFL_TFATIF12_MASK                 0x00001000
#define _C1TXATIFL_TFATIF12_LENGTH               0x00000001

#define _C1TXATIFL_TFATIF13_POSITION             0x0000000D
#define _C1TXATIFL_TFATIF13_MASK                 0x00002000
#define _C1TXATIFL_TFATIF13_LENGTH               0x00000001

#define _C1TXATIFL_TFATIF14_POSITION             0x0000000E
#define _C1TXATIFL_TFATIF14_MASK                 0x00004000
#define _C1TXATIFL_TFATIF14_LENGTH               0x00000001

#define _C1TXATIFL_TFATIF15_POSITION             0x0000000F
#define _C1TXATIFL_TFATIF15_MASK                 0x00008000
#define _C1TXATIFL_TFATIF15_LENGTH               0x00000001

#define _C1TXATIFH_TFATIF_POSITION               0x00000000
#define _C1TXATIFH_TFATIF_MASK                   0x0000FFFF
#define _C1TXATIFH_TFATIF_LENGTH                 0x00000010

#define _C1TXATIFH_TFATIF16_POSITION             0x00000000
#define _C1TXATIFH_TFATIF16_MASK                 0x00000001
#define _C1TXATIFH_TFATIF16_LENGTH               0x00000001

#define _C1TXATIFH_TFATIF17_POSITION             0x00000001
#define _C1TXATIFH_TFATIF17_MASK                 0x00000002
#define _C1TXATIFH_TFATIF17_LENGTH               0x00000001

