gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
#define _C1TXATIFH_TFATIF18_POSITION             0x00000002
#define _C1TXATIFH_TFATIF18_MASK                 0x00000004
#define _C1TXATIFH_TFATIF18_LENGTH               0x00000001

#define _C1TXATIFH_TFATIF19_POSITION             0x00000003
#define _C1TXATIFH_TFATIF19_MASK                 0x00000008
#define _C1TXATIFH_TFATIF19_LENGTH               0x00000001

#define _C1TXATIFH_TFATIF20_POSITION             0x00000004
#define _C1TXATIFH_TFATIF20_MASK                 0x00000010
#define _C1TXATIFH_TFATIF20_LENGTH               0x00000001

#define _C1TXATIFH_TFATIF21_POSITION             0x00000005
#define _C1TXATIFH_TFATIF21_MASK                 0x00000020
#define _C1TXATIFH_TFATIF21_LENGTH               0x00000001

#define _C1TXATIFH_TFATIF22_POSITION             0x00000006
#define _C1TXATIFH_TFATIF22_MASK                 0x00000040
#define _C1TXATIFH_TFATIF22_LENGTH               0x00000001

#define _C1TXATIFH_TFATIF23_POSITION             0x00000007
#define _C1TXATIFH_TFATIF23_MASK                 0x00000080
#define _C1TXATIFH_TFATIF23_LENGTH               0x00000001

#define _C1TXATIFH_TFATIF24_POSITION             0x00000008
#define _C1TXATIFH_TFATIF24_MASK                 0x00000100
#define _C1TXATIFH_TFATIF24_LENGTH               0x00000001

#define _C1TXATIFH_TFATIF25_POSITION             0x00000009
#define _C1TXATIFH_TFATIF25_MASK                 0x00000200
#define _C1TXATIFH_TFATIF25_LENGTH               0x00000001

#define _C1TXATIFH_TFATIF26_POSITION             0x0000000A
#define _C1TXATIFH_TFATIF26_MASK                 0x00000400
#define _C1TXATIFH_TFATIF26_LENGTH               0x00000001

#define _C1TXATIFH_TFATIF27_POSITION             0x0000000B
#define _C1TXATIFH_TFATIF27_MASK                 0x00000800
#define _C1TXATIFH_TFATIF27_LENGTH               0x00000001

#define _C1TXATIFH_TFATIF28_POSITION             0x0000000C
#define _C1TXATIFH_TFATIF28_MASK                 0x00001000
#define _C1TXATIFH_TFATIF28_LENGTH               0x00000001

#define _C1TXATIFH_TFATIF29_POSITION             0x0000000D
#define _C1TXATIFH_TFATIF29_MASK                 0x00002000
#define _C1TXATIFH_TFATIF29_LENGTH               0x00000001

#define _C1TXATIFH_TFATIF30_POSITION             0x0000000E
#define _C1TXATIFH_TFATIF30_MASK                 0x00004000
#define _C1TXATIFH_TFATIF30_LENGTH               0x00000001

#define _C1TXATIFH_TFATIF31_POSITION             0x0000000F
#define _C1TXATIFH_TFATIF31_MASK                 0x00008000
#define _C1TXATIFH_TFATIF31_LENGTH               0x00000001

#define _C1TXREQL_TXREQ_POSITION                 0x00000000
#define _C1TXREQL_TXREQ_MASK                     0x0000FFFF
#define _C1TXREQL_TXREQ_LENGTH                   0x00000010

#define _C1TXREQL_TXREQ0_POSITION                0x00000000
#define _C1TXREQL_TXREQ0_MASK                    0x00000001
#define _C1TXREQL_TXREQ0_LENGTH                  0x00000001

#define _C1TXREQL_TXREQ1_POSITION                0x00000001
#define _C1TXREQL_TXREQ1_MASK                    0x00000002
#define _C1TXREQL_TXREQ1_LENGTH                  0x00000001

#define _C1TXREQL_TXREQ2_POSITION                0x00000002
#define _C1TXREQL_TXREQ2_MASK                    0x00000004
#define _C1TXREQL_TXREQ2_LENGTH                  0x00000001

#define _C1TXREQL_TXREQ3_POSITION                0x00000003
#define _C1TXREQL_TXREQ3_MASK                    0x00000008
#define _C1TXREQL_TXREQ3_LENGTH                  0x00000001

#define _C1TXREQL_TXREQ4_POSITION                0x00000004
#define _C1TXREQL_TXREQ4_MASK                    0x00000010
#define _C1TXREQL_TXREQ4_LENGTH                  0x00000001

#define _C1TXREQL_TXREQ5_POSITION                0x00000005
#define _C1TXREQL_TXREQ5_MASK                    0x00000020
#define _C1TXREQL_TXREQ5_LENGTH                  0x00000001

#define _C1TXREQL_TXREQ6_POSITION                0x00000006
#define _C1TXREQL_TXREQ6_MASK                    0x00000040
#define _C1TXREQL_TXREQ6_LENGTH                  0x00000001

#define _C1TXREQL_TXREQ7_POSITION                0x00000007
#define _C1TXREQL_TXREQ7_MASK                    0x00000080
#define _C1TXREQL_TXREQ7_LENGTH                  0x00000001

#define _C1TXREQL_TXREQ8_POSITION                0x00000008
#define _C1TXREQL_TXREQ8_MASK                    0x00000100
#define _C1TXREQL_TXREQ8_LENGTH                  0x00000001

#define _C1TXREQL_TXREQ9_POSITION                0x00000009
#define _C1TXREQL_TXREQ9_MASK                    0x00000200
#define _C1TXREQL_TXREQ9_LENGTH                  0x00000001

#define _C1TXREQL_TXREQ10_POSITION               0x0000000A
#define _C1TXREQL_TXREQ10_MASK                   0x00000400
#define _C1TXREQL_TXREQ10_LENGTH                 0x00000001

#define _C1TXREQL_TXREQ11_POSITION               0x0000000B
#define _C1TXREQL_TXREQ11_MASK                   0x00000800
#define _C1TXREQL_TXREQ11_LENGTH                 0x00000001

#define _C1TXREQL_TXREQ12_POSITION               0x0000000C
#define _C1TXREQL_TXREQ12_MASK                   0x00001000
#define _C1TXREQL_TXREQ12_LENGTH                 0x00000001

#define _C1TXREQL_TXREQ13_POSITION               0x0000000D
#define _C1TXREQL_TXREQ13_MASK                   0x00002000
#define _C1TXREQL_TXREQ13_LENGTH                 0x00000001

#define _C1TXREQL_TXREQ14_POSITION               0x0000000E
#define _C1TXREQL_TXREQ14_MASK                   0x00004000
#define _C1TXREQL_TXREQ14_LENGTH                 0x00000001

#define _C1TXREQL_TXREQ15_POSITION               0x0000000F
#define _C1TXREQL_TXREQ15_MASK                   0x00008000
#define _C1TXREQL_TXREQ15_LENGTH                 0x00000001

#define _C1TXREQH_TXREQ_POSITION                 0x00000000
#define _C1TXREQH_TXREQ_MASK                     0x0000FFFF
#define _C1TXREQH_TXREQ_LENGTH                   0x00000010

#define _C1TXREQH_TXREQ16_POSITION               0x00000000
#define _C1TXREQH_TXREQ16_MASK                   0x00000001
#define _C1TXREQH_TXREQ16_LENGTH                 0x00000001

#define _C1TXREQH_TXREQ17_POSITION               0x00000001
#define _C1TXREQH_TXREQ17_MASK                   0x00000002
#define _C1TXREQH_TXREQ17_LENGTH                 0x00000001

#define _C1TXREQH_TXREQ18_POSITION               0x00000002
#define _C1TXREQH_TXREQ18_MASK                   0x00000004
#define _C1TXREQH_TXREQ18_LENGTH                 0x00000001

#define _C1TXREQH_TXREQ19_POSITION               0x00000003
#define _C1TXREQH_TXREQ19_MASK                   0x00000008
#define _C1TXREQH_TXREQ19_LENGTH                 0x00000001

#define _C1TXREQH_TXREQ20_POSITION               0x00000004
#define _C1TXREQH_TXREQ20_MASK                   0x00000010
#define _C1TXREQH_TXREQ20_LENGTH                 0x00000001

#define _C1TXREQH_TXREQ21_POSITION               0x00000005
#define _C1TXREQH_TXREQ21_MASK                   0x00000020
#define _C1TXREQH_TXREQ21_LENGTH                 0x00000001

#define _C1TXREQH_TXREQ22_POSITION               0x00000006
#define _C1TXREQH_TXREQ22_MASK                   0x00000040
#define _C1TXREQH_TXREQ22_LENGTH                 0x00000001

