gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
#define _C1TXREQH_TXREQ23_POSITION               0x00000007
#define _C1TXREQH_TXREQ23_MASK                   0x00000080
#define _C1TXREQH_TXREQ23_LENGTH                 0x00000001

#define _C1TXREQH_TXREQ24_POSITION               0x00000008
#define _C1TXREQH_TXREQ24_MASK                   0x00000100
#define _C1TXREQH_TXREQ24_LENGTH                 0x00000001

#define _C1TXREQH_TXREQ25_POSITION               0x00000009
#define _C1TXREQH_TXREQ25_MASK                   0x00000200
#define _C1TXREQH_TXREQ25_LENGTH                 0x00000001

#define _C1TXREQH_TXREQ26_POSITION               0x0000000A
#define _C1TXREQH_TXREQ26_MASK                   0x00000400
#define _C1TXREQH_TXREQ26_LENGTH                 0x00000001

#define _C1TXREQH_TXREQ27_POSITION               0x0000000B
#define _C1TXREQH_TXREQ27_MASK                   0x00000800
#define _C1TXREQH_TXREQ27_LENGTH                 0x00000001

#define _C1TXREQH_TXREQ28_POSITION               0x0000000C
#define _C1TXREQH_TXREQ28_MASK                   0x00001000
#define _C1TXREQH_TXREQ28_LENGTH                 0x00000001

#define _C1TXREQH_TXREQ29_POSITION               0x0000000D
#define _C1TXREQH_TXREQ29_MASK                   0x00002000
#define _C1TXREQH_TXREQ29_LENGTH                 0x00000001

#define _C1TXREQH_TXREQ30_POSITION               0x0000000E
#define _C1TXREQH_TXREQ30_MASK                   0x00004000
#define _C1TXREQH_TXREQ30_LENGTH                 0x00000001

#define _C1TXREQH_TXREQ31_POSITION               0x0000000F
#define _C1TXREQH_TXREQ31_MASK                   0x00008000
#define _C1TXREQH_TXREQ31_LENGTH                 0x00000001

#define _C1TRECL_RERRCNT_POSITION                0x00000000
#define _C1TRECL_RERRCNT_MASK                    0x000000FF
#define _C1TRECL_RERRCNT_LENGTH                  0x00000008

#define _C1TRECL_TERRCNT_POSITION                0x00000008
#define _C1TRECL_TERRCNT_MASK                    0x0000FF00
#define _C1TRECL_TERRCNT_LENGTH                  0x00000008

#define _C1TRECL_RERRCNT0_POSITION               0x00000000
#define _C1TRECL_RERRCNT0_MASK                   0x00000001
#define _C1TRECL_RERRCNT0_LENGTH                 0x00000001

#define _C1TRECL_RERRCNT1_POSITION               0x00000001
#define _C1TRECL_RERRCNT1_MASK                   0x00000002
#define _C1TRECL_RERRCNT1_LENGTH                 0x00000001

#define _C1TRECL_RERRCNT2_POSITION               0x00000002
#define _C1TRECL_RERRCNT2_MASK                   0x00000004
#define _C1TRECL_RERRCNT2_LENGTH                 0x00000001

#define _C1TRECL_RERRCNT3_POSITION               0x00000003
#define _C1TRECL_RERRCNT3_MASK                   0x00000008
#define _C1TRECL_RERRCNT3_LENGTH                 0x00000001

#define _C1TRECL_RERRCNT4_POSITION               0x00000004
#define _C1TRECL_RERRCNT4_MASK                   0x00000010
#define _C1TRECL_RERRCNT4_LENGTH                 0x00000001

#define _C1TRECL_RERRCNT5_POSITION               0x00000005
#define _C1TRECL_RERRCNT5_MASK                   0x00000020
#define _C1TRECL_RERRCNT5_LENGTH                 0x00000001

#define _C1TRECL_RERRCNT6_POSITION               0x00000006
#define _C1TRECL_RERRCNT6_MASK                   0x00000040
#define _C1TRECL_RERRCNT6_LENGTH                 0x00000001

#define _C1TRECL_RERRCNT7_POSITION               0x00000007
#define _C1TRECL_RERRCNT7_MASK                   0x00000080
#define _C1TRECL_RERRCNT7_LENGTH                 0x00000001

#define _C1TRECL_TERRCNT0_POSITION               0x00000008
#define _C1TRECL_TERRCNT0_MASK                   0x00000100
#define _C1TRECL_TERRCNT0_LENGTH                 0x00000001

#define _C1TRECL_TERRCNT1_POSITION               0x00000009
#define _C1TRECL_TERRCNT1_MASK                   0x00000200
#define _C1TRECL_TERRCNT1_LENGTH                 0x00000001

#define _C1TRECL_TERRCNT2_POSITION               0x0000000A
#define _C1TRECL_TERRCNT2_MASK                   0x00000400
#define _C1TRECL_TERRCNT2_LENGTH                 0x00000001

#define _C1TRECL_TERRCNT3_POSITION               0x0000000B
#define _C1TRECL_TERRCNT3_MASK                   0x00000800
#define _C1TRECL_TERRCNT3_LENGTH                 0x00000001

#define _C1TRECL_TERRCNT4_POSITION               0x0000000C
#define _C1TRECL_TERRCNT4_MASK                   0x00001000
#define _C1TRECL_TERRCNT4_LENGTH                 0x00000001

#define _C1TRECL_TERRCNT5_POSITION               0x0000000D
#define _C1TRECL_TERRCNT5_MASK                   0x00002000
#define _C1TRECL_TERRCNT5_LENGTH                 0x00000001

#define _C1TRECL_TERRCNT6_POSITION               0x0000000E
#define _C1TRECL_TERRCNT6_MASK                   0x00004000
#define _C1TRECL_TERRCNT6_LENGTH                 0x00000001

#define _C1TRECL_TERRCNT7_POSITION               0x0000000F
#define _C1TRECL_TERRCNT7_MASK                   0x00008000
#define _C1TRECL_TERRCNT7_LENGTH                 0x00000001

#define _C1TRECH_EWARN_POSITION                  0x00000000
#define _C1TRECH_EWARN_MASK                      0x00000001
#define _C1TRECH_EWARN_LENGTH                    0x00000001

#define _C1TRECH_RXWARN_POSITION                 0x00000001
#define _C1TRECH_RXWARN_MASK                     0x00000002
#define _C1TRECH_RXWARN_LENGTH                   0x00000001

#define _C1TRECH_TXWARN_POSITION                 0x00000002
#define _C1TRECH_TXWARN_MASK                     0x00000004
#define _C1TRECH_TXWARN_LENGTH                   0x00000001

#define _C1TRECH_RXBP_POSITION                   0x00000003
#define _C1TRECH_RXBP_MASK                       0x00000008
#define _C1TRECH_RXBP_LENGTH                     0x00000001

#define _C1TRECH_TXBP_POSITION                   0x00000004
#define _C1TRECH_TXBP_MASK                       0x00000010
#define _C1TRECH_TXBP_LENGTH                     0x00000001

#define _C1TRECH_TXBO_POSITION                   0x00000005
#define _C1TRECH_TXBO_MASK                       0x00000020
#define _C1TRECH_TXBO_LENGTH                     0x00000001

#define _C1BDIAG0L_NRERRCNT_POSITION             0x00000000
#define _C1BDIAG0L_NRERRCNT_MASK                 0x000000FF
#define _C1BDIAG0L_NRERRCNT_LENGTH               0x00000008

#define _C1BDIAG0L_NTERRCNT_POSITION             0x00000008
#define _C1BDIAG0L_NTERRCNT_MASK                 0x0000FF00
#define _C1BDIAG0L_NTERRCNT_LENGTH               0x00000008

#define _C1BDIAG0L_NRERRCNT0_POSITION            0x00000000
#define _C1BDIAG0L_NRERRCNT0_MASK                0x00000001
#define _C1BDIAG0L_NRERRCNT0_LENGTH              0x00000001

#define _C1BDIAG0L_NRERRCNT1_POSITION            0x00000001
#define _C1BDIAG0L_NRERRCNT1_MASK                0x00000002
#define _C1BDIAG0L_NRERRCNT1_LENGTH              0x00000001

#define _C1BDIAG0L_NRERRCNT2_POSITION            0x00000002
#define _C1BDIAG0L_NRERRCNT2_MASK                0x00000004
#define _C1BDIAG0L_NRERRCNT2_LENGTH              0x00000001

#define _C1BDIAG0L_NRERRCNT3_POSITION            0x00000003
#define _C1BDIAG0L_NRERRCNT3_MASK                0x00000008
#define _C1BDIAG0L_NRERRCNT3_LENGTH              0x00000001

#define _C1BDIAG0L_NRERRCNT4_POSITION            0x00000004
#define _C1BDIAG0L_NRERRCNT4_MASK                0x00000010
#define _C1BDIAG0L_NRERRCNT4_LENGTH              0x00000001

#define _C1BDIAG0L_NRERRCNT5_POSITION            0x00000005
#define _C1BDIAG0L_NRERRCNT5_MASK                0x00000020
#define _C1BDIAG0L_NRERRCNT5_LENGTH              0x00000001

