gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
#define _C1BDIAG0L_NRERRCNT6_POSITION            0x00000006
#define _C1BDIAG0L_NRERRCNT6_MASK                0x00000040
#define _C1BDIAG0L_NRERRCNT6_LENGTH              0x00000001

#define _C1BDIAG0L_NRERRCNT7_POSITION            0x00000007
#define _C1BDIAG0L_NRERRCNT7_MASK                0x00000080
#define _C1BDIAG0L_NRERRCNT7_LENGTH              0x00000001

#define _C1BDIAG0L_NTERRCNT0_POSITION            0x00000008
#define _C1BDIAG0L_NTERRCNT0_MASK                0x00000100
#define _C1BDIAG0L_NTERRCNT0_LENGTH              0x00000001

#define _C1BDIAG0L_NTERRCNT1_POSITION            0x00000009
#define _C1BDIAG0L_NTERRCNT1_MASK                0x00000200
#define _C1BDIAG0L_NTERRCNT1_LENGTH              0x00000001

#define _C1BDIAG0L_NTERRCNT2_POSITION            0x0000000A
#define _C1BDIAG0L_NTERRCNT2_MASK                0x00000400
#define _C1BDIAG0L_NTERRCNT2_LENGTH              0x00000001

#define _C1BDIAG0L_NTERRCNT3_POSITION            0x0000000B
#define _C1BDIAG0L_NTERRCNT3_MASK                0x00000800
#define _C1BDIAG0L_NTERRCNT3_LENGTH              0x00000001

#define _C1BDIAG0L_NTERRCNT4_POSITION            0x0000000C
#define _C1BDIAG0L_NTERRCNT4_MASK                0x00001000
#define _C1BDIAG0L_NTERRCNT4_LENGTH              0x00000001

#define _C1BDIAG0L_NTERRCNT5_POSITION            0x0000000D
#define _C1BDIAG0L_NTERRCNT5_MASK                0x00002000
#define _C1BDIAG0L_NTERRCNT5_LENGTH              0x00000001

#define _C1BDIAG0L_NTERRCNT6_POSITION            0x0000000E
#define _C1BDIAG0L_NTERRCNT6_MASK                0x00004000
#define _C1BDIAG0L_NTERRCNT6_LENGTH              0x00000001

#define _C1BDIAG0L_NTERRCNT7_POSITION            0x0000000F
#define _C1BDIAG0L_NTERRCNT7_MASK                0x00008000
#define _C1BDIAG0L_NTERRCNT7_LENGTH              0x00000001

#define _C1BDIAG0H_DRERRCNT_POSITION             0x00000000
#define _C1BDIAG0H_DRERRCNT_MASK                 0x000000FF
#define _C1BDIAG0H_DRERRCNT_LENGTH               0x00000008

#define _C1BDIAG0H_DTERRCNT_POSITION             0x00000008
#define _C1BDIAG0H_DTERRCNT_MASK                 0x0000FF00
#define _C1BDIAG0H_DTERRCNT_LENGTH               0x00000008

#define _C1BDIAG0H_DRERRCNT0_POSITION            0x00000000
#define _C1BDIAG0H_DRERRCNT0_MASK                0x00000001
#define _C1BDIAG0H_DRERRCNT0_LENGTH              0x00000001

#define _C1BDIAG0H_DRERRCNT1_POSITION            0x00000001
#define _C1BDIAG0H_DRERRCNT1_MASK                0x00000002
#define _C1BDIAG0H_DRERRCNT1_LENGTH              0x00000001

#define _C1BDIAG0H_DRERRCNT2_POSITION            0x00000002
#define _C1BDIAG0H_DRERRCNT2_MASK                0x00000004
#define _C1BDIAG0H_DRERRCNT2_LENGTH              0x00000001

#define _C1BDIAG0H_DRERRCNT3_POSITION            0x00000003
#define _C1BDIAG0H_DRERRCNT3_MASK                0x00000008
#define _C1BDIAG0H_DRERRCNT3_LENGTH              0x00000001

#define _C1BDIAG0H_DRERRCNT4_POSITION            0x00000004
#define _C1BDIAG0H_DRERRCNT4_MASK                0x00000010
#define _C1BDIAG0H_DRERRCNT4_LENGTH              0x00000001

#define _C1BDIAG0H_DRERRCNT5_POSITION            0x00000005
#define _C1BDIAG0H_DRERRCNT5_MASK                0x00000020
#define _C1BDIAG0H_DRERRCNT5_LENGTH              0x00000001

#define _C1BDIAG0H_DRERRCNT6_POSITION            0x00000006
#define _C1BDIAG0H_DRERRCNT6_MASK                0x00000040
#define _C1BDIAG0H_DRERRCNT6_LENGTH              0x00000001

#define _C1BDIAG0H_DRERRCNT7_POSITION            0x00000007
#define _C1BDIAG0H_DRERRCNT7_MASK                0x00000080
#define _C1BDIAG0H_DRERRCNT7_LENGTH              0x00000001

#define _C1BDIAG0H_DTERRCNT0_POSITION            0x00000008
#define _C1BDIAG0H_DTERRCNT0_MASK                0x00000100
#define _C1BDIAG0H_DTERRCNT0_LENGTH              0x00000001

#define _C1BDIAG0H_DTERRCNT1_POSITION            0x00000009
#define _C1BDIAG0H_DTERRCNT1_MASK                0x00000200
#define _C1BDIAG0H_DTERRCNT1_LENGTH              0x00000001

#define _C1BDIAG0H_DTERRCNT2_POSITION            0x0000000A
#define _C1BDIAG0H_DTERRCNT2_MASK                0x00000400
#define _C1BDIAG0H_DTERRCNT2_LENGTH              0x00000001

#define _C1BDIAG0H_DTERRCNT3_POSITION            0x0000000B
#define _C1BDIAG0H_DTERRCNT3_MASK                0x00000800
#define _C1BDIAG0H_DTERRCNT3_LENGTH              0x00000001

#define _C1BDIAG0H_DTERRCNT4_POSITION            0x0000000C
#define _C1BDIAG0H_DTERRCNT4_MASK                0x00001000
#define _C1BDIAG0H_DTERRCNT4_LENGTH              0x00000001

#define _C1BDIAG0H_DTERRCNT5_POSITION            0x0000000D
#define _C1BDIAG0H_DTERRCNT5_MASK                0x00002000
#define _C1BDIAG0H_DTERRCNT5_LENGTH              0x00000001

#define _C1BDIAG0H_DTERRCNT6_POSITION            0x0000000E
#define _C1BDIAG0H_DTERRCNT6_MASK                0x00004000
#define _C1BDIAG0H_DTERRCNT6_LENGTH              0x00000001

#define _C1BDIAG0H_DTERRCNT7_POSITION            0x0000000F
#define _C1BDIAG0H_DTERRCNT7_MASK                0x00008000
#define _C1BDIAG0H_DTERRCNT7_LENGTH              0x00000001

#define _C1BDIAG1L_EFMSGCNT_POSITION             0x00000000
#define _C1BDIAG1L_EFMSGCNT_MASK                 0x0000FFFF
#define _C1BDIAG1L_EFMSGCNT_LENGTH               0x00000010

#define _C1BDIAG1L_EFMSGCNT0_POSITION            0x00000000
#define _C1BDIAG1L_EFMSGCNT0_MASK                0x00000001
#define _C1BDIAG1L_EFMSGCNT0_LENGTH              0x00000001

#define _C1BDIAG1L_EFMSGCNT1_POSITION            0x00000001
#define _C1BDIAG1L_EFMSGCNT1_MASK                0x00000002
#define _C1BDIAG1L_EFMSGCNT1_LENGTH              0x00000001

#define _C1BDIAG1L_EFMSGCNT2_POSITION            0x00000002
#define _C1BDIAG1L_EFMSGCNT2_MASK                0x00000004
#define _C1BDIAG1L_EFMSGCNT2_LENGTH              0x00000001

#define _C1BDIAG1L_EFMSGCNT3_POSITION            0x00000003
#define _C1BDIAG1L_EFMSGCNT3_MASK                0x00000008
#define _C1BDIAG1L_EFMSGCNT3_LENGTH              0x00000001

#define _C1BDIAG1L_EFMSGCNT4_POSITION            0x00000004
#define _C1BDIAG1L_EFMSGCNT4_MASK                0x00000010
#define _C1BDIAG1L_EFMSGCNT4_LENGTH              0x00000001

#define _C1BDIAG1L_EFMSGCNT5_POSITION            0x00000005
#define _C1BDIAG1L_EFMSGCNT5_MASK                0x00000020
#define _C1BDIAG1L_EFMSGCNT5_LENGTH              0x00000001

