gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
#define _C1BDIAG1L_EFMSGCNT6_POSITION            0x00000006
#define _C1BDIAG1L_EFMSGCNT6_MASK                0x00000040
#define _C1BDIAG1L_EFMSGCNT6_LENGTH              0x00000001

#define _C1BDIAG1L_EFMSGCNT7_POSITION            0x00000007
#define _C1BDIAG1L_EFMSGCNT7_MASK                0x00000080
#define _C1BDIAG1L_EFMSGCNT7_LENGTH              0x00000001

#define _C1BDIAG1L_EFMSGCNT8_POSITION            0x00000008
#define _C1BDIAG1L_EFMSGCNT8_MASK                0x00000100
#define _C1BDIAG1L_EFMSGCNT8_LENGTH              0x00000001

#define _C1BDIAG1L_EFMSGCNT9_POSITION            0x00000009
#define _C1BDIAG1L_EFMSGCNT9_MASK                0x00000200
#define _C1BDIAG1L_EFMSGCNT9_LENGTH              0x00000001

#define _C1BDIAG1L_EFMSGCNT10_POSITION           0x0000000A
#define _C1BDIAG1L_EFMSGCNT10_MASK               0x00000400
#define _C1BDIAG1L_EFMSGCNT10_LENGTH             0x00000001

#define _C1BDIAG1L_EFMSGCNT11_POSITION           0x0000000B
#define _C1BDIAG1L_EFMSGCNT11_MASK               0x00000800
#define _C1BDIAG1L_EFMSGCNT11_LENGTH             0x00000001

#define _C1BDIAG1L_EFMSGCNT12_POSITION           0x0000000C
#define _C1BDIAG1L_EFMSGCNT12_MASK               0x00001000
#define _C1BDIAG1L_EFMSGCNT12_LENGTH             0x00000001

#define _C1BDIAG1L_EFMSGCNT13_POSITION           0x0000000D
#define _C1BDIAG1L_EFMSGCNT13_MASK               0x00002000
#define _C1BDIAG1L_EFMSGCNT13_LENGTH             0x00000001

#define _C1BDIAG1L_EFMSGCNT14_POSITION           0x0000000E
#define _C1BDIAG1L_EFMSGCNT14_MASK               0x00004000
#define _C1BDIAG1L_EFMSGCNT14_LENGTH             0x00000001

#define _C1BDIAG1L_EFMSGCNT15_POSITION           0x0000000F
#define _C1BDIAG1L_EFMSGCNT15_MASK               0x00008000
#define _C1BDIAG1L_EFMSGCNT15_LENGTH             0x00000001

#define _C1BDIAG1H_NBIT0ERR_POSITION             0x00000000
#define _C1BDIAG1H_NBIT0ERR_MASK                 0x00000001
#define _C1BDIAG1H_NBIT0ERR_LENGTH               0x00000001

#define _C1BDIAG1H_NBIT1ERR_POSITION             0x00000001
#define _C1BDIAG1H_NBIT1ERR_MASK                 0x00000002
#define _C1BDIAG1H_NBIT1ERR_LENGTH               0x00000001

#define _C1BDIAG1H_NACKERR_POSITION              0x00000002
#define _C1BDIAG1H_NACKERR_MASK                  0x00000004
#define _C1BDIAG1H_NACKERR_LENGTH                0x00000001

#define _C1BDIAG1H_NFORMERR_POSITION             0x00000003
#define _C1BDIAG1H_NFORMERR_MASK                 0x00000008
#define _C1BDIAG1H_NFORMERR_LENGTH               0x00000001

#define _C1BDIAG1H_NSTUFERR_POSITION             0x00000004
#define _C1BDIAG1H_NSTUFERR_MASK                 0x00000010
#define _C1BDIAG1H_NSTUFERR_LENGTH               0x00000001

#define _C1BDIAG1H_NCRCERR_POSITION              0x00000005
#define _C1BDIAG1H_NCRCERR_MASK                  0x00000020
#define _C1BDIAG1H_NCRCERR_LENGTH                0x00000001

#define _C1BDIAG1H_TXBOERR_POSITION              0x00000007
#define _C1BDIAG1H_TXBOERR_MASK                  0x00000080
#define _C1BDIAG1H_TXBOERR_LENGTH                0x00000001

#define _C1BDIAG1H_DBIT0ERR_POSITION             0x00000008
#define _C1BDIAG1H_DBIT0ERR_MASK                 0x00000100
#define _C1BDIAG1H_DBIT0ERR_LENGTH               0x00000001

#define _C1BDIAG1H_DBIT1ERR_POSITION             0x00000009
#define _C1BDIAG1H_DBIT1ERR_MASK                 0x00000200
#define _C1BDIAG1H_DBIT1ERR_LENGTH               0x00000001

#define _C1BDIAG1H_DFORMERR_POSITION             0x0000000B
#define _C1BDIAG1H_DFORMERR_MASK                 0x00000800
#define _C1BDIAG1H_DFORMERR_LENGTH               0x00000001

#define _C1BDIAG1H_DSTUFERR_POSITION             0x0000000C
#define _C1BDIAG1H_DSTUFERR_MASK                 0x00001000
#define _C1BDIAG1H_DSTUFERR_LENGTH               0x00000001

#define _C1BDIAG1H_DCRCERR_POSITION              0x0000000D
#define _C1BDIAG1H_DCRCERR_MASK                  0x00002000
#define _C1BDIAG1H_DCRCERR_LENGTH                0x00000001

#define _C1BDIAG1H_ESI_POSITION                  0x0000000E
#define _C1BDIAG1H_ESI_MASK                      0x00004000
#define _C1BDIAG1H_ESI_LENGTH                    0x00000001

#define _C1BDIAG1H_DLCMM_POSITION                0x0000000F
#define _C1BDIAG1H_DLCMM_MASK                    0x00008000
#define _C1BDIAG1H_DLCMM_LENGTH                  0x00000001

#define _C1TEFCONL_TEFNEIE_POSITION              0x00000000
#define _C1TEFCONL_TEFNEIE_MASK                  0x00000001
#define _C1TEFCONL_TEFNEIE_LENGTH                0x00000001

#define _C1TEFCONL_TEFHIE_POSITION               0x00000001
#define _C1TEFCONL_TEFHIE_MASK                   0x00000002
#define _C1TEFCONL_TEFHIE_LENGTH                 0x00000001

#define _C1TEFCONL_TEFFIE_POSITION               0x00000002
#define _C1TEFCONL_TEFFIE_MASK                   0x00000004
#define _C1TEFCONL_TEFFIE_LENGTH                 0x00000001

#define _C1TEFCONL_TEFOVIE_POSITION              0x00000003
#define _C1TEFCONL_TEFOVIE_MASK                  0x00000008
#define _C1TEFCONL_TEFOVIE_LENGTH                0x00000001

#define _C1TEFCONL_TEFTSEN_POSITION              0x00000005
#define _C1TEFCONL_TEFTSEN_MASK                  0x00000020
#define _C1TEFCONL_TEFTSEN_LENGTH                0x00000001

#define _C1TEFCONL_UINC_POSITION                 0x00000008
#define _C1TEFCONL_UINC_MASK                     0x00000100
#define _C1TEFCONL_UINC_LENGTH                   0x00000001

#define _C1TEFCONL_FRESET_POSITION               0x0000000A
#define _C1TEFCONL_FRESET_MASK                   0x00000400
#define _C1TEFCONL_FRESET_LENGTH                 0x00000001

#define _C1TEFCONH_FSIZE_POSITION                0x00000008
#define _C1TEFCONH_FSIZE_MASK                    0x00001F00
#define _C1TEFCONH_FSIZE_LENGTH                  0x00000005

#define _C1TEFCONH_FSIZE0_POSITION               0x00000008
#define _C1TEFCONH_FSIZE0_MASK                   0x00000100
#define _C1TEFCONH_FSIZE0_LENGTH                 0x00000001

#define _C1TEFCONH_FSIZE1_POSITION               0x00000009
#define _C1TEFCONH_FSIZE1_MASK                   0x00000200
#define _C1TEFCONH_FSIZE1_LENGTH                 0x00000001

#define _C1TEFCONH_FSIZE2_POSITION               0x0000000A
#define _C1TEFCONH_FSIZE2_MASK                   0x00000400
#define _C1TEFCONH_FSIZE2_LENGTH                 0x00000001

#define _C1TEFCONH_FSIZE3_POSITION               0x0000000B
#define _C1TEFCONH_FSIZE3_MASK                   0x00000800
#define _C1TEFCONH_FSIZE3_LENGTH                 0x00000001

#define _C1TEFCONH_FSIZE4_POSITION               0x0000000C
#define _C1TEFCONH_FSIZE4_MASK                   0x00001000
#define _C1TEFCONH_FSIZE4_LENGTH                 0x00000001

#define _C1TEFSTA_TEFNEIF_POSITION               0x00000000
#define _C1TEFSTA_TEFNEIF_MASK                   0x00000001
#define _C1TEFSTA_TEFNEIF_LENGTH                 0x00000001

#define _C1TEFSTA_TEFHIF_POSITION                0x00000001
#define _C1TEFSTA_TEFHIF_MASK                    0x00000002
#define _C1TEFSTA_TEFHIF_LENGTH                  0x00000001

