gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
#define _C1TEFSTA_TEFFIF_POSITION                0x00000002
#define _C1TEFSTA_TEFFIF_MASK                    0x00000004
#define _C1TEFSTA_TEFFIF_LENGTH                  0x00000001

#define _C1TEFSTA_TEFOVIF_POSITION               0x00000003
#define _C1TEFSTA_TEFOVIF_MASK                   0x00000008
#define _C1TEFSTA_TEFOVIF_LENGTH                 0x00000001

#define _C1TEFUAL_TEFUA_POSITION                 0x00000000
#define _C1TEFUAL_TEFUA_MASK                     0x0000FFFF
#define _C1TEFUAL_TEFUA_LENGTH                   0x00000010

#define _C1TEFUAL_TEFUA0_POSITION                0x00000000
#define _C1TEFUAL_TEFUA0_MASK                    0x00000001
#define _C1TEFUAL_TEFUA0_LENGTH                  0x00000001

#define _C1TEFUAL_TEFUA1_POSITION                0x00000001
#define _C1TEFUAL_TEFUA1_MASK                    0x00000002
#define _C1TEFUAL_TEFUA1_LENGTH                  0x00000001

#define _C1TEFUAL_TEFUA2_POSITION                0x00000002
#define _C1TEFUAL_TEFUA2_MASK                    0x00000004
#define _C1TEFUAL_TEFUA2_LENGTH                  0x00000001

#define _C1TEFUAL_TEFUA3_POSITION                0x00000003
#define _C1TEFUAL_TEFUA3_MASK                    0x00000008
#define _C1TEFUAL_TEFUA3_LENGTH                  0x00000001

#define _C1TEFUAL_TEFUA4_POSITION                0x00000004
#define _C1TEFUAL_TEFUA4_MASK                    0x00000010
#define _C1TEFUAL_TEFUA4_LENGTH                  0x00000001

#define _C1TEFUAL_TEFUA5_POSITION                0x00000005
#define _C1TEFUAL_TEFUA5_MASK                    0x00000020
#define _C1TEFUAL_TEFUA5_LENGTH                  0x00000001

#define _C1TEFUAL_TEFUA6_POSITION                0x00000006
#define _C1TEFUAL_TEFUA6_MASK                    0x00000040
#define _C1TEFUAL_TEFUA6_LENGTH                  0x00000001

#define _C1TEFUAL_TEFUA7_POSITION                0x00000007
#define _C1TEFUAL_TEFUA7_MASK                    0x00000080
#define _C1TEFUAL_TEFUA7_LENGTH                  0x00000001

#define _C1TEFUAL_TEFUA8_POSITION                0x00000008
#define _C1TEFUAL_TEFUA8_MASK                    0x00000100
#define _C1TEFUAL_TEFUA8_LENGTH                  0x00000001

#define _C1TEFUAL_TEFUA9_POSITION                0x00000009
#define _C1TEFUAL_TEFUA9_MASK                    0x00000200
#define _C1TEFUAL_TEFUA9_LENGTH                  0x00000001

#define _C1TEFUAL_TEFUA10_POSITION               0x0000000A
#define _C1TEFUAL_TEFUA10_MASK                   0x00000400
#define _C1TEFUAL_TEFUA10_LENGTH                 0x00000001

#define _C1TEFUAL_TEFUA11_POSITION               0x0000000B
#define _C1TEFUAL_TEFUA11_MASK                   0x00000800
#define _C1TEFUAL_TEFUA11_LENGTH                 0x00000001

#define _C1TEFUAL_TEFUA12_POSITION               0x0000000C
#define _C1TEFUAL_TEFUA12_MASK                   0x00001000
#define _C1TEFUAL_TEFUA12_LENGTH                 0x00000001

#define _C1TEFUAL_TEFUA13_POSITION               0x0000000D
#define _C1TEFUAL_TEFUA13_MASK                   0x00002000
#define _C1TEFUAL_TEFUA13_LENGTH                 0x00000001

#define _C1TEFUAL_TEFUA14_POSITION               0x0000000E
#define _C1TEFUAL_TEFUA14_MASK                   0x00004000
#define _C1TEFUAL_TEFUA14_LENGTH                 0x00000001

#define _C1TEFUAL_TEFUA15_POSITION               0x0000000F
#define _C1TEFUAL_TEFUA15_MASK                   0x00008000
#define _C1TEFUAL_TEFUA15_LENGTH                 0x00000001

#define _C1TEFUAH_TEFUA_POSITION                 0x00000000
#define _C1TEFUAH_TEFUA_MASK                     0x0000FFFF
#define _C1TEFUAH_TEFUA_LENGTH                   0x00000010

#define _C1TEFUAH_TEFUA16_POSITION               0x00000000
#define _C1TEFUAH_TEFUA16_MASK                   0x00000001
#define _C1TEFUAH_TEFUA16_LENGTH                 0x00000001

#define _C1TEFUAH_TEFUA17_POSITION               0x00000001
#define _C1TEFUAH_TEFUA17_MASK                   0x00000002
#define _C1TEFUAH_TEFUA17_LENGTH                 0x00000001

#define _C1TEFUAH_TEFUA18_POSITION               0x00000002
#define _C1TEFUAH_TEFUA18_MASK                   0x00000004
#define _C1TEFUAH_TEFUA18_LENGTH                 0x00000001

#define _C1TEFUAH_TEFUA19_POSITION               0x00000003
#define _C1TEFUAH_TEFUA19_MASK                   0x00000008
#define _C1TEFUAH_TEFUA19_LENGTH                 0x00000001

#define _C1TEFUAH_TEFUA20_POSITION               0x00000004
#define _C1TEFUAH_TEFUA20_MASK                   0x00000010
#define _C1TEFUAH_TEFUA20_LENGTH                 0x00000001

#define _C1TEFUAH_TEFUA21_POSITION               0x00000005
#define _C1TEFUAH_TEFUA21_MASK                   0x00000020
#define _C1TEFUAH_TEFUA21_LENGTH                 0x00000001

#define _C1TEFUAH_TEFUA22_POSITION               0x00000006
#define _C1TEFUAH_TEFUA22_MASK                   0x00000040
#define _C1TEFUAH_TEFUA22_LENGTH                 0x00000001

#define _C1TEFUAH_TEFUA23_POSITION               0x00000007
#define _C1TEFUAH_TEFUA23_MASK                   0x00000080
#define _C1TEFUAH_TEFUA23_LENGTH                 0x00000001

#define _C1TEFUAH_TEFUA24_POSITION               0x00000008
#define _C1TEFUAH_TEFUA24_MASK                   0x00000100
#define _C1TEFUAH_TEFUA24_LENGTH                 0x00000001

#define _C1TEFUAH_TEFUA25_POSITION               0x00000009
#define _C1TEFUAH_TEFUA25_MASK                   0x00000200
#define _C1TEFUAH_TEFUA25_LENGTH                 0x00000001

#define _C1TEFUAH_TEFUA26_POSITION               0x0000000A
#define _C1TEFUAH_TEFUA26_MASK                   0x00000400
#define _C1TEFUAH_TEFUA26_LENGTH                 0x00000001

#define _C1TEFUAH_TEFUA27_POSITION               0x0000000B
#define _C1TEFUAH_TEFUA27_MASK                   0x00000800
#define _C1TEFUAH_TEFUA27_LENGTH                 0x00000001

#define _C1TEFUAH_TEFUA28_POSITION               0x0000000C
#define _C1TEFUAH_TEFUA28_MASK                   0x00001000
#define _C1TEFUAH_TEFUA28_LENGTH                 0x00000001

#define _C1TEFUAH_TEFUA29_POSITION               0x0000000D
#define _C1TEFUAH_TEFUA29_MASK                   0x00002000
#define _C1TEFUAH_TEFUA29_LENGTH                 0x00000001

#define _C1TEFUAH_TEFUA30_POSITION               0x0000000E
#define _C1TEFUAH_TEFUA30_MASK                   0x00004000
#define _C1TEFUAH_TEFUA30_LENGTH                 0x00000001

#define _C1TEFUAH_TEFUA31_POSITION               0x0000000F
#define _C1TEFUAH_TEFUA31_MASK                   0x00008000
#define _C1TEFUAH_TEFUA31_LENGTH                 0x00000001

#define _C1FIFOBAL_FIFOBA_POSITION               0x00000000
#define _C1FIFOBAL_FIFOBA_MASK                   0x0000FFFF
#define _C1FIFOBAL_FIFOBA_LENGTH                 0x00000010

