gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
#define _C1FIFOBAL_FIFOBA0_POSITION              0x00000000
#define _C1FIFOBAL_FIFOBA0_MASK                  0x00000001
#define _C1FIFOBAL_FIFOBA0_LENGTH                0x00000001

#define _C1FIFOBAL_FIFOBA1_POSITION              0x00000001
#define _C1FIFOBAL_FIFOBA1_MASK                  0x00000002
#define _C1FIFOBAL_FIFOBA1_LENGTH                0x00000001

#define _C1FIFOBAL_FIFOBA2_POSITION              0x00000002
#define _C1FIFOBAL_FIFOBA2_MASK                  0x00000004
#define _C1FIFOBAL_FIFOBA2_LENGTH                0x00000001

#define _C1FIFOBAL_FIFOBA3_POSITION              0x00000003
#define _C1FIFOBAL_FIFOBA3_MASK                  0x00000008
#define _C1FIFOBAL_FIFOBA3_LENGTH                0x00000001

#define _C1FIFOBAL_FIFOBA4_POSITION              0x00000004
#define _C1FIFOBAL_FIFOBA4_MASK                  0x00000010
#define _C1FIFOBAL_FIFOBA4_LENGTH                0x00000001

#define _C1FIFOBAL_FIFOBA5_POSITION              0x00000005
#define _C1FIFOBAL_FIFOBA5_MASK                  0x00000020
#define _C1FIFOBAL_FIFOBA5_LENGTH                0x00000001

#define _C1FIFOBAL_FIFOBA6_POSITION              0x00000006
#define _C1FIFOBAL_FIFOBA6_MASK                  0x00000040
#define _C1FIFOBAL_FIFOBA6_LENGTH                0x00000001

#define _C1FIFOBAL_FIFOBA7_POSITION              0x00000007
#define _C1FIFOBAL_FIFOBA7_MASK                  0x00000080
#define _C1FIFOBAL_FIFOBA7_LENGTH                0x00000001

#define _C1FIFOBAL_FIFOBA8_POSITION              0x00000008
#define _C1FIFOBAL_FIFOBA8_MASK                  0x00000100
#define _C1FIFOBAL_FIFOBA8_LENGTH                0x00000001

#define _C1FIFOBAL_FIFOBA9_POSITION              0x00000009
#define _C1FIFOBAL_FIFOBA9_MASK                  0x00000200
#define _C1FIFOBAL_FIFOBA9_LENGTH                0x00000001

#define _C1FIFOBAL_FIFOBA10_POSITION             0x0000000A
#define _C1FIFOBAL_FIFOBA10_MASK                 0x00000400
#define _C1FIFOBAL_FIFOBA10_LENGTH               0x00000001

#define _C1FIFOBAL_FIFOBA11_POSITION             0x0000000B
#define _C1FIFOBAL_FIFOBA11_MASK                 0x00000800
#define _C1FIFOBAL_FIFOBA11_LENGTH               0x00000001

#define _C1FIFOBAL_FIFOBA12_POSITION             0x0000000C
#define _C1FIFOBAL_FIFOBA12_MASK                 0x00001000
#define _C1FIFOBAL_FIFOBA12_LENGTH               0x00000001

#define _C1FIFOBAL_FIFOBA13_POSITION             0x0000000D
#define _C1FIFOBAL_FIFOBA13_MASK                 0x00002000
#define _C1FIFOBAL_FIFOBA13_LENGTH               0x00000001

#define _C1FIFOBAL_FIFOBA14_POSITION             0x0000000E
#define _C1FIFOBAL_FIFOBA14_MASK                 0x00004000
#define _C1FIFOBAL_FIFOBA14_LENGTH               0x00000001

#define _C1FIFOBAL_FIFOBA15_POSITION             0x0000000F
#define _C1FIFOBAL_FIFOBA15_MASK                 0x00008000
#define _C1FIFOBAL_FIFOBA15_LENGTH               0x00000001

#define _C1FIFOBAH_FIFOBA_POSITION               0x00000000
#define _C1FIFOBAH_FIFOBA_MASK                   0x0000FFFF
#define _C1FIFOBAH_FIFOBA_LENGTH                 0x00000010

#define _C1FIFOBAH_FIFOBA16_POSITION             0x00000000
#define _C1FIFOBAH_FIFOBA16_MASK                 0x00000001
#define _C1FIFOBAH_FIFOBA16_LENGTH               0x00000001

#define _C1FIFOBAH_FIFOBA17_POSITION             0x00000001
#define _C1FIFOBAH_FIFOBA17_MASK                 0x00000002
#define _C1FIFOBAH_FIFOBA17_LENGTH               0x00000001

#define _C1FIFOBAH_FIFOBA18_POSITION             0x00000002
#define _C1FIFOBAH_FIFOBA18_MASK                 0x00000004
#define _C1FIFOBAH_FIFOBA18_LENGTH               0x00000001

#define _C1FIFOBAH_FIFOBA19_POSITION             0x00000003
#define _C1FIFOBAH_FIFOBA19_MASK                 0x00000008
#define _C1FIFOBAH_FIFOBA19_LENGTH               0x00000001

#define _C1FIFOBAH_FIFOBA20_POSITION             0x00000004
#define _C1FIFOBAH_FIFOBA20_MASK                 0x00000010
#define _C1FIFOBAH_FIFOBA20_LENGTH               0x00000001

#define _C1FIFOBAH_FIFOBA21_POSITION             0x00000005
#define _C1FIFOBAH_FIFOBA21_MASK                 0x00000020
#define _C1FIFOBAH_FIFOBA21_LENGTH               0x00000001

#define _C1FIFOBAH_FIFOBA22_POSITION             0x00000006
#define _C1FIFOBAH_FIFOBA22_MASK                 0x00000040
#define _C1FIFOBAH_FIFOBA22_LENGTH               0x00000001

#define _C1FIFOBAH_FIFOBA23_POSITION             0x00000007
#define _C1FIFOBAH_FIFOBA23_MASK                 0x00000080
#define _C1FIFOBAH_FIFOBA23_LENGTH               0x00000001

#define _C1FIFOBAH_FIFOBA24_POSITION             0x00000008
#define _C1FIFOBAH_FIFOBA24_MASK                 0x00000100
#define _C1FIFOBAH_FIFOBA24_LENGTH               0x00000001

#define _C1FIFOBAH_FIFOBA25_POSITION             0x00000009
#define _C1FIFOBAH_FIFOBA25_MASK                 0x00000200
#define _C1FIFOBAH_FIFOBA25_LENGTH               0x00000001

#define _C1FIFOBAH_FIFOBA26_POSITION             0x0000000A
#define _C1FIFOBAH_FIFOBA26_MASK                 0x00000400
#define _C1FIFOBAH_FIFOBA26_LENGTH               0x00000001

#define _C1FIFOBAH_FIFOBA27_POSITION             0x0000000B
#define _C1FIFOBAH_FIFOBA27_MASK                 0x00000800
#define _C1FIFOBAH_FIFOBA27_LENGTH               0x00000001

#define _C1FIFOBAH_FIFOBA28_POSITION             0x0000000C
#define _C1FIFOBAH_FIFOBA28_MASK                 0x00001000
#define _C1FIFOBAH_FIFOBA28_LENGTH               0x00000001

#define _C1FIFOBAH_FIFOBA29_POSITION             0x0000000D
#define _C1FIFOBAH_FIFOBA29_MASK                 0x00002000
#define _C1FIFOBAH_FIFOBA29_LENGTH               0x00000001

#define _C1FIFOBAH_FIFOBA30_POSITION             0x0000000E
#define _C1FIFOBAH_FIFOBA30_MASK                 0x00004000
#define _C1FIFOBAH_FIFOBA30_LENGTH               0x00000001

#define _C1FIFOBAH_FIFOBA31_POSITION             0x0000000F
#define _C1FIFOBAH_FIFOBA31_MASK                 0x00008000
#define _C1FIFOBAH_FIFOBA31_LENGTH               0x00000001

#define _C1TXQCONL_TXQNIE_POSITION               0x00000000
#define _C1TXQCONL_TXQNIE_MASK                   0x00000001
#define _C1TXQCONL_TXQNIE_LENGTH                 0x00000001

#define _C1TXQCONL_TXQEIE_POSITION               0x00000002
#define _C1TXQCONL_TXQEIE_MASK                   0x00000004
#define _C1TXQCONL_TXQEIE_LENGTH                 0x00000001

#define _C1TXQCONL_TXATIE_POSITION               0x00000004
#define _C1TXQCONL_TXATIE_MASK                   0x00000010
#define _C1TXQCONL_TXATIE_LENGTH                 0x00000001

#define _C1TXQCONL_TXEN_POSITION                 0x00000007
#define _C1TXQCONL_TXEN_MASK                     0x00000080
#define _C1TXQCONL_TXEN_LENGTH                   0x00000001

#define _C1TXQCONL_UINC_POSITION                 0x00000008
#define _C1TXQCONL_UINC_MASK                     0x00000100
#define _C1TXQCONL_UINC_LENGTH                   0x00000001

