gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
#define _C1TXQCONL_TXREQ_POSITION                0x00000009
#define _C1TXQCONL_TXREQ_MASK                    0x00000200
#define _C1TXQCONL_TXREQ_LENGTH                  0x00000001

#define _C1TXQCONL_FRESET_POSITION               0x0000000A
#define _C1TXQCONL_FRESET_MASK                   0x00000400
#define _C1TXQCONL_FRESET_LENGTH                 0x00000001

#define _C1TXQCONH_TXPRI_POSITION                0x00000000
#define _C1TXQCONH_TXPRI_MASK                    0x0000001F
#define _C1TXQCONH_TXPRI_LENGTH                  0x00000005

#define _C1TXQCONH_TXAT_POSITION                 0x00000005
#define _C1TXQCONH_TXAT_MASK                     0x00000060
#define _C1TXQCONH_TXAT_LENGTH                   0x00000002

#define _C1TXQCONH_FSIZE_POSITION                0x00000008
#define _C1TXQCONH_FSIZE_MASK                    0x00001F00
#define _C1TXQCONH_FSIZE_LENGTH                  0x00000005

#define _C1TXQCONH_PLSIZE_POSITION               0x0000000D
#define _C1TXQCONH_PLSIZE_MASK                   0x0000E000
#define _C1TXQCONH_PLSIZE_LENGTH                 0x00000003

#define _C1TXQCONH_TXPRI0_POSITION               0x00000000
#define _C1TXQCONH_TXPRI0_MASK                   0x00000001
#define _C1TXQCONH_TXPRI0_LENGTH                 0x00000001

#define _C1TXQCONH_TXPRI1_POSITION               0x00000001
#define _C1TXQCONH_TXPRI1_MASK                   0x00000002
#define _C1TXQCONH_TXPRI1_LENGTH                 0x00000001

#define _C1TXQCONH_TXPRI2_POSITION               0x00000002
#define _C1TXQCONH_TXPRI2_MASK                   0x00000004
#define _C1TXQCONH_TXPRI2_LENGTH                 0x00000001

#define _C1TXQCONH_TXPRI3_POSITION               0x00000003
#define _C1TXQCONH_TXPRI3_MASK                   0x00000008
#define _C1TXQCONH_TXPRI3_LENGTH                 0x00000001

#define _C1TXQCONH_TXPRI4_POSITION               0x00000004
#define _C1TXQCONH_TXPRI4_MASK                   0x00000010
#define _C1TXQCONH_TXPRI4_LENGTH                 0x00000001

#define _C1TXQCONH_TXAT0_POSITION                0x00000005
#define _C1TXQCONH_TXAT0_MASK                    0x00000020
#define _C1TXQCONH_TXAT0_LENGTH                  0x00000001

#define _C1TXQCONH_TXAT1_POSITION                0x00000006
#define _C1TXQCONH_TXAT1_MASK                    0x00000040
#define _C1TXQCONH_TXAT1_LENGTH                  0x00000001

#define _C1TXQCONH_FSIZE0_POSITION               0x00000008
#define _C1TXQCONH_FSIZE0_MASK                   0x00000100
#define _C1TXQCONH_FSIZE0_LENGTH                 0x00000001

#define _C1TXQCONH_FSIZE1_POSITION               0x00000009
#define _C1TXQCONH_FSIZE1_MASK                   0x00000200
#define _C1TXQCONH_FSIZE1_LENGTH                 0x00000001

#define _C1TXQCONH_FSIZE2_POSITION               0x0000000A
#define _C1TXQCONH_FSIZE2_MASK                   0x00000400
#define _C1TXQCONH_FSIZE2_LENGTH                 0x00000001

#define _C1TXQCONH_FSIZE3_POSITION               0x0000000B
#define _C1TXQCONH_FSIZE3_MASK                   0x00000800
#define _C1TXQCONH_FSIZE3_LENGTH                 0x00000001

#define _C1TXQCONH_FSIZE4_POSITION               0x0000000C
#define _C1TXQCONH_FSIZE4_MASK                   0x00001000
#define _C1TXQCONH_FSIZE4_LENGTH                 0x00000001

#define _C1TXQCONH_PLSIZE0_POSITION              0x0000000D
#define _C1TXQCONH_PLSIZE0_MASK                  0x00002000
#define _C1TXQCONH_PLSIZE0_LENGTH                0x00000001

#define _C1TXQCONH_PLSIZE1_POSITION              0x0000000E
#define _C1TXQCONH_PLSIZE1_MASK                  0x00004000
#define _C1TXQCONH_PLSIZE1_LENGTH                0x00000001

#define _C1TXQCONH_PLSIZE2_POSITION              0x0000000F
#define _C1TXQCONH_PLSIZE2_MASK                  0x00008000
#define _C1TXQCONH_PLSIZE2_LENGTH                0x00000001

#define _C1TXQSTA_TXQNIF_POSITION                0x00000000
#define _C1TXQSTA_TXQNIF_MASK                    0x00000001
#define _C1TXQSTA_TXQNIF_LENGTH                  0x00000001

#define _C1TXQSTA_TXQEIF_POSITION                0x00000002
#define _C1TXQSTA_TXQEIF_MASK                    0x00000004
#define _C1TXQSTA_TXQEIF_LENGTH                  0x00000001

#define _C1TXQSTA_TXATIF_POSITION                0x00000004
#define _C1TXQSTA_TXATIF_MASK                    0x00000010
#define _C1TXQSTA_TXATIF_LENGTH                  0x00000001

#define _C1TXQSTA_TXERR_POSITION                 0x00000005
#define _C1TXQSTA_TXERR_MASK                     0x00000020
#define _C1TXQSTA_TXERR_LENGTH                   0x00000001

#define _C1TXQSTA_TXLARB_POSITION                0x00000006
#define _C1TXQSTA_TXLARB_MASK                    0x00000040
#define _C1TXQSTA_TXLARB_LENGTH                  0x00000001

#define _C1TXQSTA_TXABT_POSITION                 0x00000007
#define _C1TXQSTA_TXABT_MASK                     0x00000080
#define _C1TXQSTA_TXABT_LENGTH                   0x00000001

#define _C1TXQSTA_TXQCI_POSITION                 0x00000008
#define _C1TXQSTA_TXQCI_MASK                     0x00001F00
#define _C1TXQSTA_TXQCI_LENGTH                   0x00000005

#define _C1TXQSTA_TXQCI0_POSITION                0x00000008
#define _C1TXQSTA_TXQCI0_MASK                    0x00000100
#define _C1TXQSTA_TXQCI0_LENGTH                  0x00000001

#define _C1TXQSTA_TXQCI1_POSITION                0x00000009
#define _C1TXQSTA_TXQCI1_MASK                    0x00000200
#define _C1TXQSTA_TXQCI1_LENGTH                  0x00000001

#define _C1TXQSTA_TXQCI2_POSITION                0x0000000A
#define _C1TXQSTA_TXQCI2_MASK                    0x00000400
#define _C1TXQSTA_TXQCI2_LENGTH                  0x00000001

#define _C1TXQSTA_TXQCI3_POSITION                0x0000000B
#define _C1TXQSTA_TXQCI3_MASK                    0x00000800
#define _C1TXQSTA_TXQCI3_LENGTH                  0x00000001

#define _C1TXQSTA_TXQCI4_POSITION                0x0000000C
#define _C1TXQSTA_TXQCI4_MASK                    0x00001000
#define _C1TXQSTA_TXQCI4_LENGTH                  0x00000001

#define _C1TXQUAL_TXQUA_POSITION                 0x00000000
#define _C1TXQUAL_TXQUA_MASK                     0x0000FFFF
#define _C1TXQUAL_TXQUA_LENGTH                   0x00000010

#define _C1TXQUAL_TXQUA0_POSITION                0x00000000
#define _C1TXQUAL_TXQUA0_MASK                    0x00000001
#define _C1TXQUAL_TXQUA0_LENGTH                  0x00000001

