gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
#define _C1TXQUAL_TXQUA1_POSITION                0x00000001
#define _C1TXQUAL_TXQUA1_MASK                    0x00000002
#define _C1TXQUAL_TXQUA1_LENGTH                  0x00000001

#define _C1TXQUAL_TXQUA2_POSITION                0x00000002
#define _C1TXQUAL_TXQUA2_MASK                    0x00000004
#define _C1TXQUAL_TXQUA2_LENGTH                  0x00000001

#define _C1TXQUAL_TXQUA3_POSITION                0x00000003
#define _C1TXQUAL_TXQUA3_MASK                    0x00000008
#define _C1TXQUAL_TXQUA3_LENGTH                  0x00000001

#define _C1TXQUAL_TXQUA4_POSITION                0x00000004
#define _C1TXQUAL_TXQUA4_MASK                    0x00000010
#define _C1TXQUAL_TXQUA4_LENGTH                  0x00000001

#define _C1TXQUAL_TXQUA5_POSITION                0x00000005
#define _C1TXQUAL_TXQUA5_MASK                    0x00000020
#define _C1TXQUAL_TXQUA5_LENGTH                  0x00000001

#define _C1TXQUAL_TXQUA6_POSITION                0x00000006
#define _C1TXQUAL_TXQUA6_MASK                    0x00000040
#define _C1TXQUAL_TXQUA6_LENGTH                  0x00000001

#define _C1TXQUAL_TXQUA7_POSITION                0x00000007
#define _C1TXQUAL_TXQUA7_MASK                    0x00000080
#define _C1TXQUAL_TXQUA7_LENGTH                  0x00000001

#define _C1TXQUAL_TXQUA8_POSITION                0x00000008
#define _C1TXQUAL_TXQUA8_MASK                    0x00000100
#define _C1TXQUAL_TXQUA8_LENGTH                  0x00000001

#define _C1TXQUAL_TXQUA9_POSITION                0x00000009
#define _C1TXQUAL_TXQUA9_MASK                    0x00000200
#define _C1TXQUAL_TXQUA9_LENGTH                  0x00000001

#define _C1TXQUAL_TXQUA10_POSITION               0x0000000A
#define _C1TXQUAL_TXQUA10_MASK                   0x00000400
#define _C1TXQUAL_TXQUA10_LENGTH                 0x00000001

#define _C1TXQUAL_TXQUA11_POSITION               0x0000000B
#define _C1TXQUAL_TXQUA11_MASK                   0x00000800
#define _C1TXQUAL_TXQUA11_LENGTH                 0x00000001

#define _C1TXQUAL_TXQUA12_POSITION               0x0000000C
#define _C1TXQUAL_TXQUA12_MASK                   0x00001000
#define _C1TXQUAL_TXQUA12_LENGTH                 0x00000001

#define _C1TXQUAL_TXQUA13_POSITION               0x0000000D
#define _C1TXQUAL_TXQUA13_MASK                   0x00002000
#define _C1TXQUAL_TXQUA13_LENGTH                 0x00000001

#define _C1TXQUAL_TXQUA14_POSITION               0x0000000E
#define _C1TXQUAL_TXQUA14_MASK                   0x00004000
#define _C1TXQUAL_TXQUA14_LENGTH                 0x00000001

#define _C1TXQUAL_TXQUA15_POSITION               0x0000000F
#define _C1TXQUAL_TXQUA15_MASK                   0x00008000
#define _C1TXQUAL_TXQUA15_LENGTH                 0x00000001

#define _C1TXQUAH_TXQUA_POSITION                 0x00000000
#define _C1TXQUAH_TXQUA_MASK                     0x0000FFFF
#define _C1TXQUAH_TXQUA_LENGTH                   0x00000010

#define _C1TXQUAH_TXQUA16_POSITION               0x00000000
#define _C1TXQUAH_TXQUA16_MASK                   0x00000001
#define _C1TXQUAH_TXQUA16_LENGTH                 0x00000001

#define _C1TXQUAH_TXQUA17_POSITION               0x00000001
#define _C1TXQUAH_TXQUA17_MASK                   0x00000002
#define _C1TXQUAH_TXQUA17_LENGTH                 0x00000001

#define _C1TXQUAH_TXQUA18_POSITION               0x00000002
#define _C1TXQUAH_TXQUA18_MASK                   0x00000004
#define _C1TXQUAH_TXQUA18_LENGTH                 0x00000001

#define _C1TXQUAH_TXQUA19_POSITION               0x00000003
#define _C1TXQUAH_TXQUA19_MASK                   0x00000008
#define _C1TXQUAH_TXQUA19_LENGTH                 0x00000001

#define _C1TXQUAH_TXQUA20_POSITION               0x00000004
#define _C1TXQUAH_TXQUA20_MASK                   0x00000010
#define _C1TXQUAH_TXQUA20_LENGTH                 0x00000001

#define _C1TXQUAH_TXQUA21_POSITION               0x00000005
#define _C1TXQUAH_TXQUA21_MASK                   0x00000020
#define _C1TXQUAH_TXQUA21_LENGTH                 0x00000001

#define _C1TXQUAH_TXQUA22_POSITION               0x00000006
#define _C1TXQUAH_TXQUA22_MASK                   0x00000040
#define _C1TXQUAH_TXQUA22_LENGTH                 0x00000001

#define _C1TXQUAH_TXQUA23_POSITION               0x00000007
#define _C1TXQUAH_TXQUA23_MASK                   0x00000080
#define _C1TXQUAH_TXQUA23_LENGTH                 0x00000001

#define _C1TXQUAH_TXQUA24_POSITION               0x00000008
#define _C1TXQUAH_TXQUA24_MASK                   0x00000100
#define _C1TXQUAH_TXQUA24_LENGTH                 0x00000001

#define _C1TXQUAH_TXQUA25_POSITION               0x00000009
#define _C1TXQUAH_TXQUA25_MASK                   0x00000200
#define _C1TXQUAH_TXQUA25_LENGTH                 0x00000001

#define _C1TXQUAH_TXQUA26_POSITION               0x0000000A
#define _C1TXQUAH_TXQUA26_MASK                   0x00000400
#define _C1TXQUAH_TXQUA26_LENGTH                 0x00000001

#define _C1TXQUAH_TXQUA27_POSITION               0x0000000B
#define _C1TXQUAH_TXQUA27_MASK                   0x00000800
#define _C1TXQUAH_TXQUA27_LENGTH                 0x00000001

#define _C1TXQUAH_TXQUA28_POSITION               0x0000000C
#define _C1TXQUAH_TXQUA28_MASK                   0x00001000
#define _C1TXQUAH_TXQUA28_LENGTH                 0x00000001

#define _C1TXQUAH_TXQUA29_POSITION               0x0000000D
#define _C1TXQUAH_TXQUA29_MASK                   0x00002000
#define _C1TXQUAH_TXQUA29_LENGTH                 0x00000001

#define _C1TXQUAH_TXQUA30_POSITION               0x0000000E
#define _C1TXQUAH_TXQUA30_MASK                   0x00004000
#define _C1TXQUAH_TXQUA30_LENGTH                 0x00000001

#define _C1TXQUAH_TXQUA31_POSITION               0x0000000F
#define _C1TXQUAH_TXQUA31_MASK                   0x00008000
#define _C1TXQUAH_TXQUA31_LENGTH                 0x00000001

#define _C1FIFOCON1L_TFNRFNIE_POSITION           0x00000000
#define _C1FIFOCON1L_TFNRFNIE_MASK               0x00000001
#define _C1FIFOCON1L_TFNRFNIE_LENGTH             0x00000001

#define _C1FIFOCON1L_TFHRFHIE_POSITION           0x00000001
#define _C1FIFOCON1L_TFHRFHIE_MASK               0x00000002
#define _C1FIFOCON1L_TFHRFHIE_LENGTH             0x00000001

#define _C1FIFOCON1L_TFERFFIE_POSITION           0x00000002
#define _C1FIFOCON1L_TFERFFIE_MASK               0x00000004
#define _C1FIFOCON1L_TFERFFIE_LENGTH             0x00000001

#define _C1FIFOCON1L_RXOVIE_POSITION             0x00000003
#define _C1FIFOCON1L_RXOVIE_MASK                 0x00000008
#define _C1FIFOCON1L_RXOVIE_LENGTH               0x00000001

#define _C1FIFOCON1L_TXATIE_POSITION             0x00000004
#define _C1FIFOCON1L_TXATIE_MASK                 0x00000010
#define _C1FIFOCON1L_TXATIE_LENGTH               0x00000001

#define _C1FIFOCON1L_RXTSEN_POSITION             0x00000005
#define _C1FIFOCON1L_RXTSEN_MASK                 0x00000020
#define _C1FIFOCON1L_RXTSEN_LENGTH               0x00000001

