gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
#define _C1FIFOCON5H_TXPRI3_POSITION             0x00000003
#define _C1FIFOCON5H_TXPRI3_MASK                 0x00000008
#define _C1FIFOCON5H_TXPRI3_LENGTH               0x00000001

#define _C1FIFOCON5H_TXPRI4_POSITION             0x00000004
#define _C1FIFOCON5H_TXPRI4_MASK                 0x00000010
#define _C1FIFOCON5H_TXPRI4_LENGTH               0x00000001

#define _C1FIFOCON5H_TXAT0_POSITION              0x00000005
#define _C1FIFOCON5H_TXAT0_MASK                  0x00000020
#define _C1FIFOCON5H_TXAT0_LENGTH                0x00000001

#define _C1FIFOCON5H_TXAT1_POSITION              0x00000006
#define _C1FIFOCON5H_TXAT1_MASK                  0x00000040
#define _C1FIFOCON5H_TXAT1_LENGTH                0x00000001

#define _C1FIFOCON5H_FSIZE0_POSITION             0x00000008
#define _C1FIFOCON5H_FSIZE0_MASK                 0x00000100
#define _C1FIFOCON5H_FSIZE0_LENGTH               0x00000001

#define _C1FIFOCON5H_FSIZE1_POSITION             0x00000009
#define _C1FIFOCON5H_FSIZE1_MASK                 0x00000200
#define _C1FIFOCON5H_FSIZE1_LENGTH               0x00000001

#define _C1FIFOCON5H_FSIZE2_POSITION             0x0000000A
#define _C1FIFOCON5H_FSIZE2_MASK                 0x00000400
#define _C1FIFOCON5H_FSIZE2_LENGTH               0x00000001

#define _C1FIFOCON5H_FSIZE3_POSITION             0x0000000B
#define _C1FIFOCON5H_FSIZE3_MASK                 0x00000800
#define _C1FIFOCON5H_FSIZE3_LENGTH               0x00000001

#define _C1FIFOCON5H_FSIZE4_POSITION             0x0000000C
#define _C1FIFOCON5H_FSIZE4_MASK                 0x00001000
#define _C1FIFOCON5H_FSIZE4_LENGTH               0x00000001

#define _C1FIFOCON5H_PLSIZE0_POSITION            0x0000000D
#define _C1FIFOCON5H_PLSIZE0_MASK                0x00002000
#define _C1FIFOCON5H_PLSIZE0_LENGTH              0x00000001

#define _C1FIFOCON5H_PLSIZE1_POSITION            0x0000000E
#define _C1FIFOCON5H_PLSIZE1_MASK                0x00004000
#define _C1FIFOCON5H_PLSIZE1_LENGTH              0x00000001

#define _C1FIFOCON5H_PLSIZE2_POSITION            0x0000000F
#define _C1FIFOCON5H_PLSIZE2_MASK                0x00008000
#define _C1FIFOCON5H_PLSIZE2_LENGTH              0x00000001

#define _C1FIFOSTA5_TFNRFNIF_POSITION            0x00000000
#define _C1FIFOSTA5_TFNRFNIF_MASK                0x00000001
#define _C1FIFOSTA5_TFNRFNIF_LENGTH              0x00000001

#define _C1FIFOSTA5_TFHRFHIF_POSITION            0x00000001
#define _C1FIFOSTA5_TFHRFHIF_MASK                0x00000002
#define _C1FIFOSTA5_TFHRFHIF_LENGTH              0x00000001

#define _C1FIFOSTA5_TFERFFIF_POSITION            0x00000002
#define _C1FIFOSTA5_TFERFFIF_MASK                0x00000004
#define _C1FIFOSTA5_TFERFFIF_LENGTH              0x00000001

#define _C1FIFOSTA5_RXOVIF_POSITION              0x00000003
#define _C1FIFOSTA5_RXOVIF_MASK                  0x00000008
#define _C1FIFOSTA5_RXOVIF_LENGTH                0x00000001

#define _C1FIFOSTA5_TXATIF_POSITION              0x00000004
#define _C1FIFOSTA5_TXATIF_MASK                  0x00000010
#define _C1FIFOSTA5_TXATIF_LENGTH                0x00000001

#define _C1FIFOSTA5_TXERR_POSITION               0x00000005
#define _C1FIFOSTA5_TXERR_MASK                   0x00000020
#define _C1FIFOSTA5_TXERR_LENGTH                 0x00000001

#define _C1FIFOSTA5_TXLARB_POSITION              0x00000006
#define _C1FIFOSTA5_TXLARB_MASK                  0x00000040
#define _C1FIFOSTA5_TXLARB_LENGTH                0x00000001

#define _C1FIFOSTA5_TXABT_POSITION               0x00000007
#define _C1FIFOSTA5_TXABT_MASK                   0x00000080
#define _C1FIFOSTA5_TXABT_LENGTH                 0x00000001

#define _C1FIFOSTA5_FIFOCI_POSITION              0x00000008
#define _C1FIFOSTA5_FIFOCI_MASK                  0x00001F00
#define _C1FIFOSTA5_FIFOCI_LENGTH                0x00000005

#define _C1FIFOSTA5_FIFOCI0_POSITION             0x00000008
#define _C1FIFOSTA5_FIFOCI0_MASK                 0x00000100
#define _C1FIFOSTA5_FIFOCI0_LENGTH               0x00000001

#define _C1FIFOSTA5_FIFOCI1_POSITION             0x00000009
#define _C1FIFOSTA5_FIFOCI1_MASK                 0x00000200
#define _C1FIFOSTA5_FIFOCI1_LENGTH               0x00000001

#define _C1FIFOSTA5_FIFOCI2_POSITION             0x0000000A
#define _C1FIFOSTA5_FIFOCI2_MASK                 0x00000400
#define _C1FIFOSTA5_FIFOCI2_LENGTH               0x00000001

#define _C1FIFOSTA5_FIFOCI3_POSITION             0x0000000B
#define _C1FIFOSTA5_FIFOCI3_MASK                 0x00000800
#define _C1FIFOSTA5_FIFOCI3_LENGTH               0x00000001

#define _C1FIFOSTA5_FIFOCI4_POSITION             0x0000000C
#define _C1FIFOSTA5_FIFOCI4_MASK                 0x00001000
#define _C1FIFOSTA5_FIFOCI4_LENGTH               0x00000001

#define _C1FIFOUA5L_FIFOUA_POSITION              0x00000000
#define _C1FIFOUA5L_FIFOUA_MASK                  0x0000FFFF
#define _C1FIFOUA5L_FIFOUA_LENGTH                0x00000010

#define _C1FIFOUA5L_FIFOUA0_POSITION             0x00000000
#define _C1FIFOUA5L_FIFOUA0_MASK                 0x00000001
#define _C1FIFOUA5L_FIFOUA0_LENGTH               0x00000001

#define _C1FIFOUA5L_FIFOUA1_POSITION             0x00000001
#define _C1FIFOUA5L_FIFOUA1_MASK                 0x00000002
#define _C1FIFOUA5L_FIFOUA1_LENGTH               0x00000001

#define _C1FIFOUA5L_FIFOUA2_POSITION             0x00000002
#define _C1FIFOUA5L_FIFOUA2_MASK                 0x00000004
#define _C1FIFOUA5L_FIFOUA2_LENGTH               0x00000001

#define _C1FIFOUA5L_FIFOUA3_POSITION             0x00000003
#define _C1FIFOUA5L_FIFOUA3_MASK                 0x00000008
#define _C1FIFOUA5L_FIFOUA3_LENGTH               0x00000001

#define _C1FIFOUA5L_FIFOUA4_POSITION             0x00000004
#define _C1FIFOUA5L_FIFOUA4_MASK                 0x00000010
#define _C1FIFOUA5L_FIFOUA4_LENGTH               0x00000001

#define _C1FIFOUA5L_FIFOUA5_POSITION             0x00000005
#define _C1FIFOUA5L_FIFOUA5_MASK                 0x00000020
#define _C1FIFOUA5L_FIFOUA5_LENGTH               0x00000001

#define _C1FIFOUA5L_FIFOUA6_POSITION             0x00000006
#define _C1FIFOUA5L_FIFOUA6_MASK                 0x00000040
#define _C1FIFOUA5L_FIFOUA6_LENGTH               0x00000001

#define _C1FIFOUA5L_FIFOUA7_POSITION             0x00000007
#define _C1FIFOUA5L_FIFOUA7_MASK                 0x00000080
#define _C1FIFOUA5L_FIFOUA7_LENGTH               0x00000001

