gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
#define _C1FIFOCON7L_RXOVIE_POSITION             0x00000003
#define _C1FIFOCON7L_RXOVIE_MASK                 0x00000008
#define _C1FIFOCON7L_RXOVIE_LENGTH               0x00000001

#define _C1FIFOCON7L_TXATIE_POSITION             0x00000004
#define _C1FIFOCON7L_TXATIE_MASK                 0x00000010
#define _C1FIFOCON7L_TXATIE_LENGTH               0x00000001

#define _C1FIFOCON7L_RXTSEN_POSITION             0x00000005
#define _C1FIFOCON7L_RXTSEN_MASK                 0x00000020
#define _C1FIFOCON7L_RXTSEN_LENGTH               0x00000001

#define _C1FIFOCON7L_RTREN_POSITION              0x00000006
#define _C1FIFOCON7L_RTREN_MASK                  0x00000040
#define _C1FIFOCON7L_RTREN_LENGTH                0x00000001

#define _C1FIFOCON7L_TXEN_POSITION               0x00000007
#define _C1FIFOCON7L_TXEN_MASK                   0x00000080
#define _C1FIFOCON7L_TXEN_LENGTH                 0x00000001

#define _C1FIFOCON7L_UINC_POSITION               0x00000008
#define _C1FIFOCON7L_UINC_MASK                   0x00000100
#define _C1FIFOCON7L_UINC_LENGTH                 0x00000001

#define _C1FIFOCON7L_TXREQ_POSITION              0x00000009
#define _C1FIFOCON7L_TXREQ_MASK                  0x00000200
#define _C1FIFOCON7L_TXREQ_LENGTH                0x00000001

#define _C1FIFOCON7L_FRESET_POSITION             0x0000000A
#define _C1FIFOCON7L_FRESET_MASK                 0x00000400
#define _C1FIFOCON7L_FRESET_LENGTH               0x00000001

#define _C1FIFOCON7H_TXPRI_POSITION              0x00000000
#define _C1FIFOCON7H_TXPRI_MASK                  0x0000001F
#define _C1FIFOCON7H_TXPRI_LENGTH                0x00000005

#define _C1FIFOCON7H_TXAT_POSITION               0x00000005
#define _C1FIFOCON7H_TXAT_MASK                   0x00000060
#define _C1FIFOCON7H_TXAT_LENGTH                 0x00000002

#define _C1FIFOCON7H_FSIZE_POSITION              0x00000008
#define _C1FIFOCON7H_FSIZE_MASK                  0x00001F00
#define _C1FIFOCON7H_FSIZE_LENGTH                0x00000005

#define _C1FIFOCON7H_PLSIZE_POSITION             0x0000000D
#define _C1FIFOCON7H_PLSIZE_MASK                 0x0000E000
#define _C1FIFOCON7H_PLSIZE_LENGTH               0x00000003

#define _C1FIFOCON7H_TXPRI0_POSITION             0x00000000
#define _C1FIFOCON7H_TXPRI0_MASK                 0x00000001
#define _C1FIFOCON7H_TXPRI0_LENGTH               0x00000001

#define _C1FIFOCON7H_TXPRI1_POSITION             0x00000001
#define _C1FIFOCON7H_TXPRI1_MASK                 0x00000002
#define _C1FIFOCON7H_TXPRI1_LENGTH               0x00000001

#define _C1FIFOCON7H_TXPRI2_POSITION             0x00000002
#define _C1FIFOCON7H_TXPRI2_MASK                 0x00000004
#define _C1FIFOCON7H_TXPRI2_LENGTH               0x00000001

#define _C1FIFOCON7H_TXPRI3_POSITION             0x00000003
#define _C1FIFOCON7H_TXPRI3_MASK                 0x00000008
#define _C1FIFOCON7H_TXPRI3_LENGTH               0x00000001

#define _C1FIFOCON7H_TXPRI4_POSITION             0x00000004
#define _C1FIFOCON7H_TXPRI4_MASK                 0x00000010
#define _C1FIFOCON7H_TXPRI4_LENGTH               0x00000001

#define _C1FIFOCON7H_TXAT0_POSITION              0x00000005
#define _C1FIFOCON7H_TXAT0_MASK                  0x00000020
#define _C1FIFOCON7H_TXAT0_LENGTH                0x00000001

#define _C1FIFOCON7H_TXAT1_POSITION              0x00000006
#define _C1FIFOCON7H_TXAT1_MASK                  0x00000040
#define _C1FIFOCON7H_TXAT1_LENGTH                0x00000001

#define _C1FIFOCON7H_FSIZE0_POSITION             0x00000008
#define _C1FIFOCON7H_FSIZE0_MASK                 0x00000100
#define _C1FIFOCON7H_FSIZE0_LENGTH               0x00000001

#define _C1FIFOCON7H_FSIZE1_POSITION             0x00000009
#define _C1FIFOCON7H_FSIZE1_MASK                 0x00000200
#define _C1FIFOCON7H_FSIZE1_LENGTH               0x00000001

#define _C1FIFOCON7H_FSIZE2_POSITION             0x0000000A
#define _C1FIFOCON7H_FSIZE2_MASK                 0x00000400
#define _C1FIFOCON7H_FSIZE2_LENGTH               0x00000001

#define _C1FIFOCON7H_FSIZE3_POSITION             0x0000000B
#define _C1FIFOCON7H_FSIZE3_MASK                 0x00000800
#define _C1FIFOCON7H_FSIZE3_LENGTH               0x00000001

#define _C1FIFOCON7H_FSIZE4_POSITION             0x0000000C
#define _C1FIFOCON7H_FSIZE4_MASK                 0x00001000
#define _C1FIFOCON7H_FSIZE4_LENGTH               0x00000001

#define _C1FIFOCON7H_PLSIZE0_POSITION            0x0000000D
#define _C1FIFOCON7H_PLSIZE0_MASK                0x00002000
#define _C1FIFOCON7H_PLSIZE0_LENGTH              0x00000001

#define _C1FIFOCON7H_PLSIZE1_POSITION            0x0000000E
#define _C1FIFOCON7H_PLSIZE1_MASK                0x00004000
#define _C1FIFOCON7H_PLSIZE1_LENGTH              0x00000001

#define _C1FIFOCON7H_PLSIZE2_POSITION            0x0000000F
#define _C1FIFOCON7H_PLSIZE2_MASK                0x00008000
#define _C1FIFOCON7H_PLSIZE2_LENGTH              0x00000001

#define _C1FIFOSTA7_TFNRFNIF_POSITION            0x00000000
#define _C1FIFOSTA7_TFNRFNIF_MASK                0x00000001
#define _C1FIFOSTA7_TFNRFNIF_LENGTH              0x00000001

#define _C1FIFOSTA7_TFHRFHIF_POSITION            0x00000001
#define _C1FIFOSTA7_TFHRFHIF_MASK                0x00000002
#define _C1FIFOSTA7_TFHRFHIF_LENGTH              0x00000001

#define _C1FIFOSTA7_TFERFFIF_POSITION            0x00000002
#define _C1FIFOSTA7_TFERFFIF_MASK                0x00000004
#define _C1FIFOSTA7_TFERFFIF_LENGTH              0x00000001

#define _C1FIFOSTA7_RXOVIF_POSITION              0x00000003
#define _C1FIFOSTA7_RXOVIF_MASK                  0x00000008
#define _C1FIFOSTA7_RXOVIF_LENGTH                0x00000001

#define _C1FIFOSTA7_TXATIF_POSITION              0x00000004
#define _C1FIFOSTA7_TXATIF_MASK                  0x00000010
#define _C1FIFOSTA7_TXATIF_LENGTH                0x00000001

#define _C1FIFOSTA7_TXERR_POSITION               0x00000005
#define _C1FIFOSTA7_TXERR_MASK                   0x00000020
#define _C1FIFOSTA7_TXERR_LENGTH                 0x00000001

#define _C1FIFOSTA7_TXLARB_POSITION              0x00000006
#define _C1FIFOSTA7_TXLARB_MASK                  0x00000040
#define _C1FIFOSTA7_TXLARB_LENGTH                0x00000001

#define _C1FIFOSTA7_TXABT_POSITION               0x00000007
#define _C1FIFOSTA7_TXABT_MASK                   0x00000080
#define _C1FIFOSTA7_TXABT_LENGTH                 0x00000001

#define _C1FIFOSTA7_FIFOCI_POSITION              0x00000008
#define _C1FIFOSTA7_FIFOCI_MASK                  0x00001F00
#define _C1FIFOSTA7_FIFOCI_LENGTH                0x00000005

#define _C1FIFOSTA7_FIFOCI0_POSITION             0x00000008
#define _C1FIFOSTA7_FIFOCI0_MASK                 0x00000100
#define _C1FIFOSTA7_FIFOCI0_LENGTH               0x00000001

#define _C1FIFOSTA7_FIFOCI1_POSITION             0x00000009
#define _C1FIFOSTA7_FIFOCI1_MASK                 0x00000200
#define _C1FIFOSTA7_FIFOCI1_LENGTH               0x00000001

