gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
#define _C1FLTCON1H_F6BP_POSITION                0x00000000
#define _C1FLTCON1H_F6BP_MASK                    0x0000001F
#define _C1FLTCON1H_F6BP_LENGTH                  0x00000005

#define _C1FLTCON1H_FLTEN6_POSITION              0x00000007
#define _C1FLTCON1H_FLTEN6_MASK                  0x00000080
#define _C1FLTCON1H_FLTEN6_LENGTH                0x00000001

#define _C1FLTCON1H_F7BP_POSITION                0x00000008
#define _C1FLTCON1H_F7BP_MASK                    0x00001F00
#define _C1FLTCON1H_F7BP_LENGTH                  0x00000005

#define _C1FLTCON1H_FLTEN7_POSITION              0x0000000F
#define _C1FLTCON1H_FLTEN7_MASK                  0x00008000
#define _C1FLTCON1H_FLTEN7_LENGTH                0x00000001

#define _C1FLTCON2L_F8BP_POSITION                0x00000000
#define _C1FLTCON2L_F8BP_MASK                    0x0000001F
#define _C1FLTCON2L_F8BP_LENGTH                  0x00000005

#define _C1FLTCON2L_FLTEN8_POSITION              0x00000007
#define _C1FLTCON2L_FLTEN8_MASK                  0x00000080
#define _C1FLTCON2L_FLTEN8_LENGTH                0x00000001

#define _C1FLTCON2L_F9BP_POSITION                0x00000008
#define _C1FLTCON2L_F9BP_MASK                    0x00001F00
#define _C1FLTCON2L_F9BP_LENGTH                  0x00000005

#define _C1FLTCON2L_FLTEN9_POSITION              0x0000000F
#define _C1FLTCON2L_FLTEN9_MASK                  0x00008000
#define _C1FLTCON2L_FLTEN9_LENGTH                0x00000001

#define _C1FLTCON2H_F10BP_POSITION               0x00000000
#define _C1FLTCON2H_F10BP_MASK                   0x0000001F
#define _C1FLTCON2H_F10BP_LENGTH                 0x00000005

#define _C1FLTCON2H_FLTEN10_POSITION             0x00000007
#define _C1FLTCON2H_FLTEN10_MASK                 0x00000080
#define _C1FLTCON2H_FLTEN10_LENGTH               0x00000001

#define _C1FLTCON2H_F11BP_POSITION               0x00000008
#define _C1FLTCON2H_F11BP_MASK                   0x00001F00
#define _C1FLTCON2H_F11BP_LENGTH                 0x00000005

#define _C1FLTCON2H_FLTEN11_POSITION             0x0000000F
#define _C1FLTCON2H_FLTEN11_MASK                 0x00008000
#define _C1FLTCON2H_FLTEN11_LENGTH               0x00000001

#define _C1FLTCON3L_F12BP_POSITION               0x00000000
#define _C1FLTCON3L_F12BP_MASK                   0x0000001F
#define _C1FLTCON3L_F12BP_LENGTH                 0x00000005

#define _C1FLTCON3L_FLTEN12_POSITION             0x00000007
#define _C1FLTCON3L_FLTEN12_MASK                 0x00000080
#define _C1FLTCON3L_FLTEN12_LENGTH               0x00000001

#define _C1FLTCON3L_F13BP_POSITION               0x00000008
#define _C1FLTCON3L_F13BP_MASK                   0x00001F00
#define _C1FLTCON3L_F13BP_LENGTH                 0x00000005

#define _C1FLTCON3L_FLTEN13_POSITION             0x0000000F
#define _C1FLTCON3L_FLTEN13_MASK                 0x00008000
#define _C1FLTCON3L_FLTEN13_LENGTH               0x00000001

#define _C1FLTCON3H_F14BP_POSITION               0x00000000
#define _C1FLTCON3H_F14BP_MASK                   0x0000001F
#define _C1FLTCON3H_F14BP_LENGTH                 0x00000005

#define _C1FLTCON3H_FLTEN14_POSITION             0x00000007
#define _C1FLTCON3H_FLTEN14_MASK                 0x00000080
#define _C1FLTCON3H_FLTEN14_LENGTH               0x00000001

#define _C1FLTCON3H_F15BP_POSITION               0x00000008
#define _C1FLTCON3H_F15BP_MASK                   0x00001F00
#define _C1FLTCON3H_F15BP_LENGTH                 0x00000005

#define _C1FLTCON3H_FLTEN15_POSITION             0x0000000F
#define _C1FLTCON3H_FLTEN15_MASK                 0x00008000
#define _C1FLTCON3H_FLTEN15_LENGTH               0x00000001

#define _C1FLTOBJ0L_SID_POSITION                 0x00000000
#define _C1FLTOBJ0L_SID_MASK                     0x000007FF
#define _C1FLTOBJ0L_SID_LENGTH                   0x0000000B

#define _C1FLTOBJ0L_EID_POSITION                 0x0000000B
#define _C1FLTOBJ0L_EID_MASK                     0x0000F800
#define _C1FLTOBJ0L_EID_LENGTH                   0x00000005

#define _C1FLTOBJ0L_SID0_POSITION                0x00000000
#define _C1FLTOBJ0L_SID0_MASK                    0x00000001
#define _C1FLTOBJ0L_SID0_LENGTH                  0x00000001

#define _C1FLTOBJ0L_SID1_POSITION                0x00000001
#define _C1FLTOBJ0L_SID1_MASK                    0x00000002
#define _C1FLTOBJ0L_SID1_LENGTH                  0x00000001

#define _C1FLTOBJ0L_SID2_POSITION                0x00000002
#define _C1FLTOBJ0L_SID2_MASK                    0x00000004
#define _C1FLTOBJ0L_SID2_LENGTH                  0x00000001

#define _C1FLTOBJ0L_SID3_POSITION                0x00000003
#define _C1FLTOBJ0L_SID3_MASK                    0x00000008
#define _C1FLTOBJ0L_SID3_LENGTH                  0x00000001

#define _C1FLTOBJ0L_SID4_POSITION                0x00000004
#define _C1FLTOBJ0L_SID4_MASK                    0x00000010
#define _C1FLTOBJ0L_SID4_LENGTH                  0x00000001

#define _C1FLTOBJ0L_SID5_POSITION                0x00000005
#define _C1FLTOBJ0L_SID5_MASK                    0x00000020
#define _C1FLTOBJ0L_SID5_LENGTH                  0x00000001

#define _C1FLTOBJ0L_SID6_POSITION                0x00000006
#define _C1FLTOBJ0L_SID6_MASK                    0x00000040
#define _C1FLTOBJ0L_SID6_LENGTH                  0x00000001

#define _C1FLTOBJ0L_SID7_POSITION                0x00000007
#define _C1FLTOBJ0L_SID7_MASK                    0x00000080
#define _C1FLTOBJ0L_SID7_LENGTH                  0x00000001

#define _C1FLTOBJ0L_SID8_POSITION                0x00000008
#define _C1FLTOBJ0L_SID8_MASK                    0x00000100
#define _C1FLTOBJ0L_SID8_LENGTH                  0x00000001

#define _C1FLTOBJ0L_SID9_POSITION                0x00000009
#define _C1FLTOBJ0L_SID9_MASK                    0x00000200
#define _C1FLTOBJ0L_SID9_LENGTH                  0x00000001

#define _C1FLTOBJ0L_SID10_POSITION               0x0000000A
#define _C1FLTOBJ0L_SID10_MASK                   0x00000400
#define _C1FLTOBJ0L_SID10_LENGTH                 0x00000001

#define _C1FLTOBJ0L_EID0_POSITION                0x0000000B
#define _C1FLTOBJ0L_EID0_MASK                    0x00000800
#define _C1FLTOBJ0L_EID0_LENGTH                  0x00000001

#define _C1FLTOBJ0L_EID1_POSITION                0x0000000C
#define _C1FLTOBJ0L_EID1_MASK                    0x00001000
#define _C1FLTOBJ0L_EID1_LENGTH                  0x00000001

#define _C1FLTOBJ0L_EID2_POSITION                0x0000000D
#define _C1FLTOBJ0L_EID2_MASK                    0x00002000
#define _C1FLTOBJ0L_EID2_LENGTH                  0x00000001

