gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
#define _C1MASK0H_MSID11_POSITION                0x0000000D
#define _C1MASK0H_MSID11_MASK                    0x00002000
#define _C1MASK0H_MSID11_LENGTH                  0x00000001

#define _C1MASK0H_MIDE_POSITION                  0x0000000E
#define _C1MASK0H_MIDE_MASK                      0x00004000
#define _C1MASK0H_MIDE_LENGTH                    0x00000001

#define _C1MASK0H_MEID5_POSITION                 0x00000000
#define _C1MASK0H_MEID5_MASK                     0x00000001
#define _C1MASK0H_MEID5_LENGTH                   0x00000001

#define _C1MASK0H_MEID6_POSITION                 0x00000001
#define _C1MASK0H_MEID6_MASK                     0x00000002
#define _C1MASK0H_MEID6_LENGTH                   0x00000001

#define _C1MASK0H_MEID7_POSITION                 0x00000002
#define _C1MASK0H_MEID7_MASK                     0x00000004
#define _C1MASK0H_MEID7_LENGTH                   0x00000001

#define _C1MASK0H_MEID8_POSITION                 0x00000003
#define _C1MASK0H_MEID8_MASK                     0x00000008
#define _C1MASK0H_MEID8_LENGTH                   0x00000001

#define _C1MASK0H_MEID9_POSITION                 0x00000004
#define _C1MASK0H_MEID9_MASK                     0x00000010
#define _C1MASK0H_MEID9_LENGTH                   0x00000001

#define _C1MASK0H_MEID10_POSITION                0x00000005
#define _C1MASK0H_MEID10_MASK                    0x00000020
#define _C1MASK0H_MEID10_LENGTH                  0x00000001

#define _C1MASK0H_MEID11_POSITION                0x00000006
#define _C1MASK0H_MEID11_MASK                    0x00000040
#define _C1MASK0H_MEID11_LENGTH                  0x00000001

#define _C1MASK0H_MEID12_POSITION                0x00000007
#define _C1MASK0H_MEID12_MASK                    0x00000080
#define _C1MASK0H_MEID12_LENGTH                  0x00000001

#define _C1MASK0H_MEID13_POSITION                0x00000008
#define _C1MASK0H_MEID13_MASK                    0x00000100
#define _C1MASK0H_MEID13_LENGTH                  0x00000001

#define _C1MASK0H_MEID14_POSITION                0x00000009
#define _C1MASK0H_MEID14_MASK                    0x00000200
#define _C1MASK0H_MEID14_LENGTH                  0x00000001

#define _C1MASK0H_MEID15_POSITION                0x0000000A
#define _C1MASK0H_MEID15_MASK                    0x00000400
#define _C1MASK0H_MEID15_LENGTH                  0x00000001

#define _C1MASK0H_MEID16_POSITION                0x0000000B
#define _C1MASK0H_MEID16_MASK                    0x00000800
#define _C1MASK0H_MEID16_LENGTH                  0x00000001

#define _C1MASK0H_MEID17_POSITION                0x0000000C
#define _C1MASK0H_MEID17_MASK                    0x00001000
#define _C1MASK0H_MEID17_LENGTH                  0x00000001

#define _C1FLTOBJ1L_SID_POSITION                 0x00000000
#define _C1FLTOBJ1L_SID_MASK                     0x000007FF
#define _C1FLTOBJ1L_SID_LENGTH                   0x0000000B

#define _C1FLTOBJ1L_EID_POSITION                 0x0000000B
#define _C1FLTOBJ1L_EID_MASK                     0x0000F800
#define _C1FLTOBJ1L_EID_LENGTH                   0x00000005

#define _C1FLTOBJ1L_SID0_POSITION                0x00000000
#define _C1FLTOBJ1L_SID0_MASK                    0x00000001
#define _C1FLTOBJ1L_SID0_LENGTH                  0x00000001

#define _C1FLTOBJ1L_SID1_POSITION                0x00000001
#define _C1FLTOBJ1L_SID1_MASK                    0x00000002
#define _C1FLTOBJ1L_SID1_LENGTH                  0x00000001

#define _C1FLTOBJ1L_SID2_POSITION                0x00000002
#define _C1FLTOBJ1L_SID2_MASK                    0x00000004
#define _C1FLTOBJ1L_SID2_LENGTH                  0x00000001

#define _C1FLTOBJ1L_SID3_POSITION                0x00000003
#define _C1FLTOBJ1L_SID3_MASK                    0x00000008
#define _C1FLTOBJ1L_SID3_LENGTH                  0x00000001

#define _C1FLTOBJ1L_SID4_POSITION                0x00000004
#define _C1FLTOBJ1L_SID4_MASK                    0x00000010
#define _C1FLTOBJ1L_SID4_LENGTH                  0x00000001

#define _C1FLTOBJ1L_SID5_POSITION                0x00000005
#define _C1FLTOBJ1L_SID5_MASK                    0x00000020
#define _C1FLTOBJ1L_SID5_LENGTH                  0x00000001

#define _C1FLTOBJ1L_SID6_POSITION                0x00000006
#define _C1FLTOBJ1L_SID6_MASK                    0x00000040
#define _C1FLTOBJ1L_SID6_LENGTH                  0x00000001

#define _C1FLTOBJ1L_SID7_POSITION                0x00000007
#define _C1FLTOBJ1L_SID7_MASK                    0x00000080
#define _C1FLTOBJ1L_SID7_LENGTH                  0x00000001

#define _C1FLTOBJ1L_SID8_POSITION                0x00000008
#define _C1FLTOBJ1L_SID8_MASK                    0x00000100
#define _C1FLTOBJ1L_SID8_LENGTH                  0x00000001

#define _C1FLTOBJ1L_SID9_POSITION                0x00000009
#define _C1FLTOBJ1L_SID9_MASK                    0x00000200
#define _C1FLTOBJ1L_SID9_LENGTH                  0x00000001

#define _C1FLTOBJ1L_SID10_POSITION               0x0000000A
#define _C1FLTOBJ1L_SID10_MASK                   0x00000400
#define _C1FLTOBJ1L_SID10_LENGTH                 0x00000001

#define _C1FLTOBJ1L_EID0_POSITION                0x0000000B
#define _C1FLTOBJ1L_EID0_MASK                    0x00000800
#define _C1FLTOBJ1L_EID0_LENGTH                  0x00000001

#define _C1FLTOBJ1L_EID1_POSITION                0x0000000C
#define _C1FLTOBJ1L_EID1_MASK                    0x00001000
#define _C1FLTOBJ1L_EID1_LENGTH                  0x00000001

#define _C1FLTOBJ1L_EID2_POSITION                0x0000000D
#define _C1FLTOBJ1L_EID2_MASK                    0x00002000
#define _C1FLTOBJ1L_EID2_LENGTH                  0x00000001

#define _C1FLTOBJ1L_EID3_POSITION                0x0000000E
#define _C1FLTOBJ1L_EID3_MASK                    0x00004000
#define _C1FLTOBJ1L_EID3_LENGTH                  0x00000001

#define _C1FLTOBJ1L_EID4_POSITION                0x0000000F
#define _C1FLTOBJ1L_EID4_MASK                    0x00008000
#define _C1FLTOBJ1L_EID4_LENGTH                  0x00000001

#define _C1FLTOBJ1H_EID_POSITION                 0x00000000
#define _C1FLTOBJ1H_EID_MASK                     0x00001FFF
#define _C1FLTOBJ1H_EID_LENGTH                   0x0000000D

