gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
#define _C1FLTOBJ15L_SID1_POSITION               0x00000001
#define _C1FLTOBJ15L_SID1_MASK                   0x00000002
#define _C1FLTOBJ15L_SID1_LENGTH                 0x00000001

#define _C1FLTOBJ15L_SID2_POSITION               0x00000002
#define _C1FLTOBJ15L_SID2_MASK                   0x00000004
#define _C1FLTOBJ15L_SID2_LENGTH                 0x00000001

#define _C1FLTOBJ15L_SID3_POSITION               0x00000003
#define _C1FLTOBJ15L_SID3_MASK                   0x00000008
#define _C1FLTOBJ15L_SID3_LENGTH                 0x00000001

#define _C1FLTOBJ15L_SID4_POSITION               0x00000004
#define _C1FLTOBJ15L_SID4_MASK                   0x00000010
#define _C1FLTOBJ15L_SID4_LENGTH                 0x00000001

#define _C1FLTOBJ15L_SID5_POSITION               0x00000005
#define _C1FLTOBJ15L_SID5_MASK                   0x00000020
#define _C1FLTOBJ15L_SID5_LENGTH                 0x00000001

#define _C1FLTOBJ15L_SID6_POSITION               0x00000006
#define _C1FLTOBJ15L_SID6_MASK                   0x00000040
#define _C1FLTOBJ15L_SID6_LENGTH                 0x00000001

#define _C1FLTOBJ15L_SID7_POSITION               0x00000007
#define _C1FLTOBJ15L_SID7_MASK                   0x00000080
#define _C1FLTOBJ15L_SID7_LENGTH                 0x00000001

#define _C1FLTOBJ15L_SID8_POSITION               0x00000008
#define _C1FLTOBJ15L_SID8_MASK                   0x00000100
#define _C1FLTOBJ15L_SID8_LENGTH                 0x00000001

#define _C1FLTOBJ15L_SID9_POSITION               0x00000009
#define _C1FLTOBJ15L_SID9_MASK                   0x00000200
#define _C1FLTOBJ15L_SID9_LENGTH                 0x00000001

#define _C1FLTOBJ15L_SID10_POSITION              0x0000000A
#define _C1FLTOBJ15L_SID10_MASK                  0x00000400
#define _C1FLTOBJ15L_SID10_LENGTH                0x00000001

#define _C1FLTOBJ15L_EID0_POSITION               0x0000000B
#define _C1FLTOBJ15L_EID0_MASK                   0x00000800
#define _C1FLTOBJ15L_EID0_LENGTH                 0x00000001

#define _C1FLTOBJ15L_EID1_POSITION               0x0000000C
#define _C1FLTOBJ15L_EID1_MASK                   0x00001000
#define _C1FLTOBJ15L_EID1_LENGTH                 0x00000001

#define _C1FLTOBJ15L_EID2_POSITION               0x0000000D
#define _C1FLTOBJ15L_EID2_MASK                   0x00002000
#define _C1FLTOBJ15L_EID2_LENGTH                 0x00000001

#define _C1FLTOBJ15L_EID3_POSITION               0x0000000E
#define _C1FLTOBJ15L_EID3_MASK                   0x00004000
#define _C1FLTOBJ15L_EID3_LENGTH                 0x00000001

#define _C1FLTOBJ15L_EID4_POSITION               0x0000000F
#define _C1FLTOBJ15L_EID4_MASK                   0x00008000
#define _C1FLTOBJ15L_EID4_LENGTH                 0x00000001

#define _C1FLTOBJ15H_EID_POSITION                0x00000000
#define _C1FLTOBJ15H_EID_MASK                    0x00001FFF
#define _C1FLTOBJ15H_EID_LENGTH                  0x0000000D

#define _C1FLTOBJ15H_SID11_POSITION              0x0000000D
#define _C1FLTOBJ15H_SID11_MASK                  0x00002000
#define _C1FLTOBJ15H_SID11_LENGTH                0x00000001

#define _C1FLTOBJ15H_EXIDE_POSITION              0x0000000E
#define _C1FLTOBJ15H_EXIDE_MASK                  0x00004000
#define _C1FLTOBJ15H_EXIDE_LENGTH                0x00000001

#define _C1FLTOBJ15H_EID5_POSITION               0x00000000
#define _C1FLTOBJ15H_EID5_MASK                   0x00000001
#define _C1FLTOBJ15H_EID5_LENGTH                 0x00000001

#define _C1FLTOBJ15H_EID6_POSITION               0x00000001
#define _C1FLTOBJ15H_EID6_MASK                   0x00000002
#define _C1FLTOBJ15H_EID6_LENGTH                 0x00000001

#define _C1FLTOBJ15H_EID7_POSITION               0x00000002
#define _C1FLTOBJ15H_EID7_MASK                   0x00000004
#define _C1FLTOBJ15H_EID7_LENGTH                 0x00000001

#define _C1FLTOBJ15H_EID8_POSITION               0x00000003
#define _C1FLTOBJ15H_EID8_MASK                   0x00000008
#define _C1FLTOBJ15H_EID8_LENGTH                 0x00000001

#define _C1FLTOBJ15H_EID9_POSITION               0x00000004
#define _C1FLTOBJ15H_EID9_MASK                   0x00000010
#define _C1FLTOBJ15H_EID9_LENGTH                 0x00000001

#define _C1FLTOBJ15H_EID10_POSITION              0x00000005
#define _C1FLTOBJ15H_EID10_MASK                  0x00000020
#define _C1FLTOBJ15H_EID10_LENGTH                0x00000001

#define _C1FLTOBJ15H_EID11_POSITION              0x00000006
#define _C1FLTOBJ15H_EID11_MASK                  0x00000040
#define _C1FLTOBJ15H_EID11_LENGTH                0x00000001

#define _C1FLTOBJ15H_EID12_POSITION              0x00000007
#define _C1FLTOBJ15H_EID12_MASK                  0x00000080
#define _C1FLTOBJ15H_EID12_LENGTH                0x00000001

#define _C1FLTOBJ15H_EID13_POSITION              0x00000008
#define _C1FLTOBJ15H_EID13_MASK                  0x00000100
#define _C1FLTOBJ15H_EID13_LENGTH                0x00000001

#define _C1FLTOBJ15H_EID14_POSITION              0x00000009
#define _C1FLTOBJ15H_EID14_MASK                  0x00000200
#define _C1FLTOBJ15H_EID14_LENGTH                0x00000001

#define _C1FLTOBJ15H_EID15_POSITION              0x0000000A
#define _C1FLTOBJ15H_EID15_MASK                  0x00000400
#define _C1FLTOBJ15H_EID15_LENGTH                0x00000001

#define _C1FLTOBJ15H_EID16_POSITION              0x0000000B
#define _C1FLTOBJ15H_EID16_MASK                  0x00000800
#define _C1FLTOBJ15H_EID16_LENGTH                0x00000001

#define _C1FLTOBJ15H_EID17_POSITION              0x0000000C
#define _C1FLTOBJ15H_EID17_MASK                  0x00001000
#define _C1FLTOBJ15H_EID17_LENGTH                0x00000001

#define _C1MASK15L_MSID_POSITION                 0x00000000
#define _C1MASK15L_MSID_MASK                     0x000007FF
#define _C1MASK15L_MSID_LENGTH                   0x0000000B

#define _C1MASK15L_MEID_POSITION                 0x0000000B
#define _C1MASK15L_MEID_MASK                     0x0000F800
#define _C1MASK15L_MEID_LENGTH                   0x00000005

#define _C1MASK15L_MSID0_POSITION                0x00000000
#define _C1MASK15L_MSID0_MASK                    0x00000001
#define _C1MASK15L_MSID0_LENGTH                  0x00000001

#define _C1MASK15L_MSID1_POSITION                0x00000001
#define _C1MASK15L_MSID1_MASK                    0x00000002
#define _C1MASK15L_MSID1_LENGTH                  0x00000001

#define _C1MASK15L_MSID2_POSITION                0x00000002
#define _C1MASK15L_MSID2_MASK                    0x00000004
#define _C1MASK15L_MSID2_LENGTH                  0x00000001

#define _C1MASK15L_MSID3_POSITION                0x00000003
#define _C1MASK15L_MSID3_MASK                    0x00000008
#define _C1MASK15L_MSID3_LENGTH                  0x00000001

