gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
#define _IFS0_CCT1IF_POSITION                    0x00000007
#define _IFS0_CCT1IF_MASK                        0x00000080
#define _IFS0_CCT1IF_LENGTH                      0x00000001

#define _IFS0_DMA1IF_POSITION                    0x00000008
#define _IFS0_DMA1IF_MASK                        0x00000100
#define _IFS0_DMA1IF_LENGTH                      0x00000001

#define _IFS0_SPI1RXIF_POSITION                  0x00000009
#define _IFS0_SPI1RXIF_MASK                      0x00000200
#define _IFS0_SPI1RXIF_LENGTH                    0x00000001

#define _IFS0_SPI1TXIF_POSITION                  0x0000000A
#define _IFS0_SPI1TXIF_MASK                      0x00000400
#define _IFS0_SPI1TXIF_LENGTH                    0x00000001

#define _IFS0_U1RXIF_POSITION                    0x0000000B
#define _IFS0_U1RXIF_MASK                        0x00000800
#define _IFS0_U1RXIF_LENGTH                      0x00000001

#define _IFS0_U1TXIF_POSITION                    0x0000000C
#define _IFS0_U1TXIF_MASK                        0x00001000
#define _IFS0_U1TXIF_LENGTH                      0x00000001

#define _IFS0_ECCSBEIF_POSITION                  0x0000000D
#define _IFS0_ECCSBEIF_MASK                      0x00002000
#define _IFS0_ECCSBEIF_LENGTH                    0x00000001

#define _IFS0_NVMIF_POSITION                     0x0000000E
#define _IFS0_NVMIF_MASK                         0x00004000
#define _IFS0_NVMIF_LENGTH                       0x00000001

#define _IFS0_INT1IF_POSITION                    0x0000000F
#define _IFS0_INT1IF_MASK                        0x00008000
#define _IFS0_INT1IF_LENGTH                      0x00000001

#define _IFS1_SI2C1IF_POSITION                   0x00000000
#define _IFS1_SI2C1IF_MASK                       0x00000001
#define _IFS1_SI2C1IF_LENGTH                     0x00000001

#define _IFS1_MI2C1IF_POSITION                   0x00000001
#define _IFS1_MI2C1IF_MASK                       0x00000002
#define _IFS1_MI2C1IF_LENGTH                     0x00000001

#define _IFS1_DMA2IF_POSITION                    0x00000002
#define _IFS1_DMA2IF_MASK                        0x00000004
#define _IFS1_DMA2IF_LENGTH                      0x00000001

#define _IFS1_CNCIF_POSITION                     0x00000003
#define _IFS1_CNCIF_MASK                         0x00000008
#define _IFS1_CNCIF_LENGTH                       0x00000001

#define _IFS1_INT2IF_POSITION                    0x00000004
#define _IFS1_INT2IF_MASK                        0x00000010
#define _IFS1_INT2IF_LENGTH                      0x00000001

#define _IFS1_DMA3IF_POSITION                    0x00000005
#define _IFS1_DMA3IF_MASK                        0x00000020
#define _IFS1_DMA3IF_LENGTH                      0x00000001

#define _IFS1_CCP2IF_POSITION                    0x00000007
#define _IFS1_CCP2IF_MASK                        0x00000080
#define _IFS1_CCP2IF_LENGTH                      0x00000001

#define _IFS1_CCT2IF_POSITION                    0x00000008
#define _IFS1_CCT2IF_MASK                        0x00000100
#define _IFS1_CCT2IF_LENGTH                      0x00000001

#define _IFS1_C1IF_POSITION                      0x00000009
#define _IFS1_C1IF_MASK                          0x00000200
#define _IFS1_C1IF_LENGTH                        0x00000001

#define _IFS1_INT3IF_POSITION                    0x0000000A
#define _IFS1_INT3IF_MASK                        0x00000400
#define _IFS1_INT3IF_LENGTH                      0x00000001

#define _IFS1_U2RXIF_POSITION                    0x0000000B
#define _IFS1_U2RXIF_MASK                        0x00000800
#define _IFS1_U2RXIF_LENGTH                      0x00000001

#define _IFS1_U2TXIF_POSITION                    0x0000000C
#define _IFS1_U2TXIF_MASK                        0x00001000
#define _IFS1_U2TXIF_LENGTH                      0x00000001

#define _IFS1_SPI2RXIF_POSITION                  0x0000000D
#define _IFS1_SPI2RXIF_MASK                      0x00002000
#define _IFS1_SPI2RXIF_LENGTH                    0x00000001

#define _IFS1_SPI2TXIF_POSITION                  0x0000000E
#define _IFS1_SPI2TXIF_MASK                      0x00004000
#define _IFS1_SPI2TXIF_LENGTH                    0x00000001

#define _IFS1_C1RXIF_POSITION                    0x0000000F
#define _IFS1_C1RXIF_MASK                        0x00008000
#define _IFS1_C1RXIF_LENGTH                      0x00000001

#define _IFS2_CCP3IF_POSITION                    0x00000003
#define _IFS2_CCP3IF_MASK                        0x00000008
#define _IFS2_CCP3IF_LENGTH                      0x00000001

#define _IFS2_CCT3IF_POSITION                    0x00000004
#define _IFS2_CCT3IF_MASK                        0x00000010
#define _IFS2_CCT3IF_LENGTH                      0x00000001

#define _IFS2_SI2C2IF_POSITION                   0x00000005
#define _IFS2_SI2C2IF_MASK                       0x00000020
#define _IFS2_SI2C2IF_LENGTH                     0x00000001

#define _IFS2_MI2C2IF_POSITION                   0x00000006
#define _IFS2_MI2C2IF_MASK                       0x00000040
#define _IFS2_MI2C2IF_LENGTH                     0x00000001

#define _IFS2_CCP4IF_POSITION                    0x00000008
#define _IFS2_CCP4IF_MASK                        0x00000100
#define _IFS2_CCP4IF_LENGTH                      0x00000001

#define _IFS2_CCT4IF_POSITION                    0x00000009
#define _IFS2_CCT4IF_MASK                        0x00000200
#define _IFS2_CCT4IF_LENGTH                      0x00000001

#define _IFS2_CCP5IF_POSITION                    0x0000000B
#define _IFS2_CCP5IF_MASK                        0x00000800
#define _IFS2_CCP5IF_LENGTH                      0x00000001

#define _IFS2_CCT5IF_POSITION                    0x0000000C
#define _IFS2_CCT5IF_MASK                        0x00001000
#define _IFS2_CCT5IF_LENGTH                      0x00000001

#define _IFS2_DMTIF_POSITION                     0x0000000D
#define _IFS2_DMTIF_MASK                         0x00002000
#define _IFS2_DMTIF_LENGTH                       0x00000001

#define _IFS2_CCP6IF_POSITION                    0x0000000E
#define _IFS2_CCP6IF_MASK                        0x00004000
#define _IFS2_CCP6IF_LENGTH                      0x00000001

