gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
#define _IFS2_CCT6IF_POSITION                    0x0000000F
#define _IFS2_CCT6IF_MASK                        0x00008000
#define _IFS2_CCT6IF_LENGTH                      0x00000001

#define _IFS3_QEI1IF_POSITION                    0x00000000
#define _IFS3_QEI1IF_MASK                        0x00000001
#define _IFS3_QEI1IF_LENGTH                      0x00000001

#define _IFS3_U1EIF_POSITION                     0x00000001
#define _IFS3_U1EIF_MASK                         0x00000002
#define _IFS3_U1EIF_LENGTH                       0x00000001

#define _IFS3_U2EIF_POSITION                     0x00000002
#define _IFS3_U2EIF_MASK                         0x00000004
#define _IFS3_U2EIF_LENGTH                       0x00000001

#define _IFS3_CRCIF_POSITION                     0x00000003
#define _IFS3_CRCIF_MASK                         0x00000008
#define _IFS3_CRCIF_LENGTH                       0x00000001

#define _IFS3_C1TXIF_POSITION                    0x00000004
#define _IFS3_C1TXIF_MASK                        0x00000010
#define _IFS3_C1TXIF_LENGTH                      0x00000001

#define _IFS3_QEI2IF_POSITION                    0x00000006
#define _IFS3_QEI2IF_MASK                        0x00000040
#define _IFS3_QEI2IF_LENGTH                      0x00000001

#define _IFS3_U3EIF_POSITION                     0x00000008
#define _IFS3_U3EIF_MASK                         0x00000100
#define _IFS3_U3EIF_LENGTH                       0x00000001

#define _IFS3_U3RXIF_POSITION                    0x00000009
#define _IFS3_U3RXIF_MASK                        0x00000200
#define _IFS3_U3RXIF_LENGTH                      0x00000001

#define _IFS3_U3TXIF_POSITION                    0x0000000A
#define _IFS3_U3TXIF_MASK                        0x00000400
#define _IFS3_U3TXIF_LENGTH                      0x00000001

#define _IFS3_SPI3RXIF_POSITION                  0x0000000B
#define _IFS3_SPI3RXIF_MASK                      0x00000800
#define _IFS3_SPI3RXIF_LENGTH                    0x00000001

#define _IFS3_SPI3TXIF_POSITION                  0x0000000C
#define _IFS3_SPI3TXIF_MASK                      0x00001000
#define _IFS3_SPI3TXIF_LENGTH                    0x00000001

#define _IFS3_JTAGIF_POSITION                    0x0000000E
#define _IFS3_JTAGIF_MASK                        0x00004000
#define _IFS3_JTAGIF_LENGTH                      0x00000001

#define _IFS3_PTGSTEPIF_POSITION                 0x0000000F
#define _IFS3_PTGSTEPIF_MASK                     0x00008000
#define _IFS3_PTGSTEPIF_LENGTH                   0x00000001

#define _IFS4_I2C1BCIF_POSITION                  0x00000000
#define _IFS4_I2C1BCIF_MASK                      0x00000001
#define _IFS4_I2C1BCIF_LENGTH                    0x00000001

#define _IFS4_I2C2BCIF_POSITION                  0x00000001
#define _IFS4_I2C2BCIF_MASK                      0x00000002
#define _IFS4_I2C2BCIF_LENGTH                    0x00000001

#define _IFS4_PWM1IF_POSITION                    0x00000003
#define _IFS4_PWM1IF_MASK                        0x00000008
#define _IFS4_PWM1IF_LENGTH                      0x00000001

#define _IFS4_PWM2IF_POSITION                    0x00000004
#define _IFS4_PWM2IF_MASK                        0x00000010
#define _IFS4_PWM2IF_LENGTH                      0x00000001

#define _IFS4_PWM3IF_POSITION                    0x00000005
#define _IFS4_PWM3IF_MASK                        0x00000020
#define _IFS4_PWM3IF_LENGTH                      0x00000001

#define _IFS4_PWM4IF_POSITION                    0x00000006
#define _IFS4_PWM4IF_MASK                        0x00000040
#define _IFS4_PWM4IF_LENGTH                      0x00000001

#define _IFS4_PWM5IF_POSITION                    0x00000007
#define _IFS4_PWM5IF_MASK                        0x00000080
#define _IFS4_PWM5IF_LENGTH                      0x00000001

#define _IFS4_PWM6IF_POSITION                    0x00000008
#define _IFS4_PWM6IF_MASK                        0x00000100
#define _IFS4_PWM6IF_LENGTH                      0x00000001

#define _IFS4_PWM7IF_POSITION                    0x00000009
#define _IFS4_PWM7IF_MASK                        0x00000200
#define _IFS4_PWM7IF_LENGTH                      0x00000001

#define _IFS4_PWM8IF_POSITION                    0x0000000A
#define _IFS4_PWM8IF_MASK                        0x00000400
#define _IFS4_PWM8IF_LENGTH                      0x00000001

#define _IFS4_CNDIF_POSITION                     0x0000000B
#define _IFS4_CNDIF_MASK                         0x00000800
#define _IFS4_CNDIF_LENGTH                       0x00000001

#define _IFS4_CMP1IF_POSITION                    0x0000000D
#define _IFS4_CMP1IF_MASK                        0x00002000
#define _IFS4_CMP1IF_LENGTH                      0x00000001

#define _IFS4_CMP2IF_POSITION                    0x0000000E
#define _IFS4_CMP2IF_MASK                        0x00004000
#define _IFS4_CMP2IF_LENGTH                      0x00000001

#define _IFS4_CMP3IF_POSITION                    0x0000000F
#define _IFS4_CMP3IF_MASK                        0x00008000
#define _IFS4_CMP3IF_LENGTH                      0x00000001

#define _IFS5_PTGWDTIF_POSITION                  0x00000001
#define _IFS5_PTGWDTIF_MASK                      0x00000002
#define _IFS5_PTGWDTIF_LENGTH                    0x00000001

#define _IFS5_PTG0IF_POSITION                    0x00000002
#define _IFS5_PTG0IF_MASK                        0x00000004
#define _IFS5_PTG0IF_LENGTH                      0x00000001

#define _IFS5_PTG1IF_POSITION                    0x00000003
#define _IFS5_PTG1IF_MASK                        0x00000008
#define _IFS5_PTG1IF_LENGTH                      0x00000001

#define _IFS5_PTG2IF_POSITION                    0x00000004
#define _IFS5_PTG2IF_MASK                        0x00000010
#define _IFS5_PTG2IF_LENGTH                      0x00000001

#define _IFS5_PTG3IF_POSITION                    0x00000005
#define _IFS5_PTG3IF_MASK                        0x00000020
#define _IFS5_PTG3IF_LENGTH                      0x00000001

#define _IFS5_SENT1IF_POSITION                   0x00000006
#define _IFS5_SENT1IF_MASK                       0x00000040
#define _IFS5_SENT1IF_LENGTH                     0x00000001

#define _IFS5_SENT1EIF_POSITION                  0x00000007
#define _IFS5_SENT1EIF_MASK                      0x00000080
#define _IFS5_SENT1EIF_LENGTH                    0x00000001

