gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
#define _IFS5_SENT2IF_POSITION                   0x00000008
#define _IFS5_SENT2IF_MASK                       0x00000100
#define _IFS5_SENT2IF_LENGTH                     0x00000001

#define _IFS5_SENT2EIF_POSITION                  0x00000009
#define _IFS5_SENT2EIF_MASK                      0x00000200
#define _IFS5_SENT2EIF_LENGTH                    0x00000001

#define _IFS5_ADCIF_POSITION                     0x0000000A
#define _IFS5_ADCIF_MASK                         0x00000400
#define _IFS5_ADCIF_LENGTH                       0x00000001

#define _IFS5_ADCAN0IF_POSITION                  0x0000000B
#define _IFS5_ADCAN0IF_MASK                      0x00000800
#define _IFS5_ADCAN0IF_LENGTH                    0x00000001

#define _IFS5_ADCAN1IF_POSITION                  0x0000000C
#define _IFS5_ADCAN1IF_MASK                      0x00001000
#define _IFS5_ADCAN1IF_LENGTH                    0x00000001

#define _IFS5_ADCAN2IF_POSITION                  0x0000000D
#define _IFS5_ADCAN2IF_MASK                      0x00002000
#define _IFS5_ADCAN2IF_LENGTH                    0x00000001

#define _IFS5_ADCAN3IF_POSITION                  0x0000000E
#define _IFS5_ADCAN3IF_MASK                      0x00004000
#define _IFS5_ADCAN3IF_LENGTH                    0x00000001

#define _IFS5_ADCAN4IF_POSITION                  0x0000000F
#define _IFS5_ADCAN4IF_MASK                      0x00008000
#define _IFS5_ADCAN4IF_LENGTH                    0x00000001

#define _IFS6_ADCAN5IF_POSITION                  0x00000000
#define _IFS6_ADCAN5IF_MASK                      0x00000001
#define _IFS6_ADCAN5IF_LENGTH                    0x00000001

#define _IFS6_ADCAN6IF_POSITION                  0x00000001
#define _IFS6_ADCAN6IF_MASK                      0x00000002
#define _IFS6_ADCAN6IF_LENGTH                    0x00000001

#define _IFS6_ADCAN7IF_POSITION                  0x00000002
#define _IFS6_ADCAN7IF_MASK                      0x00000004
#define _IFS6_ADCAN7IF_LENGTH                    0x00000001

#define _IFS6_ADCAN8IF_POSITION                  0x00000003
#define _IFS6_ADCAN8IF_MASK                      0x00000008
#define _IFS6_ADCAN8IF_LENGTH                    0x00000001

#define _IFS6_ADCAN9IF_POSITION                  0x00000004
#define _IFS6_ADCAN9IF_MASK                      0x00000010
#define _IFS6_ADCAN9IF_LENGTH                    0x00000001

#define _IFS6_ADCAN10IF_POSITION                 0x00000005
#define _IFS6_ADCAN10IF_MASK                     0x00000020
#define _IFS6_ADCAN10IF_LENGTH                   0x00000001

#define _IFS6_ADCAN11IF_POSITION                 0x00000006
#define _IFS6_ADCAN11IF_MASK                     0x00000040
#define _IFS6_ADCAN11IF_LENGTH                   0x00000001

#define _IFS6_ADCAN12IF_POSITION                 0x00000007
#define _IFS6_ADCAN12IF_MASK                     0x00000080
#define _IFS6_ADCAN12IF_LENGTH                   0x00000001

#define _IFS6_ADCAN13IF_POSITION                 0x00000008
#define _IFS6_ADCAN13IF_MASK                     0x00000100
#define _IFS6_ADCAN13IF_LENGTH                   0x00000001

#define _IFS6_ADCAN14IF_POSITION                 0x00000009
#define _IFS6_ADCAN14IF_MASK                     0x00000200
#define _IFS6_ADCAN14IF_LENGTH                   0x00000001

#define _IFS6_ADCAN15IF_POSITION                 0x0000000A
#define _IFS6_ADCAN15IF_MASK                     0x00000400
#define _IFS6_ADCAN15IF_LENGTH                   0x00000001

#define _IFS6_ADCAN16IF_POSITION                 0x0000000B
#define _IFS6_ADCAN16IF_MASK                     0x00000800
#define _IFS6_ADCAN16IF_LENGTH                   0x00000001

#define _IFS6_ADCAN17IF_POSITION                 0x0000000C
#define _IFS6_ADCAN17IF_MASK                     0x00001000
#define _IFS6_ADCAN17IF_LENGTH                   0x00000001

#define _IFS6_ADCAN18IF_POSITION                 0x0000000D
#define _IFS6_ADCAN18IF_MASK                     0x00002000
#define _IFS6_ADCAN18IF_LENGTH                   0x00000001

#define _IFS7_ADFLTIF_POSITION                   0x00000003
#define _IFS7_ADFLTIF_MASK                       0x00000008
#define _IFS7_ADFLTIF_LENGTH                     0x00000001

#define _IFS7_ADCMP0IF_POSITION                  0x00000004
#define _IFS7_ADCMP0IF_MASK                      0x00000010
#define _IFS7_ADCMP0IF_LENGTH                    0x00000001

#define _IFS7_ADCMP1IF_POSITION                  0x00000005
#define _IFS7_ADCMP1IF_MASK                      0x00000020
#define _IFS7_ADCMP1IF_LENGTH                    0x00000001

#define _IFS7_ADCMP2IF_POSITION                  0x00000006
#define _IFS7_ADCMP2IF_MASK                      0x00000040
#define _IFS7_ADCMP2IF_LENGTH                    0x00000001

#define _IFS7_ADCMP3IF_POSITION                  0x00000007
#define _IFS7_ADCMP3IF_MASK                      0x00000080
#define _IFS7_ADCMP3IF_LENGTH                    0x00000001

#define _IFS7_ADFLTR0IF_POSITION                 0x00000008
#define _IFS7_ADFLTR0IF_MASK                     0x00000100
#define _IFS7_ADFLTR0IF_LENGTH                   0x00000001

#define _IFS7_ADFLTR1IF_POSITION                 0x00000009
#define _IFS7_ADFLTR1IF_MASK                     0x00000200
#define _IFS7_ADFLTR1IF_LENGTH                   0x00000001

#define _IFS7_ADFLTR2IF_POSITION                 0x0000000A
#define _IFS7_ADFLTR2IF_MASK                     0x00000400
#define _IFS7_ADFLTR2IF_LENGTH                   0x00000001

#define _IFS7_ADFLTR3IF_POSITION                 0x0000000B
#define _IFS7_ADFLTR3IF_MASK                     0x00000800
#define _IFS7_ADFLTR3IF_LENGTH                   0x00000001

#define _IFS7_CLC1PIF_POSITION                   0x0000000C
#define _IFS7_CLC1PIF_MASK                       0x00001000
#define _IFS7_CLC1PIF_LENGTH                     0x00000001

#define _IFS7_CLC2PIF_POSITION                   0x0000000D
#define _IFS7_CLC2PIF_MASK                       0x00002000
#define _IFS7_CLC2PIF_LENGTH                     0x00000001

#define _IFS7_SPI1IF_POSITION                    0x0000000E
#define _IFS7_SPI1IF_MASK                        0x00004000
#define _IFS7_SPI1IF_LENGTH                      0x00000001

#define _IFS7_SPI2IF_POSITION                    0x0000000F
#define _IFS7_SPI2IF_MASK                        0x00008000
#define _IFS7_SPI2IF_LENGTH                      0x00000001

