gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
#define _IFS8_SPI3IF_POSITION                    0x00000000
#define _IFS8_SPI3IF_MASK                        0x00000001
#define _IFS8_SPI3IF_LENGTH                      0x00000001

#define _IFS8_SI2C3IF_POSITION                   0x0000000E
#define _IFS8_SI2C3IF_MASK                       0x00004000
#define _IFS8_SI2C3IF_LENGTH                     0x00000001

#define _IFS8_MI2C3IF_POSITION                   0x0000000F
#define _IFS8_MI2C3IF_MASK                       0x00008000
#define _IFS8_MI2C3IF_LENGTH                     0x00000001

#define _IFS9_I2C3BCIF_POSITION                  0x00000000
#define _IFS9_I2C3BCIF_MASK                      0x00000001
#define _IFS9_I2C3BCIF_LENGTH                    0x00000001

#define _IFS9_CCP7IF_POSITION                    0x00000005
#define _IFS9_CCP7IF_MASK                        0x00000020
#define _IFS9_CCP7IF_LENGTH                      0x00000001

#define _IFS9_CCT7IF_POSITION                    0x00000006
#define _IFS9_CCT7IF_MASK                        0x00000040
#define _IFS9_CCT7IF_LENGTH                      0x00000001

#define _IFS9_CCP8IF_POSITION                    0x00000008
#define _IFS9_CCP8IF_MASK                        0x00000100
#define _IFS9_CCP8IF_LENGTH                      0x00000001

#define _IFS9_CCT8IF_POSITION                    0x00000009
#define _IFS9_CCT8IF_MASK                        0x00000200
#define _IFS9_CCT8IF_LENGTH                      0x00000001

#define _IFS10_ADC0EIF_POSITION                  0x00000000
#define _IFS10_ADC0EIF_MASK                      0x00000001
#define _IFS10_ADC0EIF_LENGTH                    0x00000001

#define _IFS10_ADC1EIF_POSITION                  0x00000001
#define _IFS10_ADC1EIF_MASK                      0x00000002
#define _IFS10_ADC1EIF_LENGTH                    0x00000001

#define _IFS10_ADFIFOIF_POSITION                 0x00000008
#define _IFS10_ADFIFOIF_MASK                     0x00000100
#define _IFS10_ADFIFOIF_LENGTH                   0x00000001

#define _IFS10_PEVTAIF_POSITION                  0x00000009
#define _IFS10_PEVTAIF_MASK                      0x00000200
#define _IFS10_PEVTAIF_LENGTH                    0x00000001

#define _IFS10_PEVTBIF_POSITION                  0x0000000A
#define _IFS10_PEVTBIF_MASK                      0x00000400
#define _IFS10_PEVTBIF_LENGTH                    0x00000001

#define _IFS10_PEVTCIF_POSITION                  0x0000000B
#define _IFS10_PEVTCIF_MASK                      0x00000800
#define _IFS10_PEVTCIF_LENGTH                    0x00000001

#define _IFS10_PEVTDIF_POSITION                  0x0000000C
#define _IFS10_PEVTDIF_MASK                      0x00001000
#define _IFS10_PEVTDIF_LENGTH                    0x00000001

#define _IFS10_PEVTEIF_POSITION                  0x0000000D
#define _IFS10_PEVTEIF_MASK                      0x00002000
#define _IFS10_PEVTEIF_LENGTH                    0x00000001

#define _IFS10_PEVTFIF_POSITION                  0x0000000E
#define _IFS10_PEVTFIF_MASK                      0x00004000
#define _IFS10_PEVTFIF_LENGTH                    0x00000001

#define _IFS10_CLC3PIF_POSITION                  0x0000000F
#define _IFS10_CLC3PIF_MASK                      0x00008000
#define _IFS10_CLC3PIF_LENGTH                    0x00000001

#define _IFS11_CLC4PIF_POSITION                  0x00000000
#define _IFS11_CLC4PIF_MASK                      0x00000001
#define _IFS11_CLC4PIF_LENGTH                    0x00000001

#define _IFS11_CLC1NIF_POSITION                  0x00000001
#define _IFS11_CLC1NIF_MASK                      0x00000002
#define _IFS11_CLC1NIF_LENGTH                    0x00000001

#define _IFS11_CLC2NIF_POSITION                  0x00000002
#define _IFS11_CLC2NIF_MASK                      0x00000004
#define _IFS11_CLC2NIF_LENGTH                    0x00000001

#define _IFS11_CLC3NIF_POSITION                  0x00000003
#define _IFS11_CLC3NIF_MASK                      0x00000008
#define _IFS11_CLC3NIF_LENGTH                    0x00000001

#define _IFS11_CLC4NIF_POSITION                  0x00000004
#define _IFS11_CLC4NIF_MASK                      0x00000010
#define _IFS11_CLC4NIF_LENGTH                    0x00000001

#define _IFS11_CCP9IF_POSITION                   0x00000005
#define _IFS11_CCP9IF_MASK                       0x00000020
#define _IFS11_CCP9IF_LENGTH                     0x00000001

#define _IFS11_CCT9IF_POSITION                   0x00000006
#define _IFS11_CCT9IF_MASK                       0x00000040
#define _IFS11_CCT9IF_LENGTH                     0x00000001

#define _IFS11_U1EVTIF_POSITION                  0x0000000D
#define _IFS11_U1EVTIF_MASK                      0x00002000
#define _IFS11_U1EVTIF_LENGTH                    0x00000001

#define _IFS11_U2EVTIF_POSITION                  0x0000000E
#define _IFS11_U2EVTIF_MASK                      0x00004000
#define _IFS11_U2EVTIF_LENGTH                    0x00000001

#define _IFS11_U3EVTIF_POSITION                  0x0000000F
#define _IFS11_U3EVTIF_MASK                      0x00008000
#define _IFS11_U3EVTIF_LENGTH                    0x00000001

#define _IFS12_ADCAN24IF_POSITION                0x00000000
#define _IFS12_ADCAN24IF_MASK                    0x00000001
#define _IFS12_ADCAN24IF_LENGTH                  0x00000001

#define _IFS12_ADCAN25IF_POSITION                0x00000001
#define _IFS12_ADCAN25IF_MASK                    0x00000002
#define _IFS12_ADCAN25IF_LENGTH                  0x00000001

#define _IEC0_INT0IE_POSITION                    0x00000000
#define _IEC0_INT0IE_MASK                        0x00000001
#define _IEC0_INT0IE_LENGTH                      0x00000001

#define _IEC0_T1IE_POSITION                      0x00000001
#define _IEC0_T1IE_MASK                          0x00000002
#define _IEC0_T1IE_LENGTH                        0x00000001

#define _IEC0_CNAIE_POSITION                     0x00000002
#define _IEC0_CNAIE_MASK                         0x00000004
#define _IEC0_CNAIE_LENGTH                       0x00000001

#define _IEC0_CNBIE_POSITION                     0x00000003
#define _IEC0_CNBIE_MASK                         0x00000008
#define _IEC0_CNBIE_LENGTH                       0x00000001

#define _IEC0_DMA0IE_POSITION                    0x00000004
#define _IEC0_DMA0IE_MASK                        0x00000010
#define _IEC0_DMA0IE_LENGTH                      0x00000001

#define _IEC0_CCP1IE_POSITION                    0x00000006
#define _IEC0_CCP1IE_MASK                        0x00000040
#define _IEC0_CCP1IE_LENGTH                      0x00000001

#define _IEC0_CCT1IE_POSITION                    0x00000007
#define _IEC0_CCT1IE_MASK                        0x00000080
#define _IEC0_CCT1IE_LENGTH                      0x00000001

