gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
#define _IEC0_DMA1IE_POSITION                    0x00000008
#define _IEC0_DMA1IE_MASK                        0x00000100
#define _IEC0_DMA1IE_LENGTH                      0x00000001

#define _IEC0_SPI1RXIE_POSITION                  0x00000009
#define _IEC0_SPI1RXIE_MASK                      0x00000200
#define _IEC0_SPI1RXIE_LENGTH                    0x00000001

#define _IEC0_SPI1TXIE_POSITION                  0x0000000A
#define _IEC0_SPI1TXIE_MASK                      0x00000400
#define _IEC0_SPI1TXIE_LENGTH                    0x00000001

#define _IEC0_U1RXIE_POSITION                    0x0000000B
#define _IEC0_U1RXIE_MASK                        0x00000800
#define _IEC0_U1RXIE_LENGTH                      0x00000001

#define _IEC0_U1TXIE_POSITION                    0x0000000C
#define _IEC0_U1TXIE_MASK                        0x00001000
#define _IEC0_U1TXIE_LENGTH                      0x00000001

#define _IEC0_ECCSBEIE_POSITION                  0x0000000D
#define _IEC0_ECCSBEIE_MASK                      0x00002000
#define _IEC0_ECCSBEIE_LENGTH                    0x00000001

#define _IEC0_NVMIE_POSITION                     0x0000000E
#define _IEC0_NVMIE_MASK                         0x00004000
#define _IEC0_NVMIE_LENGTH                       0x00000001

#define _IEC0_INT1IE_POSITION                    0x0000000F
#define _IEC0_INT1IE_MASK                        0x00008000
#define _IEC0_INT1IE_LENGTH                      0x00000001

#define _IEC1_SI2C1IE_POSITION                   0x00000000
#define _IEC1_SI2C1IE_MASK                       0x00000001
#define _IEC1_SI2C1IE_LENGTH                     0x00000001

#define _IEC1_MI2C1IE_POSITION                   0x00000001
#define _IEC1_MI2C1IE_MASK                       0x00000002
#define _IEC1_MI2C1IE_LENGTH                     0x00000001

#define _IEC1_DMA2IE_POSITION                    0x00000002
#define _IEC1_DMA2IE_MASK                        0x00000004
#define _IEC1_DMA2IE_LENGTH                      0x00000001

#define _IEC1_CNCIE_POSITION                     0x00000003
#define _IEC1_CNCIE_MASK                         0x00000008
#define _IEC1_CNCIE_LENGTH                       0x00000001

#define _IEC1_INT2IE_POSITION                    0x00000004
#define _IEC1_INT2IE_MASK                        0x00000010
#define _IEC1_INT2IE_LENGTH                      0x00000001

#define _IEC1_DMA3IE_POSITION                    0x00000005
#define _IEC1_DMA3IE_MASK                        0x00000020
#define _IEC1_DMA3IE_LENGTH                      0x00000001

#define _IEC1_CCP2IE_POSITION                    0x00000007
#define _IEC1_CCP2IE_MASK                        0x00000080
#define _IEC1_CCP2IE_LENGTH                      0x00000001

#define _IEC1_CCT2IE_POSITION                    0x00000008
#define _IEC1_CCT2IE_MASK                        0x00000100
#define _IEC1_CCT2IE_LENGTH                      0x00000001

#define _IEC1_C1IE_POSITION                      0x00000009
#define _IEC1_C1IE_MASK                          0x00000200
#define _IEC1_C1IE_LENGTH                        0x00000001

#define _IEC1_INT3IE_POSITION                    0x0000000A
#define _IEC1_INT3IE_MASK                        0x00000400
#define _IEC1_INT3IE_LENGTH                      0x00000001

#define _IEC1_U2RXIE_POSITION                    0x0000000B
#define _IEC1_U2RXIE_MASK                        0x00000800
#define _IEC1_U2RXIE_LENGTH                      0x00000001

#define _IEC1_U2TXIE_POSITION                    0x0000000C
#define _IEC1_U2TXIE_MASK                        0x00001000
#define _IEC1_U2TXIE_LENGTH                      0x00000001

#define _IEC1_SPI2RXIE_POSITION                  0x0000000D
#define _IEC1_SPI2RXIE_MASK                      0x00002000
#define _IEC1_SPI2RXIE_LENGTH                    0x00000001

#define _IEC1_SPI2TXIE_POSITION                  0x0000000E
#define _IEC1_SPI2TXIE_MASK                      0x00004000
#define _IEC1_SPI2TXIE_LENGTH                    0x00000001

#define _IEC1_C1RXIE_POSITION                    0x0000000F
#define _IEC1_C1RXIE_MASK                        0x00008000
#define _IEC1_C1RXIE_LENGTH                      0x00000001

#define _IEC2_CCP3IE_POSITION                    0x00000003
#define _IEC2_CCP3IE_MASK                        0x00000008
#define _IEC2_CCP3IE_LENGTH                      0x00000001

#define _IEC2_CCT3IE_POSITION                    0x00000004
#define _IEC2_CCT3IE_MASK                        0x00000010
#define _IEC2_CCT3IE_LENGTH                      0x00000001

#define _IEC2_SI2C2IE_POSITION                   0x00000005
#define _IEC2_SI2C2IE_MASK                       0x00000020
#define _IEC2_SI2C2IE_LENGTH                     0x00000001

#define _IEC2_MI2C2IE_POSITION                   0x00000006
#define _IEC2_MI2C2IE_MASK                       0x00000040
#define _IEC2_MI2C2IE_LENGTH                     0x00000001

#define _IEC2_CCP4IE_POSITION                    0x00000008
#define _IEC2_CCP4IE_MASK                        0x00000100
#define _IEC2_CCP4IE_LENGTH                      0x00000001

#define _IEC2_CCT4IE_POSITION                    0x00000009
#define _IEC2_CCT4IE_MASK                        0x00000200
#define _IEC2_CCT4IE_LENGTH                      0x00000001

#define _IEC2_CCP5IE_POSITION                    0x0000000B
#define _IEC2_CCP5IE_MASK                        0x00000800
#define _IEC2_CCP5IE_LENGTH                      0x00000001

#define _IEC2_CCT5IE_POSITION                    0x0000000C
#define _IEC2_CCT5IE_MASK                        0x00001000
#define _IEC2_CCT5IE_LENGTH                      0x00000001

#define _IEC2_DMTIE_POSITION                     0x0000000D
#define _IEC2_DMTIE_MASK                         0x00002000
#define _IEC2_DMTIE_LENGTH                       0x00000001

#define _IEC2_CCP6IE_POSITION                    0x0000000E
#define _IEC2_CCP6IE_MASK                        0x00004000
#define _IEC2_CCP6IE_LENGTH                      0x00000001

#define _IEC2_CCT6IE_POSITION                    0x0000000F
#define _IEC2_CCT6IE_MASK                        0x00008000
#define _IEC2_CCT6IE_LENGTH                      0x00000001

#define _IEC3_QEI1IE_POSITION                    0x00000000
#define _IEC3_QEI1IE_MASK                        0x00000001
#define _IEC3_QEI1IE_LENGTH                      0x00000001

