gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
#define _IEC3_U1EIE_POSITION                     0x00000001
#define _IEC3_U1EIE_MASK                         0x00000002
#define _IEC3_U1EIE_LENGTH                       0x00000001

#define _IEC3_U2EIE_POSITION                     0x00000002
#define _IEC3_U2EIE_MASK                         0x00000004
#define _IEC3_U2EIE_LENGTH                       0x00000001

#define _IEC3_CRCIE_POSITION                     0x00000003
#define _IEC3_CRCIE_MASK                         0x00000008
#define _IEC3_CRCIE_LENGTH                       0x00000001

#define _IEC3_C1TXIE_POSITION                    0x00000004
#define _IEC3_C1TXIE_MASK                        0x00000010
#define _IEC3_C1TXIE_LENGTH                      0x00000001

#define _IEC3_QEI2IE_POSITION                    0x00000006
#define _IEC3_QEI2IE_MASK                        0x00000040
#define _IEC3_QEI2IE_LENGTH                      0x00000001

#define _IEC3_U3EIE_POSITION                     0x00000008
#define _IEC3_U3EIE_MASK                         0x00000100
#define _IEC3_U3EIE_LENGTH                       0x00000001

#define _IEC3_U3RXIE_POSITION                    0x00000009
#define _IEC3_U3RXIE_MASK                        0x00000200
#define _IEC3_U3RXIE_LENGTH                      0x00000001

#define _IEC3_U3TXIE_POSITION                    0x0000000A
#define _IEC3_U3TXIE_MASK                        0x00000400
#define _IEC3_U3TXIE_LENGTH                      0x00000001

#define _IEC3_SPI3RXIE_POSITION                  0x0000000B
#define _IEC3_SPI3RXIE_MASK                      0x00000800
#define _IEC3_SPI3RXIE_LENGTH                    0x00000001

#define _IEC3_SPI3TXIE_POSITION                  0x0000000C
#define _IEC3_SPI3TXIE_MASK                      0x00001000
#define _IEC3_SPI3TXIE_LENGTH                    0x00000001

#define _IEC3_JTAGIE_POSITION                    0x0000000E
#define _IEC3_JTAGIE_MASK                        0x00004000
#define _IEC3_JTAGIE_LENGTH                      0x00000001

#define _IEC3_PTGSTEPIE_POSITION                 0x0000000F
#define _IEC3_PTGSTEPIE_MASK                     0x00008000
#define _IEC3_PTGSTEPIE_LENGTH                   0x00000001

#define _IEC4_I2C1BCIE_POSITION                  0x00000000
#define _IEC4_I2C1BCIE_MASK                      0x00000001
#define _IEC4_I2C1BCIE_LENGTH                    0x00000001

#define _IEC4_I2C2BCIE_POSITION                  0x00000001
#define _IEC4_I2C2BCIE_MASK                      0x00000002
#define _IEC4_I2C2BCIE_LENGTH                    0x00000001

#define _IEC4_PWM1IE_POSITION                    0x00000003
#define _IEC4_PWM1IE_MASK                        0x00000008
#define _IEC4_PWM1IE_LENGTH                      0x00000001

#define _IEC4_PWM2IE_POSITION                    0x00000004
#define _IEC4_PWM2IE_MASK                        0x00000010
#define _IEC4_PWM2IE_LENGTH                      0x00000001

#define _IEC4_PWM3IE_POSITION                    0x00000005
#define _IEC4_PWM3IE_MASK                        0x00000020
#define _IEC4_PWM3IE_LENGTH                      0x00000001

#define _IEC4_PWM4IE_POSITION                    0x00000006
#define _IEC4_PWM4IE_MASK                        0x00000040
#define _IEC4_PWM4IE_LENGTH                      0x00000001

#define _IEC4_PWM5IE_POSITION                    0x00000007
#define _IEC4_PWM5IE_MASK                        0x00000080
#define _IEC4_PWM5IE_LENGTH                      0x00000001

#define _IEC4_PWM6IE_POSITION                    0x00000008
#define _IEC4_PWM6IE_MASK                        0x00000100
#define _IEC4_PWM6IE_LENGTH                      0x00000001

#define _IEC4_PWM7IE_POSITION                    0x00000009
#define _IEC4_PWM7IE_MASK                        0x00000200
#define _IEC4_PWM7IE_LENGTH                      0x00000001

#define _IEC4_PWM8IE_POSITION                    0x0000000A
#define _IEC4_PWM8IE_MASK                        0x00000400
#define _IEC4_PWM8IE_LENGTH                      0x00000001

#define _IEC4_CNDIE_POSITION                     0x0000000B
#define _IEC4_CNDIE_MASK                         0x00000800
#define _IEC4_CNDIE_LENGTH                       0x00000001

#define _IEC4_CMP1IE_POSITION                    0x0000000D
#define _IEC4_CMP1IE_MASK                        0x00002000
#define _IEC4_CMP1IE_LENGTH                      0x00000001

#define _IEC4_CMP2IE_POSITION                    0x0000000E
#define _IEC4_CMP2IE_MASK                        0x00004000
#define _IEC4_CMP2IE_LENGTH                      0x00000001

#define _IEC4_CMP3IE_POSITION                    0x0000000F
#define _IEC4_CMP3IE_MASK                        0x00008000
#define _IEC4_CMP3IE_LENGTH                      0x00000001

#define _IEC5_PTGWDTIE_POSITION                  0x00000001
#define _IEC5_PTGWDTIE_MASK                      0x00000002
#define _IEC5_PTGWDTIE_LENGTH                    0x00000001

#define _IEC5_PTG0IE_POSITION                    0x00000002
#define _IEC5_PTG0IE_MASK                        0x00000004
#define _IEC5_PTG0IE_LENGTH                      0x00000001

#define _IEC5_PTG1IE_POSITION                    0x00000003
#define _IEC5_PTG1IE_MASK                        0x00000008
#define _IEC5_PTG1IE_LENGTH                      0x00000001

#define _IEC5_PTG2IE_POSITION                    0x00000004
#define _IEC5_PTG2IE_MASK                        0x00000010
#define _IEC5_PTG2IE_LENGTH                      0x00000001

#define _IEC5_PTG3IE_POSITION                    0x00000005
#define _IEC5_PTG3IE_MASK                        0x00000020
#define _IEC5_PTG3IE_LENGTH                      0x00000001

#define _IEC5_SENT1IE_POSITION                   0x00000006
#define _IEC5_SENT1IE_MASK                       0x00000040
#define _IEC5_SENT1IE_LENGTH                     0x00000001

#define _IEC5_SENT1EIE_POSITION                  0x00000007
#define _IEC5_SENT1EIE_MASK                      0x00000080
#define _IEC5_SENT1EIE_LENGTH                    0x00000001

#define _IEC5_SENT2IE_POSITION                   0x00000008
#define _IEC5_SENT2IE_MASK                       0x00000100
#define _IEC5_SENT2IE_LENGTH                     0x00000001

#define _IEC5_SENT2EIE_POSITION                  0x00000009
#define _IEC5_SENT2EIE_MASK                      0x00000200
#define _IEC5_SENT2EIE_LENGTH                    0x00000001

#define _IEC5_ADCIE_POSITION                     0x0000000A
#define _IEC5_ADCIE_MASK                         0x00000400
#define _IEC5_ADCIE_LENGTH                       0x00000001

#define _IEC5_ADCAN0IE_POSITION                  0x0000000B
#define _IEC5_ADCAN0IE_MASK                      0x00000800
#define _IEC5_ADCAN0IE_LENGTH                    0x00000001

#define _IEC5_ADCAN1IE_POSITION                  0x0000000C
#define _IEC5_ADCAN1IE_MASK                      0x00001000
#define _IEC5_ADCAN1IE_LENGTH                    0x00000001

