gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
#define _IEC9_CCP8IE_POSITION                    0x00000008
#define _IEC9_CCP8IE_MASK                        0x00000100
#define _IEC9_CCP8IE_LENGTH                      0x00000001

#define _IEC9_CCT8IE_POSITION                    0x00000009
#define _IEC9_CCT8IE_MASK                        0x00000200
#define _IEC9_CCT8IE_LENGTH                      0x00000001

#define _IEC10_ADC0EIE_POSITION                  0x00000000
#define _IEC10_ADC0EIE_MASK                      0x00000001
#define _IEC10_ADC0EIE_LENGTH                    0x00000001

#define _IEC10_ADC1EIE_POSITION                  0x00000001
#define _IEC10_ADC1EIE_MASK                      0x00000002
#define _IEC10_ADC1EIE_LENGTH                    0x00000001

#define _IEC10_ADFIFOIE_POSITION                 0x00000008
#define _IEC10_ADFIFOIE_MASK                     0x00000100
#define _IEC10_ADFIFOIE_LENGTH                   0x00000001

#define _IEC10_PEVTAIE_POSITION                  0x00000009
#define _IEC10_PEVTAIE_MASK                      0x00000200
#define _IEC10_PEVTAIE_LENGTH                    0x00000001

#define _IEC10_PEVTBIE_POSITION                  0x0000000A
#define _IEC10_PEVTBIE_MASK                      0x00000400
#define _IEC10_PEVTBIE_LENGTH                    0x00000001

#define _IEC10_PEVTCIE_POSITION                  0x0000000B
#define _IEC10_PEVTCIE_MASK                      0x00000800
#define _IEC10_PEVTCIE_LENGTH                    0x00000001

#define _IEC10_PEVTDIE_POSITION                  0x0000000C
#define _IEC10_PEVTDIE_MASK                      0x00001000
#define _IEC10_PEVTDIE_LENGTH                    0x00000001

#define _IEC10_PEVTEIE_POSITION                  0x0000000D
#define _IEC10_PEVTEIE_MASK                      0x00002000
#define _IEC10_PEVTEIE_LENGTH                    0x00000001

#define _IEC10_PEVTFIE_POSITION                  0x0000000E
#define _IEC10_PEVTFIE_MASK                      0x00004000
#define _IEC10_PEVTFIE_LENGTH                    0x00000001

#define _IEC10_CLC3PIE_POSITION                  0x0000000F
#define _IEC10_CLC3PIE_MASK                      0x00008000
#define _IEC10_CLC3PIE_LENGTH                    0x00000001

#define _IEC11_CLC4PIE_POSITION                  0x00000000
#define _IEC11_CLC4PIE_MASK                      0x00000001
#define _IEC11_CLC4PIE_LENGTH                    0x00000001

#define _IEC11_CLC1NIE_POSITION                  0x00000001
#define _IEC11_CLC1NIE_MASK                      0x00000002
#define _IEC11_CLC1NIE_LENGTH                    0x00000001

#define _IEC11_CLC2NIE_POSITION                  0x00000002
#define _IEC11_CLC2NIE_MASK                      0x00000004
#define _IEC11_CLC2NIE_LENGTH                    0x00000001

#define _IEC11_CLC3NIE_POSITION                  0x00000003
#define _IEC11_CLC3NIE_MASK                      0x00000008
#define _IEC11_CLC3NIE_LENGTH                    0x00000001

#define _IEC11_CLC4NIE_POSITION                  0x00000004
#define _IEC11_CLC4NIE_MASK                      0x00000010
#define _IEC11_CLC4NIE_LENGTH                    0x00000001

#define _IEC11_CCP9IE_POSITION                   0x00000005
#define _IEC11_CCP9IE_MASK                       0x00000020
#define _IEC11_CCP9IE_LENGTH                     0x00000001

#define _IEC11_CCT9IE_POSITION                   0x00000006
#define _IEC11_CCT9IE_MASK                       0x00000040
#define _IEC11_CCT9IE_LENGTH                     0x00000001

#define _IEC11_U1EVTIE_POSITION                  0x0000000D
#define _IEC11_U1EVTIE_MASK                      0x00002000
#define _IEC11_U1EVTIE_LENGTH                    0x00000001

#define _IEC11_U2EVTIE_POSITION                  0x0000000E
#define _IEC11_U2EVTIE_MASK                      0x00004000
#define _IEC11_U2EVTIE_LENGTH                    0x00000001

#define _IEC11_U3EVTIE_POSITION                  0x0000000F
#define _IEC11_U3EVTIE_MASK                      0x00008000
#define _IEC11_U3EVTIE_LENGTH                    0x00000001

#define _IEC12_ADCAN24IE_POSITION                0x00000000
#define _IEC12_ADCAN24IE_MASK                    0x00000001
#define _IEC12_ADCAN24IE_LENGTH                  0x00000001

#define _IEC12_ADCAN25IE_POSITION                0x00000001
#define _IEC12_ADCAN25IE_MASK                    0x00000002
#define _IEC12_ADCAN25IE_LENGTH                  0x00000001

#define _IPC0_INT0IP_POSITION                    0x00000000
#define _IPC0_INT0IP_MASK                        0x00000007
#define _IPC0_INT0IP_LENGTH                      0x00000003

#define _IPC0_T1IP_POSITION                      0x00000004
#define _IPC0_T1IP_MASK                          0x00000070
#define _IPC0_T1IP_LENGTH                        0x00000003

#define _IPC0_CNAIP_POSITION                     0x00000008
#define _IPC0_CNAIP_MASK                         0x00000700
#define _IPC0_CNAIP_LENGTH                       0x00000003

#define _IPC0_CNBIP_POSITION                     0x0000000C
#define _IPC0_CNBIP_MASK                         0x00007000
#define _IPC0_CNBIP_LENGTH                       0x00000003

#define _IPC1_DMA0IP_POSITION                    0x00000000
#define _IPC1_DMA0IP_MASK                        0x00000007
#define _IPC1_DMA0IP_LENGTH                      0x00000003

#define _IPC1_CCP1IP_POSITION                    0x00000008
#define _IPC1_CCP1IP_MASK                        0x00000700
#define _IPC1_CCP1IP_LENGTH                      0x00000003

#define _IPC1_CCT1IP_POSITION                    0x0000000C
#define _IPC1_CCT1IP_MASK                        0x00007000
#define _IPC1_CCT1IP_LENGTH                      0x00000003

#define _IPC2_DMA1IP_POSITION                    0x00000000
#define _IPC2_DMA1IP_MASK                        0x00000007
#define _IPC2_DMA1IP_LENGTH                      0x00000003

#define _IPC2_SPI1RXIP_POSITION                  0x00000004
#define _IPC2_SPI1RXIP_MASK                      0x00000070
#define _IPC2_SPI1RXIP_LENGTH                    0x00000003

#define _IPC2_SPI1TXIP_POSITION                  0x00000008
#define _IPC2_SPI1TXIP_MASK                      0x00000700
#define _IPC2_SPI1TXIP_LENGTH                    0x00000003

#define _IPC2_U1RXIP_POSITION                    0x0000000C
#define _IPC2_U1RXIP_MASK                        0x00007000
#define _IPC2_U1RXIP_LENGTH                      0x00000003

#define _IPC3_U1TXIP_POSITION                    0x00000000
#define _IPC3_U1TXIP_MASK                        0x00000007
#define _IPC3_U1TXIP_LENGTH                      0x00000003

