gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
#define _IPC3_ECCSBEIP_POSITION                  0x00000004
#define _IPC3_ECCSBEIP_MASK                      0x00000070
#define _IPC3_ECCSBEIP_LENGTH                    0x00000003

#define _IPC3_NVMIP_POSITION                     0x00000008
#define _IPC3_NVMIP_MASK                         0x00000700
#define _IPC3_NVMIP_LENGTH                       0x00000003

#define _IPC3_INT1IP_POSITION                    0x0000000C
#define _IPC3_INT1IP_MASK                        0x00007000
#define _IPC3_INT1IP_LENGTH                      0x00000003

#define _IPC4_SI2C1IP_POSITION                   0x00000000
#define _IPC4_SI2C1IP_MASK                       0x00000007
#define _IPC4_SI2C1IP_LENGTH                     0x00000003

#define _IPC4_MI2C1IP_POSITION                   0x00000004
#define _IPC4_MI2C1IP_MASK                       0x00000070
#define _IPC4_MI2C1IP_LENGTH                     0x00000003

#define _IPC4_DMA2IP_POSITION                    0x00000008
#define _IPC4_DMA2IP_MASK                        0x00000700
#define _IPC4_DMA2IP_LENGTH                      0x00000003

#define _IPC4_CNCIP_POSITION                     0x0000000C
#define _IPC4_CNCIP_MASK                         0x00007000
#define _IPC4_CNCIP_LENGTH                       0x00000003

#define _IPC5_INT2IP_POSITION                    0x00000000
#define _IPC5_INT2IP_MASK                        0x00000007
#define _IPC5_INT2IP_LENGTH                      0x00000003

#define _IPC5_DMA3IP_POSITION                    0x00000004
#define _IPC5_DMA3IP_MASK                        0x00000070
#define _IPC5_DMA3IP_LENGTH                      0x00000003

#define _IPC5_CCP2IP_POSITION                    0x0000000C
#define _IPC5_CCP2IP_MASK                        0x00007000
#define _IPC5_CCP2IP_LENGTH                      0x00000003

#define _IPC6_CCT2IP_POSITION                    0x00000000
#define _IPC6_CCT2IP_MASK                        0x00000007
#define _IPC6_CCT2IP_LENGTH                      0x00000003

#define _IPC6_C1IP_POSITION                      0x00000004
#define _IPC6_C1IP_MASK                          0x00000070
#define _IPC6_C1IP_LENGTH                        0x00000003

#define _IPC6_INT3IP_POSITION                    0x00000008
#define _IPC6_INT3IP_MASK                        0x00000700
#define _IPC6_INT3IP_LENGTH                      0x00000003

#define _IPC6_U2RXIP_POSITION                    0x0000000C
#define _IPC6_U2RXIP_MASK                        0x00007000
#define _IPC6_U2RXIP_LENGTH                      0x00000003

#define _IPC7_U2TXIP_POSITION                    0x00000000
#define _IPC7_U2TXIP_MASK                        0x00000007
#define _IPC7_U2TXIP_LENGTH                      0x00000003

#define _IPC7_SPI2RXIP_POSITION                  0x00000004
#define _IPC7_SPI2RXIP_MASK                      0x00000070
#define _IPC7_SPI2RXIP_LENGTH                    0x00000003

#define _IPC7_SPI2TXIP_POSITION                  0x00000008
#define _IPC7_SPI2TXIP_MASK                      0x00000700
#define _IPC7_SPI2TXIP_LENGTH                    0x00000003

#define _IPC7_C1RXIP_POSITION                    0x0000000C
#define _IPC7_C1RXIP_MASK                        0x00007000
#define _IPC7_C1RXIP_LENGTH                      0x00000003

#define _IPC8_CCP3IP_POSITION                    0x0000000C
#define _IPC8_CCP3IP_MASK                        0x00007000
#define _IPC8_CCP3IP_LENGTH                      0x00000003

#define _IPC9_CCT3IP_POSITION                    0x00000000
#define _IPC9_CCT3IP_MASK                        0x00000007
#define _IPC9_CCT3IP_LENGTH                      0x00000003

#define _IPC9_SI2C2IP_POSITION                   0x00000004
#define _IPC9_SI2C2IP_MASK                       0x00000070
#define _IPC9_SI2C2IP_LENGTH                     0x00000003

#define _IPC9_MI2C2IP_POSITION                   0x00000008
#define _IPC9_MI2C2IP_MASK                       0x00000700
#define _IPC9_MI2C2IP_LENGTH                     0x00000003

#define _IPC10_CCP4IP_POSITION                   0x00000000
#define _IPC10_CCP4IP_MASK                       0x00000007
#define _IPC10_CCP4IP_LENGTH                     0x00000003

#define _IPC10_CCT4IP_POSITION                   0x00000004
#define _IPC10_CCT4IP_MASK                       0x00000070
#define _IPC10_CCT4IP_LENGTH                     0x00000003

#define _IPC10_CCP5IP_POSITION                   0x0000000C
#define _IPC10_CCP5IP_MASK                       0x00007000
#define _IPC10_CCP5IP_LENGTH                     0x00000003

#define _IPC11_CCT5IP_POSITION                   0x00000000
#define _IPC11_CCT5IP_MASK                       0x00000007
#define _IPC11_CCT5IP_LENGTH                     0x00000003

#define _IPC11_DMTIP_POSITION                    0x00000004
#define _IPC11_DMTIP_MASK                        0x00000070
#define _IPC11_DMTIP_LENGTH                      0x00000003

#define _IPC11_CCP6IP_POSITION                   0x00000008
#define _IPC11_CCP6IP_MASK                       0x00000700
#define _IPC11_CCP6IP_LENGTH                     0x00000003

#define _IPC11_CCT6IP_POSITION                   0x0000000C
#define _IPC11_CCT6IP_MASK                       0x00007000
#define _IPC11_CCT6IP_LENGTH                     0x00000003

#define _IPC12_QEI1IP_POSITION                   0x00000000
#define _IPC12_QEI1IP_MASK                       0x00000007
#define _IPC12_QEI1IP_LENGTH                     0x00000003

#define _IPC12_U1EIP_POSITION                    0x00000004
#define _IPC12_U1EIP_MASK                        0x00000070
#define _IPC12_U1EIP_LENGTH                      0x00000003

#define _IPC12_U2EIP_POSITION                    0x00000008
#define _IPC12_U2EIP_MASK                        0x00000700
#define _IPC12_U2EIP_LENGTH                      0x00000003

#define _IPC12_CRCIP_POSITION                    0x0000000C
#define _IPC12_CRCIP_MASK                        0x00007000
#define _IPC12_CRCIP_LENGTH                      0x00000003

#define _IPC13_C1TXIP_POSITION                   0x00000000
#define _IPC13_C1TXIP_MASK                       0x00000007
#define _IPC13_C1TXIP_LENGTH                     0x00000003

#define _IPC13_QEI2IP_POSITION                   0x00000008
#define _IPC13_QEI2IP_MASK                       0x00000700
#define _IPC13_QEI2IP_LENGTH                     0x00000003

