gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
#define _IPC14_U3EIP_POSITION                    0x00000000
#define _IPC14_U3EIP_MASK                        0x00000007
#define _IPC14_U3EIP_LENGTH                      0x00000003

#define _IPC14_U3RXIP_POSITION                   0x00000004
#define _IPC14_U3RXIP_MASK                       0x00000070
#define _IPC14_U3RXIP_LENGTH                     0x00000003

#define _IPC14_U3TXIP_POSITION                   0x00000008
#define _IPC14_U3TXIP_MASK                       0x00000700
#define _IPC14_U3TXIP_LENGTH                     0x00000003

#define _IPC14_SPI3RXIP_POSITION                 0x0000000C
#define _IPC14_SPI3RXIP_MASK                     0x00007000
#define _IPC14_SPI3RXIP_LENGTH                   0x00000003

#define _IPC15_SPI3TXIP_POSITION                 0x00000000
#define _IPC15_SPI3TXIP_MASK                     0x00000007
#define _IPC15_SPI3TXIP_LENGTH                   0x00000003

#define _IPC15_ICDIP_POSITION                    0x00000004
#define _IPC15_ICDIP_MASK                        0x00000070
#define _IPC15_ICDIP_LENGTH                      0x00000003

#define _IPC15_JTAGIP_POSITION                   0x00000008
#define _IPC15_JTAGIP_MASK                       0x00000700
#define _IPC15_JTAGIP_LENGTH                     0x00000003

#define _IPC15_PTGSTEPIP_POSITION                0x0000000C
#define _IPC15_PTGSTEPIP_MASK                    0x00007000
#define _IPC15_PTGSTEPIP_LENGTH                  0x00000003

#define _IPC16_I2C1BCIP_POSITION                 0x00000000
#define _IPC16_I2C1BCIP_MASK                     0x00000007
#define _IPC16_I2C1BCIP_LENGTH                   0x00000003

#define _IPC16_I2C2BCIP_POSITION                 0x00000004
#define _IPC16_I2C2BCIP_MASK                     0x00000070
#define _IPC16_I2C2BCIP_LENGTH                   0x00000003

#define _IPC16_PWM1IP_POSITION                   0x0000000C
#define _IPC16_PWM1IP_MASK                       0x00007000
#define _IPC16_PWM1IP_LENGTH                     0x00000003

#define _IPC17_PWM2IP_POSITION                   0x00000000
#define _IPC17_PWM2IP_MASK                       0x00000007
#define _IPC17_PWM2IP_LENGTH                     0x00000003

#define _IPC17_PWM3IP_POSITION                   0x00000004
#define _IPC17_PWM3IP_MASK                       0x00000070
#define _IPC17_PWM3IP_LENGTH                     0x00000003

#define _IPC17_PWM4IP_POSITION                   0x00000008
#define _IPC17_PWM4IP_MASK                       0x00000700
#define _IPC17_PWM4IP_LENGTH                     0x00000003

#define _IPC17_PWM5IP_POSITION                   0x0000000C
#define _IPC17_PWM5IP_MASK                       0x00007000
#define _IPC17_PWM5IP_LENGTH                     0x00000003

#define _IPC18_PWM6IP_POSITION                   0x00000000
#define _IPC18_PWM6IP_MASK                       0x00000007
#define _IPC18_PWM6IP_LENGTH                     0x00000003

#define _IPC18_PWM7IP_POSITION                   0x00000004
#define _IPC18_PWM7IP_MASK                       0x00000070
#define _IPC18_PWM7IP_LENGTH                     0x00000003

#define _IPC18_PWM8IP_POSITION                   0x00000008
#define _IPC18_PWM8IP_MASK                       0x00000700
#define _IPC18_PWM8IP_LENGTH                     0x00000003

#define _IPC18_CNDIP_POSITION                    0x0000000C
#define _IPC18_CNDIP_MASK                        0x00007000
#define _IPC18_CNDIP_LENGTH                      0x00000003

#define _IPC19_CMP1IP_POSITION                   0x00000004
#define _IPC19_CMP1IP_MASK                       0x00000070
#define _IPC19_CMP1IP_LENGTH                     0x00000003

#define _IPC19_CMP2IP_POSITION                   0x00000008
#define _IPC19_CMP2IP_MASK                       0x00000700
#define _IPC19_CMP2IP_LENGTH                     0x00000003

#define _IPC19_CMP3IP_POSITION                   0x0000000C
#define _IPC19_CMP3IP_MASK                       0x00007000
#define _IPC19_CMP3IP_LENGTH                     0x00000003

#define _IPC20_PTGWDTIP_POSITION                 0x00000004
#define _IPC20_PTGWDTIP_MASK                     0x00000070
#define _IPC20_PTGWDTIP_LENGTH                   0x00000003

#define _IPC20_PTG0IP_POSITION                   0x00000008
#define _IPC20_PTG0IP_MASK                       0x00000700
#define _IPC20_PTG0IP_LENGTH                     0x00000003

#define _IPC20_PTG1IP_POSITION                   0x0000000C
#define _IPC20_PTG1IP_MASK                       0x00007000
#define _IPC20_PTG1IP_LENGTH                     0x00000003

#define _IPC21_PTG2IP_POSITION                   0x00000000
#define _IPC21_PTG2IP_MASK                       0x00000007
#define _IPC21_PTG2IP_LENGTH                     0x00000003

#define _IPC21_PTG3IP_POSITION                   0x00000004
#define _IPC21_PTG3IP_MASK                       0x00000070
#define _IPC21_PTG3IP_LENGTH                     0x00000003

#define _IPC21_SENT1IP_POSITION                  0x00000008
#define _IPC21_SENT1IP_MASK                      0x00000700
#define _IPC21_SENT1IP_LENGTH                    0x00000003

#define _IPC21_SENT1EIP_POSITION                 0x0000000C
#define _IPC21_SENT1EIP_MASK                     0x00007000
#define _IPC21_SENT1EIP_LENGTH                   0x00000003

#define _IPC22_SENT2IP_POSITION                  0x00000000
#define _IPC22_SENT2IP_MASK                      0x00000007
#define _IPC22_SENT2IP_LENGTH                    0x00000003

#define _IPC22_SENT2EIP_POSITION                 0x00000004
#define _IPC22_SENT2EIP_MASK                     0x00000070
#define _IPC22_SENT2EIP_LENGTH                   0x00000003

#define _IPC22_ADCIP_POSITION                    0x00000008
#define _IPC22_ADCIP_MASK                        0x00000700
#define _IPC22_ADCIP_LENGTH                      0x00000003

#define _IPC22_ADCAN0IP_POSITION                 0x0000000C
#define _IPC22_ADCAN0IP_MASK                     0x00007000
#define _IPC22_ADCAN0IP_LENGTH                   0x00000003

#define _IPC23_ADCAN1IP_POSITION                 0x00000000
#define _IPC23_ADCAN1IP_MASK                     0x00000007
#define _IPC23_ADCAN1IP_LENGTH                   0x00000003

#define _IPC23_ADCAN2IP_POSITION                 0x00000004
#define _IPC23_ADCAN2IP_MASK                     0x00000070
#define _IPC23_ADCAN2IP_LENGTH                   0x00000003

