gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
#define _IPC23_ADCAN3IP_POSITION                 0x00000008
#define _IPC23_ADCAN3IP_MASK                     0x00000700
#define _IPC23_ADCAN3IP_LENGTH                   0x00000003

#define _IPC23_ADCAN4IP_POSITION                 0x0000000C
#define _IPC23_ADCAN4IP_MASK                     0x00007000
#define _IPC23_ADCAN4IP_LENGTH                   0x00000003

#define _IPC24_ADCAN5IP_POSITION                 0x00000000
#define _IPC24_ADCAN5IP_MASK                     0x00000007
#define _IPC24_ADCAN5IP_LENGTH                   0x00000003

#define _IPC24_ADCAN6IP_POSITION                 0x00000004
#define _IPC24_ADCAN6IP_MASK                     0x00000070
#define _IPC24_ADCAN6IP_LENGTH                   0x00000003

#define _IPC24_ADCAN7IP_POSITION                 0x00000008
#define _IPC24_ADCAN7IP_MASK                     0x00000700
#define _IPC24_ADCAN7IP_LENGTH                   0x00000003

#define _IPC24_ADCAN8IP_POSITION                 0x0000000C
#define _IPC24_ADCAN8IP_MASK                     0x00007000
#define _IPC24_ADCAN8IP_LENGTH                   0x00000003

#define _IPC25_ADCAN9IP_POSITION                 0x00000000
#define _IPC25_ADCAN9IP_MASK                     0x00000007
#define _IPC25_ADCAN9IP_LENGTH                   0x00000003

#define _IPC25_ADCAN10IP_POSITION                0x00000004
#define _IPC25_ADCAN10IP_MASK                    0x00000070
#define _IPC25_ADCAN10IP_LENGTH                  0x00000003

#define _IPC25_ADCAN11IP_POSITION                0x00000008
#define _IPC25_ADCAN11IP_MASK                    0x00000700
#define _IPC25_ADCAN11IP_LENGTH                  0x00000003

#define _IPC25_ADCAN12IP_POSITION                0x0000000C
#define _IPC25_ADCAN12IP_MASK                    0x00007000
#define _IPC25_ADCAN12IP_LENGTH                  0x00000003

#define _IPC26_ADCAN13IP_POSITION                0x00000000
#define _IPC26_ADCAN13IP_MASK                    0x00000007
#define _IPC26_ADCAN13IP_LENGTH                  0x00000003

#define _IPC26_ADCAN14IP_POSITION                0x00000004
#define _IPC26_ADCAN14IP_MASK                    0x00000070
#define _IPC26_ADCAN14IP_LENGTH                  0x00000003

#define _IPC26_ADCAN15IP_POSITION                0x00000008
#define _IPC26_ADCAN15IP_MASK                    0x00000700
#define _IPC26_ADCAN15IP_LENGTH                  0x00000003

#define _IPC26_ADCAN16IP_POSITION                0x0000000C
#define _IPC26_ADCAN16IP_MASK                    0x00007000
#define _IPC26_ADCAN16IP_LENGTH                  0x00000003

#define _IPC27_ADCAN17IP_POSITION                0x00000000
#define _IPC27_ADCAN17IP_MASK                    0x00000007
#define _IPC27_ADCAN17IP_LENGTH                  0x00000003

#define _IPC27_ADCAN18IP_POSITION                0x00000004
#define _IPC27_ADCAN18IP_MASK                    0x00000070
#define _IPC27_ADCAN18IP_LENGTH                  0x00000003

#define _IPC28_ADFLTIP_POSITION                  0x0000000C
#define _IPC28_ADFLTIP_MASK                      0x00007000
#define _IPC28_ADFLTIP_LENGTH                    0x00000003

#define _IPC29_ADCMP0IP_POSITION                 0x00000000
#define _IPC29_ADCMP0IP_MASK                     0x00000007
#define _IPC29_ADCMP0IP_LENGTH                   0x00000003

#define _IPC29_ADCMP1IP_POSITION                 0x00000004
#define _IPC29_ADCMP1IP_MASK                     0x00000070
#define _IPC29_ADCMP1IP_LENGTH                   0x00000003

#define _IPC29_ADCMP2IP_POSITION                 0x00000008
#define _IPC29_ADCMP2IP_MASK                     0x00000700
#define _IPC29_ADCMP2IP_LENGTH                   0x00000003

#define _IPC29_ADCMP3IP_POSITION                 0x0000000C
#define _IPC29_ADCMP3IP_MASK                     0x00007000
#define _IPC29_ADCMP3IP_LENGTH                   0x00000003

#define _IPC30_ADFLTR0IP_POSITION                0x00000000
#define _IPC30_ADFLTR0IP_MASK                    0x00000007
#define _IPC30_ADFLTR0IP_LENGTH                  0x00000003

#define _IPC30_ADFLTR1IP_POSITION                0x00000004
#define _IPC30_ADFLTR1IP_MASK                    0x00000070
#define _IPC30_ADFLTR1IP_LENGTH                  0x00000003

#define _IPC30_ADFLTR2IP_POSITION                0x00000008
#define _IPC30_ADFLTR2IP_MASK                    0x00000700
#define _IPC30_ADFLTR2IP_LENGTH                  0x00000003

#define _IPC30_ADFLTR3IP_POSITION                0x0000000C
#define _IPC30_ADFLTR3IP_MASK                    0x00007000
#define _IPC30_ADFLTR3IP_LENGTH                  0x00000003

#define _IPC31_CLC1PEIP_POSITION                 0x00000000
#define _IPC31_CLC1PEIP_MASK                     0x00000007
#define _IPC31_CLC1PEIP_LENGTH                   0x00000003

#define _IPC31_CLC2PEIP_POSITION                 0x00000004
#define _IPC31_CLC2PEIP_MASK                     0x00000070
#define _IPC31_CLC2PEIP_LENGTH                   0x00000003

#define _IPC31_SPI1IP_POSITION                   0x00000008
#define _IPC31_SPI1IP_MASK                       0x00000700
#define _IPC31_SPI1IP_LENGTH                     0x00000003

#define _IPC31_SPI2IP_POSITION                   0x0000000C
#define _IPC31_SPI2IP_MASK                       0x00007000
#define _IPC31_SPI2IP_LENGTH                     0x00000003

#define _IPC32_SPI3IP_POSITION                   0x00000000
#define _IPC32_SPI3IP_MASK                       0x00000007
#define _IPC32_SPI3IP_LENGTH                     0x00000003

#define _IPC35_SI2C3IP_POSITION                  0x00000008
#define _IPC35_SI2C3IP_MASK                      0x00000700
#define _IPC35_SI2C3IP_LENGTH                    0x00000003

#define _IPC35_MI2C3IP_POSITION                  0x0000000C
#define _IPC35_MI2C3IP_MASK                      0x00007000
#define _IPC35_MI2C3IP_LENGTH                    0x00000003

#define _IPC36_I2C3BCIP_POSITION                 0x00000000
#define _IPC36_I2C3BCIP_MASK                     0x00000007
#define _IPC36_I2C3BCIP_LENGTH                   0x00000003

#define _IPC37_CCP7IP_POSITION                   0x00000004
#define _IPC37_CCP7IP_MASK                       0x00000070
#define _IPC37_CCP7IP_LENGTH                     0x00000003

#define _IPC37_CCT7IP_POSITION                   0x00000008
#define _IPC37_CCT7IP_MASK                       0x00000700
#define _IPC37_CCT7IP_LENGTH                     0x00000003

