gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
#define _IPC38_CCP8IP_POSITION                   0x00000000
#define _IPC38_CCP8IP_MASK                       0x00000007
#define _IPC38_CCP8IP_LENGTH                     0x00000003

#define _IPC38_CCT8IP_POSITION                   0x00000004
#define _IPC38_CCT8IP_MASK                       0x00000070
#define _IPC38_CCT8IP_LENGTH                     0x00000003

#define _IPC40_ADC0EIP_POSITION                  0x00000000
#define _IPC40_ADC0EIP_MASK                      0x00000007
#define _IPC40_ADC0EIP_LENGTH                    0x00000003

#define _IPC40_ADC1EIP_POSITION                  0x00000004
#define _IPC40_ADC1EIP_MASK                      0x00000070
#define _IPC40_ADC1EIP_LENGTH                    0x00000003

#define _IPC42_ADFIFOIP_POSITION                 0x00000000
#define _IPC42_ADFIFOIP_MASK                     0x00000007
#define _IPC42_ADFIFOIP_LENGTH                   0x00000003

#define _IPC42_PEVTAIP_POSITION                  0x00000004
#define _IPC42_PEVTAIP_MASK                      0x00000070
#define _IPC42_PEVTAIP_LENGTH                    0x00000003

#define _IPC42_PEVTBIP_POSITION                  0x00000008
#define _IPC42_PEVTBIP_MASK                      0x00000700
#define _IPC42_PEVTBIP_LENGTH                    0x00000003

#define _IPC42_PEVTCIP_POSITION                  0x0000000C
#define _IPC42_PEVTCIP_MASK                      0x00007000
#define _IPC42_PEVTCIP_LENGTH                    0x00000003

#define _IPC43_PEVTDIP_POSITION                  0x00000000
#define _IPC43_PEVTDIP_MASK                      0x00000007
#define _IPC43_PEVTDIP_LENGTH                    0x00000003

#define _IPC43_PEVTEIP_POSITION                  0x00000004
#define _IPC43_PEVTEIP_MASK                      0x00000070
#define _IPC43_PEVTEIP_LENGTH                    0x00000003

#define _IPC43_PEVTFIP_POSITION                  0x00000008
#define _IPC43_PEVTFIP_MASK                      0x00000700
#define _IPC43_PEVTFIP_LENGTH                    0x00000003

#define _IPC43_CLC3PEIP_POSITION                 0x0000000C
#define _IPC43_CLC3PEIP_MASK                     0x00007000
#define _IPC43_CLC3PEIP_LENGTH                   0x00000003

#define _IPC44_CLC4PEIP_POSITION                 0x00000000
#define _IPC44_CLC4PEIP_MASK                     0x00000007
#define _IPC44_CLC4PEIP_LENGTH                   0x00000003

#define _IPC44_CLC1NEIP_POSITION                 0x00000004
#define _IPC44_CLC1NEIP_MASK                     0x00000070
#define _IPC44_CLC1NEIP_LENGTH                   0x00000003

#define _IPC44_CLC2NEIP_POSITION                 0x00000008
#define _IPC44_CLC2NEIP_MASK                     0x00000700
#define _IPC44_CLC2NEIP_LENGTH                   0x00000003

#define _IPC44_CLC3NEIP_POSITION                 0x0000000C
#define _IPC44_CLC3NEIP_MASK                     0x00007000
#define _IPC44_CLC3NEIP_LENGTH                   0x00000003

#define _IPC45_CLC4NEIP_POSITION                 0x00000000
#define _IPC45_CLC4NEIP_MASK                     0x00000007
#define _IPC45_CLC4NEIP_LENGTH                   0x00000003

#define _IPC45_CCP9IP_POSITION                   0x00000004
#define _IPC45_CCP9IP_MASK                       0x00000070
#define _IPC45_CCP9IP_LENGTH                     0x00000003

#define _IPC45_CCT9IP_POSITION                   0x00000008
#define _IPC45_CCT9IP_MASK                       0x00000700
#define _IPC45_CCT9IP_LENGTH                     0x00000003

#define _IPC47_U1EVTIP_POSITION                  0x00000004
#define _IPC47_U1EVTIP_MASK                      0x00000070
#define _IPC47_U1EVTIP_LENGTH                    0x00000003

#define _IPC47_U2EVTIP_POSITION                  0x00000008
#define _IPC47_U2EVTIP_MASK                      0x00000700
#define _IPC47_U2EVTIP_LENGTH                    0x00000003

#define _IPC47_U3EVTIP_POSITION                  0x0000000C
#define _IPC47_U3EVTIP_MASK                      0x00007000
#define _IPC47_U3EVTIP_LENGTH                    0x00000003

#define _IPC48_ADCAN24IP_POSITION                0x00000000
#define _IPC48_ADCAN24IP_MASK                    0x00000007
#define _IPC48_ADCAN24IP_LENGTH                  0x00000003

#define _IPC48_ADCAN25IP_POSITION                0x00000004
#define _IPC48_ADCAN25IP_MASK                    0x00000070
#define _IPC48_ADCAN25IP_LENGTH                  0x00000003

#define _INTCON1_OSCFAIL_POSITION                0x00000001
#define _INTCON1_OSCFAIL_MASK                    0x00000002
#define _INTCON1_OSCFAIL_LENGTH                  0x00000001

#define _INTCON1_STKERR_POSITION                 0x00000002
#define _INTCON1_STKERR_MASK                     0x00000004
#define _INTCON1_STKERR_LENGTH                   0x00000001

#define _INTCON1_ADDRERR_POSITION                0x00000003
#define _INTCON1_ADDRERR_MASK                    0x00000008
#define _INTCON1_ADDRERR_LENGTH                  0x00000001

#define _INTCON1_MATHERR_POSITION                0x00000004
#define _INTCON1_MATHERR_MASK                    0x00000010
#define _INTCON1_MATHERR_LENGTH                  0x00000001

#define _INTCON1_DIV0ERR_POSITION                0x00000006
#define _INTCON1_DIV0ERR_MASK                    0x00000040
#define _INTCON1_DIV0ERR_LENGTH                  0x00000001

#define _INTCON1_SFTACERR_POSITION               0x00000007
#define _INTCON1_SFTACERR_MASK                   0x00000080
#define _INTCON1_SFTACERR_LENGTH                 0x00000001

#define _INTCON1_COVTE_POSITION                  0x00000008
#define _INTCON1_COVTE_MASK                      0x00000100
#define _INTCON1_COVTE_LENGTH                    0x00000001

#define _INTCON1_OVBTE_POSITION                  0x00000009
#define _INTCON1_OVBTE_MASK                      0x00000200
#define _INTCON1_OVBTE_LENGTH                    0x00000001

#define _INTCON1_OVATE_POSITION                  0x0000000A
#define _INTCON1_OVATE_MASK                      0x00000400
#define _INTCON1_OVATE_LENGTH                    0x00000001

#define _INTCON1_COVBERR_POSITION                0x0000000B
#define _INTCON1_COVBERR_MASK                    0x00000800
#define _INTCON1_COVBERR_LENGTH                  0x00000001

#define _INTCON1_COVAERR_POSITION                0x0000000C
#define _INTCON1_COVAERR_MASK                    0x00001000
#define _INTCON1_COVAERR_LENGTH                  0x00000001

#define _INTCON1_OVBERR_POSITION                 0x0000000D
#define _INTCON1_OVBERR_MASK                     0x00002000
#define _INTCON1_OVBERR_LENGTH                   0x00000001

#define _INTCON1_OVAERR_POSITION                 0x0000000E
#define _INTCON1_OVAERR_MASK                     0x00004000
#define _INTCON1_OVAERR_LENGTH                   0x00000001

#define _INTCON1_NSTDIS_POSITION                 0x0000000F
#define _INTCON1_NSTDIS_MASK                     0x00008000
#define _INTCON1_NSTDIS_LENGTH                   0x00000001

