gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
#define _NVMCON_RPDF_POSITION                    0x00000009
#define _NVMCON_RPDF_MASK                        0x00000200
#define _NVMCON_RPDF_LENGTH                      0x00000001

#define _NVMCON_P2ACTIV_POSITION                 0x0000000A
#define _NVMCON_P2ACTIV_MASK                     0x00000400
#define _NVMCON_P2ACTIV_LENGTH                   0x00000001

#define _NVMCON_SFTSWP_POSITION                  0x0000000B
#define _NVMCON_SFTSWP_MASK                      0x00000800
#define _NVMCON_SFTSWP_LENGTH                    0x00000001

#define _NVMCON_NVMSIDL_POSITION                 0x0000000C
#define _NVMCON_NVMSIDL_MASK                     0x00001000
#define _NVMCON_NVMSIDL_LENGTH                   0x00000001

#define _NVMCON_WRERR_POSITION                   0x0000000D
#define _NVMCON_WRERR_MASK                       0x00002000
#define _NVMCON_WRERR_LENGTH                     0x00000001

#define _NVMCON_WREN_POSITION                    0x0000000E
#define _NVMCON_WREN_MASK                        0x00004000
#define _NVMCON_WREN_LENGTH                      0x00000001

#define _NVMCON_WR_POSITION                      0x0000000F
#define _NVMCON_WR_MASK                          0x00008000
#define _NVMCON_WR_LENGTH                        0x00000001

#define _NVMCON_NVMOP0_POSITION                  0x00000000
#define _NVMCON_NVMOP0_MASK                      0x00000001
#define _NVMCON_NVMOP0_LENGTH                    0x00000001

#define _NVMCON_NVMOP1_POSITION                  0x00000001
#define _NVMCON_NVMOP1_MASK                      0x00000002
#define _NVMCON_NVMOP1_LENGTH                    0x00000001

#define _NVMCON_NVMOP2_POSITION                  0x00000002
#define _NVMCON_NVMOP2_MASK                      0x00000004
#define _NVMCON_NVMOP2_LENGTH                    0x00000001

#define _NVMCON_NVMOP3_POSITION                  0x00000003
#define _NVMCON_NVMOP3_MASK                      0x00000008
#define _NVMCON_NVMOP3_LENGTH                    0x00000001

#define _NVMADR_NVMADRL_POSITION                 0x00000001
#define _NVMADR_NVMADRL_MASK                     0x0000FFFE
#define _NVMADR_NVMADRL_LENGTH                   0x0000000F

#define _NVMADR_NVMADR_POSITION                  0x00000001
#define _NVMADR_NVMADR_MASK                      0x0000FFFE
#define _NVMADR_NVMADR_LENGTH                    0x0000000F

#define _NVMADRL_NVMADRL_POSITION                0x00000001
#define _NVMADRL_NVMADRL_MASK                    0x0000FFFE
#define _NVMADRL_NVMADRL_LENGTH                  0x0000000F

#define _NVMADRL_NVMADR_POSITION                 0x00000001
#define _NVMADRL_NVMADR_MASK                     0x0000FFFE
#define _NVMADRL_NVMADR_LENGTH                   0x0000000F

#define _NVMADRH_NVMADRH_POSITION                0x00000000
#define _NVMADRH_NVMADRH_MASK                    0x000000FF
#define _NVMADRH_NVMADRH_LENGTH                  0x00000008

#define _NVMADRH_NVMADRU_POSITION                0x00000000
#define _NVMADRH_NVMADRU_MASK                    0x000000FF
#define _NVMADRH_NVMADRU_LENGTH                  0x00000008

#define _NVMADRU_NVMADRH_POSITION                0x00000000
#define _NVMADRU_NVMADRH_MASK                    0x000000FF
#define _NVMADRU_NVMADRH_LENGTH                  0x00000008

#define _NVMADRU_NVMADRU_POSITION                0x00000000
#define _NVMADRU_NVMADRU_MASK                    0x000000FF
#define _NVMADRU_NVMADRU_LENGTH                  0x00000008

#define _NVMSRCADDR_NVMSRCADRL_POSITION          0x00000001
#define _NVMSRCADDR_NVMSRCADRL_MASK              0x0000FFFE
#define _NVMSRCADDR_NVMSRCADRL_LENGTH            0x0000000F

#define _NVMSRCADR_NVMSRCADRL_POSITION           0x00000001
#define _NVMSRCADR_NVMSRCADRL_MASK               0x0000FFFE
#define _NVMSRCADR_NVMSRCADRL_LENGTH             0x0000000F

#define _NVMSRCADRL_NVMSRCADRL_POSITION          0x00000001
#define _NVMSRCADRL_NVMSRCADRL_MASK              0x0000FFFE
#define _NVMSRCADRL_NVMSRCADRL_LENGTH            0x0000000F

#define _NVMSRCADRH_NVMSRCADRH_POSITION          0x00000000
#define _NVMSRCADRH_NVMSRCADRH_MASK              0x000000FF
#define _NVMSRCADRH_NVMSRCADRH_LENGTH            0x00000008

#define _AMPCON1L_AMPEN1_POSITION                0x00000000
#define _AMPCON1L_AMPEN1_MASK                    0x00000001
#define _AMPCON1L_AMPEN1_LENGTH                  0x00000001

#define _AMPCON1L_AMPEN2_POSITION                0x00000001
#define _AMPCON1L_AMPEN2_MASK                    0x00000002
#define _AMPCON1L_AMPEN2_LENGTH                  0x00000001

#define _AMPCON1L_AMPEN3_POSITION                0x00000002
#define _AMPCON1L_AMPEN3_MASK                    0x00000004
#define _AMPCON1L_AMPEN3_LENGTH                  0x00000001

#define _AMPCON1L_AMPON_POSITION                 0x0000000F
#define _AMPCON1L_AMPON_MASK                     0x00008000
#define _AMPCON1L_AMPON_LENGTH                   0x00000001

#define _AMPCON1H_NCHDIS1_POSITION               0x00000000
#define _AMPCON1H_NCHDIS1_MASK                   0x00000001
#define _AMPCON1H_NCHDIS1_LENGTH                 0x00000001

#define _AMPCON1H_NCHDIS2_POSITION               0x00000001
#define _AMPCON1H_NCHDIS2_MASK                   0x00000002
#define _AMPCON1H_NCHDIS2_LENGTH                 0x00000001

#define _AMPCON1H_NCHDIS3_POSITION               0x00000002
#define _AMPCON1H_NCHDIS3_MASK                   0x00000004
#define _AMPCON1H_NCHDIS3_LENGTH                 0x00000001

#define _BIASCON_I10EN0_POSITION                 0x00000000
#define _BIASCON_I10EN0_MASK                     0x00000001
#define _BIASCON_I10EN0_LENGTH                   0x00000001

#define _BIASCON_I10EN1_POSITION                 0x00000001
#define _BIASCON_I10EN1_MASK                     0x00000002
#define _BIASCON_I10EN1_LENGTH                   0x00000001

#define _BIASCON_I10EN2_POSITION                 0x00000002
#define _BIASCON_I10EN2_MASK                     0x00000004
#define _BIASCON_I10EN2_LENGTH                   0x00000001

#define _BIASCON_I10EN3_POSITION                 0x00000003
#define _BIASCON_I10EN3_MASK                     0x00000008
#define _BIASCON_I10EN3_LENGTH                   0x00000001

#define _BIASCON_ON_POSITION                     0x0000000F
#define _BIASCON_ON_MASK                         0x00008000
#define _BIASCON_ON_LENGTH                       0x00000001

#define _IBIASCONL_SNKEN0_POSITION               0x00000000
#define _IBIASCONL_SNKEN0_MASK                   0x00000001
#define _IBIASCONL_SNKEN0_LENGTH                 0x00000001

#define _IBIASCONL_SRCEN0_POSITION               0x00000001
#define _IBIASCONL_SRCEN0_MASK                   0x00000002
#define _IBIASCONL_SRCEN0_LENGTH                 0x00000001

#define _IBIASCONL_GENSNKEN0_POSITION            0x00000002
#define _IBIASCONL_GENSNKEN0_MASK                0x00000004
#define _IBIASCONL_GENSNKEN0_LENGTH              0x00000001

#define _IBIASCONL_GENSRCEN0_POSITION            0x00000003
#define _IBIASCONL_GENSRCEN0_MASK                0x00000008
#define _IBIASCONL_GENSRCEN0_LENGTH              0x00000001

