gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
#define _IBIASCONL_SHRSNKEN0_POSITION            0x00000004
#define _IBIASCONL_SHRSNKEN0_MASK                0x00000010
#define _IBIASCONL_SHRSNKEN0_LENGTH              0x00000001

#define _IBIASCONL_SHRSRCEN0_POSITION            0x00000005
#define _IBIASCONL_SHRSRCEN0_MASK                0x00000020
#define _IBIASCONL_SHRSRCEN0_LENGTH              0x00000001

#define _IBIASCONL_SNKEN1_POSITION               0x00000008
#define _IBIASCONL_SNKEN1_MASK                   0x00000100
#define _IBIASCONL_SNKEN1_LENGTH                 0x00000001

#define _IBIASCONL_SRCEN1_POSITION               0x00000009
#define _IBIASCONL_SRCEN1_MASK                   0x00000200
#define _IBIASCONL_SRCEN1_LENGTH                 0x00000001

#define _IBIASCONL_GENSNKEN1_POSITION            0x0000000A
#define _IBIASCONL_GENSNKEN1_MASK                0x00000400
#define _IBIASCONL_GENSNKEN1_LENGTH              0x00000001

#define _IBIASCONL_GENSRCEN1_POSITION            0x0000000B
#define _IBIASCONL_GENSRCEN1_MASK                0x00000800
#define _IBIASCONL_GENSRCEN1_LENGTH              0x00000001

#define _IBIASCONL_SHRSNKEN1_POSITION            0x0000000C
#define _IBIASCONL_SHRSNKEN1_MASK                0x00001000
#define _IBIASCONL_SHRSNKEN1_LENGTH              0x00000001

#define _IBIASCONL_SHRSRCEN1_POSITION            0x0000000D
#define _IBIASCONL_SHRSRCEN1_MASK                0x00002000
#define _IBIASCONL_SHRSRCEN1_LENGTH              0x00000001

#define _IBIASCONH_SNKEN2_POSITION               0x00000000
#define _IBIASCONH_SNKEN2_MASK                   0x00000001
#define _IBIASCONH_SNKEN2_LENGTH                 0x00000001

#define _IBIASCONH_SRCEN2_POSITION               0x00000001
#define _IBIASCONH_SRCEN2_MASK                   0x00000002
#define _IBIASCONH_SRCEN2_LENGTH                 0x00000001

#define _IBIASCONH_GENSNKEN2_POSITION            0x00000002
#define _IBIASCONH_GENSNKEN2_MASK                0x00000004
#define _IBIASCONH_GENSNKEN2_LENGTH              0x00000001

#define _IBIASCONH_GENSRCEN2_POSITION            0x00000003
#define _IBIASCONH_GENSRCEN2_MASK                0x00000008
#define _IBIASCONH_GENSRCEN2_LENGTH              0x00000001

#define _IBIASCONH_SHRSNKEN2_POSITION            0x00000004
#define _IBIASCONH_SHRSNKEN2_MASK                0x00000010
#define _IBIASCONH_SHRSNKEN2_LENGTH              0x00000001

#define _IBIASCONH_SHRSRCEN2_POSITION            0x00000005
#define _IBIASCONH_SHRSRCEN2_MASK                0x00000020
#define _IBIASCONH_SHRSRCEN2_LENGTH              0x00000001

#define _IBIASCONH_SNKEN3_POSITION               0x00000008
#define _IBIASCONH_SNKEN3_MASK                   0x00000100
#define _IBIASCONH_SNKEN3_LENGTH                 0x00000001

#define _IBIASCONH_SRCEN3_POSITION               0x00000009
#define _IBIASCONH_SRCEN3_MASK                   0x00000200
#define _IBIASCONH_SRCEN3_LENGTH                 0x00000001

#define _IBIASCONH_GENSNKEN3_POSITION            0x0000000A
#define _IBIASCONH_GENSNKEN3_MASK                0x00000400
#define _IBIASCONH_GENSNKEN3_LENGTH              0x00000001

#define _IBIASCONH_GENSRCEN3_POSITION            0x0000000B
#define _IBIASCONH_GENSRCEN3_MASK                0x00000800
#define _IBIASCONH_GENSRCEN3_LENGTH              0x00000001

#define _IBIASCONH_SHRSNKEN3_POSITION            0x0000000C
#define _IBIASCONH_SHRSNKEN3_MASK                0x00001000
#define _IBIASCONH_SHRSNKEN3_LENGTH              0x00000001

#define _IBIASCONH_SHRSRCEN3_POSITION            0x0000000D
#define _IBIASCONH_SHRSRCEN3_MASK                0x00002000
#define _IBIASCONH_SHRSRCEN3_LENGTH              0x00000001

#define _PTGCST_PTGITM_POSITION                  0x00000000
#define _PTGCST_PTGITM_MASK                      0x00000003
#define _PTGCST_PTGITM_LENGTH                    0x00000002

#define _PTGCST_PTGBUSY_POSITION                 0x00000005
#define _PTGCST_PTGBUSY_MASK                     0x00000020
#define _PTGCST_PTGBUSY_LENGTH                   0x00000001

#define _PTGCST_PTGWTO_POSITION                  0x00000006
#define _PTGCST_PTGWTO_MASK                      0x00000040
#define _PTGCST_PTGWTO_LENGTH                    0x00000001

#define _PTGCST_PTGSTRT_POSITION                 0x00000007
#define _PTGCST_PTGSTRT_MASK                     0x00000080
#define _PTGCST_PTGSTRT_LENGTH                   0x00000001

#define _PTGCST_PTGIVIS_POSITION                 0x00000008
#define _PTGCST_PTGIVIS_MASK                     0x00000100
#define _PTGCST_PTGIVIS_LENGTH                   0x00000001

#define _PTGCST_PTGSSEN_POSITION                 0x00000009
#define _PTGCST_PTGSSEN_MASK                     0x00000200
#define _PTGCST_PTGSSEN_LENGTH                   0x00000001

#define _PTGCST_PTGSWT_POSITION                  0x0000000A
#define _PTGCST_PTGSWT_MASK                      0x00000400
#define _PTGCST_PTGSWT_LENGTH                    0x00000001

#define _PTGCST_PTGTOGL_POSITION                 0x0000000C
#define _PTGCST_PTGTOGL_MASK                     0x00001000
#define _PTGCST_PTGTOGL_LENGTH                   0x00000001

#define _PTGCST_PTGSIDL_POSITION                 0x0000000D
#define _PTGCST_PTGSIDL_MASK                     0x00002000
#define _PTGCST_PTGSIDL_LENGTH                   0x00000001

#define _PTGCST_PTGEN_POSITION                   0x0000000F
#define _PTGCST_PTGEN_MASK                       0x00008000
#define _PTGCST_PTGEN_LENGTH                     0x00000001

#define _PTGCON_PTGWDT_POSITION                  0x00000000
#define _PTGCON_PTGWDT_MASK                      0x00000007
#define _PTGCON_PTGWDT_LENGTH                    0x00000003

#define _PTGCON_PTGPWD_POSITION                  0x00000004
#define _PTGCON_PTGPWD_MASK                      0x000000F0
#define _PTGCON_PTGPWD_LENGTH                    0x00000004

#define _PTGCON_PTGDIV_POSITION                  0x00000008
#define _PTGCON_PTGDIV_MASK                      0x00001F00
#define _PTGCON_PTGDIV_LENGTH                    0x00000005

#define _PTGCON_PTGCLK_POSITION                  0x0000000D
#define _PTGCON_PTGCLK_MASK                      0x0000E000
#define _PTGCON_PTGCLK_LENGTH                    0x00000003

