gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
#define _PTGBTE_PTGBTE0_POSITION                 0x00000000
#define _PTGBTE_PTGBTE0_MASK                     0x00000001
#define _PTGBTE_PTGBTE0_LENGTH                   0x00000001

#define _PTGBTE_PTGBTE1_POSITION                 0x00000001
#define _PTGBTE_PTGBTE1_MASK                     0x00000002
#define _PTGBTE_PTGBTE1_LENGTH                   0x00000001

#define _PTGBTE_PTGBTE2_POSITION                 0x00000002
#define _PTGBTE_PTGBTE2_MASK                     0x00000004
#define _PTGBTE_PTGBTE2_LENGTH                   0x00000001

#define _PTGBTE_PTGBTE3_POSITION                 0x00000003
#define _PTGBTE_PTGBTE3_MASK                     0x00000008
#define _PTGBTE_PTGBTE3_LENGTH                   0x00000001

#define _PTGBTE_PTGBTE4_POSITION                 0x00000004
#define _PTGBTE_PTGBTE4_MASK                     0x00000010
#define _PTGBTE_PTGBTE4_LENGTH                   0x00000001

#define _PTGBTE_PTGBTE5_POSITION                 0x00000005
#define _PTGBTE_PTGBTE5_MASK                     0x00000020
#define _PTGBTE_PTGBTE5_LENGTH                   0x00000001

#define _PTGBTE_PTGBTE6_POSITION                 0x00000006
#define _PTGBTE_PTGBTE6_MASK                     0x00000040
#define _PTGBTE_PTGBTE6_LENGTH                   0x00000001

#define _PTGBTE_PTGBTE7_POSITION                 0x00000007
#define _PTGBTE_PTGBTE7_MASK                     0x00000080
#define _PTGBTE_PTGBTE7_LENGTH                   0x00000001

#define _PTGBTE_PTGBTE8_POSITION                 0x00000008
#define _PTGBTE_PTGBTE8_MASK                     0x00000100
#define _PTGBTE_PTGBTE8_LENGTH                   0x00000001

#define _PTGBTE_PTGBTE9_POSITION                 0x00000009
#define _PTGBTE_PTGBTE9_MASK                     0x00000200
#define _PTGBTE_PTGBTE9_LENGTH                   0x00000001

#define _PTGBTE_PTGBTE10_POSITION                0x0000000A
#define _PTGBTE_PTGBTE10_MASK                    0x00000400
#define _PTGBTE_PTGBTE10_LENGTH                  0x00000001

#define _PTGBTE_PTGBTE11_POSITION                0x0000000B
#define _PTGBTE_PTGBTE11_MASK                    0x00000800
#define _PTGBTE_PTGBTE11_LENGTH                  0x00000001

#define _PTGBTE_PTGBTE12_POSITION                0x0000000C
#define _PTGBTE_PTGBTE12_MASK                    0x00001000
#define _PTGBTE_PTGBTE12_LENGTH                  0x00000001

#define _PTGBTE_PTGBTE13_POSITION                0x0000000D
#define _PTGBTE_PTGBTE13_MASK                    0x00002000
#define _PTGBTE_PTGBTE13_LENGTH                  0x00000001

#define _PTGBTE_PTGBTE14_POSITION                0x0000000E
#define _PTGBTE_PTGBTE14_MASK                    0x00004000
#define _PTGBTE_PTGBTE14_LENGTH                  0x00000001

#define _PTGBTE_PTGBTE15_POSITION                0x0000000F
#define _PTGBTE_PTGBTE15_MASK                    0x00008000
#define _PTGBTE_PTGBTE15_LENGTH                  0x00000001

#define _PTGBTEH_PTGBTE16_POSITION               0x00000000
#define _PTGBTEH_PTGBTE16_MASK                   0x00000001
#define _PTGBTEH_PTGBTE16_LENGTH                 0x00000001

#define _PTGBTEH_PTGBTE17_POSITION               0x00000001
#define _PTGBTEH_PTGBTE17_MASK                   0x00000002
#define _PTGBTEH_PTGBTE17_LENGTH                 0x00000001

#define _PTGBTEH_PTGBTE18_POSITION               0x00000002
#define _PTGBTEH_PTGBTE18_MASK                   0x00000004
#define _PTGBTEH_PTGBTE18_LENGTH                 0x00000001

#define _PTGBTEH_PTGBTE19_POSITION               0x00000003
#define _PTGBTEH_PTGBTE19_MASK                   0x00000008
#define _PTGBTEH_PTGBTE19_LENGTH                 0x00000001

#define _PTGBTEH_PTGBTE20_POSITION               0x00000004
#define _PTGBTEH_PTGBTE20_MASK                   0x00000010
#define _PTGBTEH_PTGBTE20_LENGTH                 0x00000001

#define _PTGBTEH_PTGBTE21_POSITION               0x00000005
#define _PTGBTEH_PTGBTE21_MASK                   0x00000020
#define _PTGBTEH_PTGBTE21_LENGTH                 0x00000001

#define _PTGBTEH_PTGBTE22_POSITION               0x00000006
#define _PTGBTEH_PTGBTE22_MASK                   0x00000040
#define _PTGBTEH_PTGBTE22_LENGTH                 0x00000001

#define _PTGBTEH_PTGBTE23_POSITION               0x00000007
#define _PTGBTEH_PTGBTE23_MASK                   0x00000080
#define _PTGBTEH_PTGBTE23_LENGTH                 0x00000001

#define _PTGBTEH_PTGBTE24_POSITION               0x00000008
#define _PTGBTEH_PTGBTE24_MASK                   0x00000100
#define _PTGBTEH_PTGBTE24_LENGTH                 0x00000001

#define _PTGBTEH_PTGBTE25_POSITION               0x00000009
#define _PTGBTEH_PTGBTE25_MASK                   0x00000200
#define _PTGBTEH_PTGBTE25_LENGTH                 0x00000001

#define _PTGBTEH_PTGBTE26_POSITION               0x0000000A
#define _PTGBTEH_PTGBTE26_MASK                   0x00000400
#define _PTGBTEH_PTGBTE26_LENGTH                 0x00000001

#define _PTGBTEH_PTGBTE27_POSITION               0x0000000B
#define _PTGBTEH_PTGBTE27_MASK                   0x00000800
#define _PTGBTEH_PTGBTE27_LENGTH                 0x00000001

#define _PTGBTEH_PTGBTE28_POSITION               0x0000000C
#define _PTGBTEH_PTGBTE28_MASK                   0x00001000
#define _PTGBTEH_PTGBTE28_LENGTH                 0x00000001

#define _PTGBTEH_PTGBTE29_POSITION               0x0000000D
#define _PTGBTEH_PTGBTE29_MASK                   0x00002000
#define _PTGBTEH_PTGBTE29_LENGTH                 0x00000001

#define _PTGBTEH_PTGBTE30_POSITION               0x0000000E
#define _PTGBTEH_PTGBTE30_MASK                   0x00004000
#define _PTGBTEH_PTGBTE30_LENGTH                 0x00000001

#define _PTGBTEH_PTGBTE31_POSITION               0x0000000F
#define _PTGBTEH_PTGBTE31_MASK                   0x00008000
#define _PTGBTEH_PTGBTE31_LENGTH                 0x00000001

#define _PTGQPTR_PTGQPTR_POSITION                0x00000000
#define _PTGQPTR_PTGQPTR_MASK                    0x0000001F
#define _PTGQPTR_PTGQPTR_LENGTH                  0x00000005

#define _PTGQUE0_STEP0_POSITION                  0x00000000
#define _PTGQUE0_STEP0_MASK                      0x000000FF
#define _PTGQUE0_STEP0_LENGTH                    0x00000008

#define _PTGQUE0_STEP1_POSITION                  0x00000008
#define _PTGQUE0_STEP1_MASK                      0x0000FF00
#define _PTGQUE0_STEP1_LENGTH                    0x00000008

#define _PTGQUE1_STEP2_POSITION                  0x00000000
#define _PTGQUE1_STEP2_MASK                      0x000000FF
#define _PTGQUE1_STEP2_LENGTH                    0x00000008

#define _PTGQUE1_STEP3_POSITION                  0x00000008
#define _PTGQUE1_STEP3_MASK                      0x0000FF00
#define _PTGQUE1_STEP3_LENGTH                    0x00000008

#define _PTGQUE2_STEP4_POSITION                  0x00000000
#define _PTGQUE2_STEP4_MASK                      0x000000FF
#define _PTGQUE2_STEP4_LENGTH                    0x00000008

#define _PTGQUE2_STEP5_POSITION                  0x00000008
#define _PTGQUE2_STEP5_MASK                      0x0000FF00
#define _PTGQUE2_STEP5_LENGTH                    0x00000008

#define _PTGQUE3_STEP6_POSITION                  0x00000000
#define _PTGQUE3_STEP6_MASK                      0x000000FF
#define _PTGQUE3_STEP6_LENGTH                    0x00000008

#define _PTGQUE3_STEP7_POSITION                  0x00000008
#define _PTGQUE3_STEP7_MASK                      0x0000FF00
#define _PTGQUE3_STEP7_LENGTH                    0x00000008

#define _PTGQUE4_STEP8_POSITION                  0x00000000
#define _PTGQUE4_STEP8_MASK                      0x000000FF
#define _PTGQUE4_STEP8_LENGTH                    0x00000008

#define _PTGQUE4_STEP9_POSITION                  0x00000008
#define _PTGQUE4_STEP9_MASK                      0x0000FF00
#define _PTGQUE4_STEP9_LENGTH                    0x00000008

