gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
#define _PTGQUE5_STEP10_POSITION                 0x00000000
#define _PTGQUE5_STEP10_MASK                     0x000000FF
#define _PTGQUE5_STEP10_LENGTH                   0x00000008

#define _PTGQUE5_STEP11_POSITION                 0x00000008
#define _PTGQUE5_STEP11_MASK                     0x0000FF00
#define _PTGQUE5_STEP11_LENGTH                   0x00000008

#define _PTGQUE6_STEP12_POSITION                 0x00000000
#define _PTGQUE6_STEP12_MASK                     0x000000FF
#define _PTGQUE6_STEP12_LENGTH                   0x00000008

#define _PTGQUE6_STEP13_POSITION                 0x00000008
#define _PTGQUE6_STEP13_MASK                     0x0000FF00
#define _PTGQUE6_STEP13_LENGTH                   0x00000008

#define _PTGQUE7_STEP14_POSITION                 0x00000000
#define _PTGQUE7_STEP14_MASK                     0x000000FF
#define _PTGQUE7_STEP14_LENGTH                   0x00000008

#define _PTGQUE7_STEP15_POSITION                 0x00000008
#define _PTGQUE7_STEP15_MASK                     0x0000FF00
#define _PTGQUE7_STEP15_LENGTH                   0x00000008

#define _PTGQUE8_STEP16_POSITION                 0x00000000
#define _PTGQUE8_STEP16_MASK                     0x000000FF
#define _PTGQUE8_STEP16_LENGTH                   0x00000008

#define _PTGQUE8_STEP17_POSITION                 0x00000008
#define _PTGQUE8_STEP17_MASK                     0x0000FF00
#define _PTGQUE8_STEP17_LENGTH                   0x00000008

#define _PTGQUE9_STEP18_POSITION                 0x00000000
#define _PTGQUE9_STEP18_MASK                     0x000000FF
#define _PTGQUE9_STEP18_LENGTH                   0x00000008

#define _PTGQUE9_STEP19_POSITION                 0x00000008
#define _PTGQUE9_STEP19_MASK                     0x0000FF00
#define _PTGQUE9_STEP19_LENGTH                   0x00000008

#define _PTGQUE10_STEP20_POSITION                0x00000000
#define _PTGQUE10_STEP20_MASK                    0x000000FF
#define _PTGQUE10_STEP20_LENGTH                  0x00000008

#define _PTGQUE10_STEP21_POSITION                0x00000008
#define _PTGQUE10_STEP21_MASK                    0x0000FF00
#define _PTGQUE10_STEP21_LENGTH                  0x00000008

#define _PTGQUE11_STEP22_POSITION                0x00000000
#define _PTGQUE11_STEP22_MASK                    0x000000FF
#define _PTGQUE11_STEP22_LENGTH                  0x00000008

#define _PTGQUE11_STEP23_POSITION                0x00000008
#define _PTGQUE11_STEP23_MASK                    0x0000FF00
#define _PTGQUE11_STEP23_LENGTH                  0x00000008

#define _PTGQUE12_STEP24_POSITION                0x00000000
#define _PTGQUE12_STEP24_MASK                    0x000000FF
#define _PTGQUE12_STEP24_LENGTH                  0x00000008

#define _PTGQUE12_STEP25_POSITION                0x00000008
#define _PTGQUE12_STEP25_MASK                    0x0000FF00
#define _PTGQUE12_STEP25_LENGTH                  0x00000008

#define _PTGQUE13_STEP26_POSITION                0x00000000
#define _PTGQUE13_STEP26_MASK                    0x000000FF
#define _PTGQUE13_STEP26_LENGTH                  0x00000008

#define _PTGQUE13_STEP27_POSITION                0x00000008
#define _PTGQUE13_STEP27_MASK                    0x0000FF00
#define _PTGQUE13_STEP27_LENGTH                  0x00000008

#define _PTGQUE14_STEP28_POSITION                0x00000000
#define _PTGQUE14_STEP28_MASK                    0x000000FF
#define _PTGQUE14_STEP28_LENGTH                  0x00000008

#define _PTGQUE14_STEP29_POSITION                0x00000008
#define _PTGQUE14_STEP29_MASK                    0x0000FF00
#define _PTGQUE14_STEP29_LENGTH                  0x00000008

#define _PTGQUE15_STEP30_POSITION                0x00000000
#define _PTGQUE15_STEP30_MASK                    0x000000FF
#define _PTGQUE15_STEP30_LENGTH                  0x00000008

#define _PTGQUE15_STEP31_POSITION                0x00000008
#define _PTGQUE15_STEP31_MASK                    0x0000FF00
#define _PTGQUE15_STEP31_LENGTH                  0x00000008

#define _CCP1CON1L_MOD_POSITION                  0x00000000
#define _CCP1CON1L_MOD_MASK                      0x0000000F
#define _CCP1CON1L_MOD_LENGTH                    0x00000004

#define _CCP1CON1L_CCSEL_POSITION                0x00000004
#define _CCP1CON1L_CCSEL_MASK                    0x00000010
#define _CCP1CON1L_CCSEL_LENGTH                  0x00000001

#define _CCP1CON1L_T32_POSITION                  0x00000005
#define _CCP1CON1L_T32_MASK                      0x00000020
#define _CCP1CON1L_T32_LENGTH                    0x00000001

#define _CCP1CON1L_TMRPS_POSITION                0x00000006
#define _CCP1CON1L_TMRPS_MASK                    0x000000C0
#define _CCP1CON1L_TMRPS_LENGTH                  0x00000002

#define _CCP1CON1L_CLKSEL_POSITION               0x00000008
#define _CCP1CON1L_CLKSEL_MASK                   0x00000700
#define _CCP1CON1L_CLKSEL_LENGTH                 0x00000003

#define _CCP1CON1L_TMRSYNC_POSITION              0x0000000B
#define _CCP1CON1L_TMRSYNC_MASK                  0x00000800
#define _CCP1CON1L_TMRSYNC_LENGTH                0x00000001

#define _CCP1CON1L_CCPSLP_POSITION               0x0000000C
#define _CCP1CON1L_CCPSLP_MASK                   0x00001000
#define _CCP1CON1L_CCPSLP_LENGTH                 0x00000001

#define _CCP1CON1L_CCPSIDL_POSITION              0x0000000D
#define _CCP1CON1L_CCPSIDL_MASK                  0x00002000
#define _CCP1CON1L_CCPSIDL_LENGTH                0x00000001

#define _CCP1CON1L_CCPON_POSITION                0x0000000F
#define _CCP1CON1L_CCPON_MASK                    0x00008000
#define _CCP1CON1L_CCPON_LENGTH                  0x00000001

#define _CCP1CON1L_MOD0_POSITION                 0x00000000
#define _CCP1CON1L_MOD0_MASK                     0x00000001
#define _CCP1CON1L_MOD0_LENGTH                   0x00000001

#define _CCP1CON1L_MOD1_POSITION                 0x00000001
#define _CCP1CON1L_MOD1_MASK                     0x00000002
#define _CCP1CON1L_MOD1_LENGTH                   0x00000001

#define _CCP1CON1L_MOD2_POSITION                 0x00000002
#define _CCP1CON1L_MOD2_MASK                     0x00000004
#define _CCP1CON1L_MOD2_LENGTH                   0x00000001

#define _CCP1CON1L_MOD3_POSITION                 0x00000003
#define _CCP1CON1L_MOD3_MASK                     0x00000008
#define _CCP1CON1L_MOD3_LENGTH                   0x00000001

#define _CCP1CON1L_TMR32_POSITION                0x00000005
#define _CCP1CON1L_TMR32_MASK                    0x00000020
#define _CCP1CON1L_TMR32_LENGTH                  0x00000001

#define _CCP1CON1L_TMRPS0_POSITION               0x00000006
#define _CCP1CON1L_TMRPS0_MASK                   0x00000040
#define _CCP1CON1L_TMRPS0_LENGTH                 0x00000001

#define _CCP1CON1L_TMRPS1_POSITION               0x00000007
#define _CCP1CON1L_TMRPS1_MASK                   0x00000080
#define _CCP1CON1L_TMRPS1_LENGTH                 0x00000001

#define _CCP1CON1L_CLKSEL0_POSITION              0x00000008
#define _CCP1CON1L_CLKSEL0_MASK                  0x00000100
#define _CCP1CON1L_CLKSEL0_LENGTH                0x00000001

#define _CCP1CON1L_CLKSEL1_POSITION              0x00000009
#define _CCP1CON1L_CLKSEL1_MASK                  0x00000200
#define _CCP1CON1L_CLKSEL1_LENGTH                0x00000001

#define _CCP1CON1L_CLKSEL2_POSITION              0x0000000A
#define _CCP1CON1L_CLKSEL2_MASK                  0x00000400
#define _CCP1CON1L_CLKSEL2_LENGTH                0x00000001

