gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
#define _DMACH3_TRMODE1_POSITION                 0x00000003
#define _DMACH3_TRMODE1_MASK                     0x00000008
#define _DMACH3_TRMODE1_LENGTH                   0x00000001

#define _DMACH3_DAMODE0_POSITION                 0x00000004
#define _DMACH3_DAMODE0_MASK                     0x00000010
#define _DMACH3_DAMODE0_LENGTH                   0x00000001

#define _DMACH3_DAMODE1_POSITION                 0x00000005
#define _DMACH3_DAMODE1_MASK                     0x00000020
#define _DMACH3_DAMODE1_LENGTH                   0x00000001

#define _DMACH3_SAMODE0_POSITION                 0x00000006
#define _DMACH3_SAMODE0_MASK                     0x00000040
#define _DMACH3_SAMODE0_LENGTH                   0x00000001

#define _DMACH3_SAMODE1_POSITION                 0x00000007
#define _DMACH3_SAMODE1_MASK                     0x00000080
#define _DMACH3_SAMODE1_LENGTH                   0x00000001

#define _DMAINT3_HALFEN_POSITION                 0x00000000
#define _DMAINT3_HALFEN_MASK                     0x00000001
#define _DMAINT3_HALFEN_LENGTH                   0x00000001

#define _DMAINT3_OVRUNIF_POSITION                0x00000003
#define _DMAINT3_OVRUNIF_MASK                    0x00000008
#define _DMAINT3_OVRUNIF_LENGTH                  0x00000001

#define _DMAINT3_HALFIF_POSITION                 0x00000004
#define _DMAINT3_HALFIF_MASK                     0x00000010
#define _DMAINT3_HALFIF_LENGTH                   0x00000001

#define _DMAINT3_DONEIF_POSITION                 0x00000005
#define _DMAINT3_DONEIF_MASK                     0x00000020
#define _DMAINT3_DONEIF_LENGTH                   0x00000001

#define _DMAINT3_LOWIF_POSITION                  0x00000006
#define _DMAINT3_LOWIF_MASK                      0x00000040
#define _DMAINT3_LOWIF_LENGTH                    0x00000001

#define _DMAINT3_HIGHIF_POSITION                 0x00000007
#define _DMAINT3_HIGHIF_MASK                     0x00000080
#define _DMAINT3_HIGHIF_LENGTH                   0x00000001

#define _DMAINT3_CHSEL_POSITION                  0x00000008
#define _DMAINT3_CHSEL_MASK                      0x00007F00
#define _DMAINT3_CHSEL_LENGTH                    0x00000007

#define _DMAINT3_DBUFWF_POSITION                 0x0000000F
#define _DMAINT3_DBUFWF_MASK                     0x00008000
#define _DMAINT3_DBUFWF_LENGTH                   0x00000001

#define _DMAINT3_CHSEL0_POSITION                 0x00000008
#define _DMAINT3_CHSEL0_MASK                     0x00000100
#define _DMAINT3_CHSEL0_LENGTH                   0x00000001

#define _DMAINT3_CHSEL1_POSITION                 0x00000009
#define _DMAINT3_CHSEL1_MASK                     0x00000200
#define _DMAINT3_CHSEL1_LENGTH                   0x00000001

#define _DMAINT3_CHSEL2_POSITION                 0x0000000A
#define _DMAINT3_CHSEL2_MASK                     0x00000400
#define _DMAINT3_CHSEL2_LENGTH                   0x00000001

#define _DMAINT3_CHSEL3_POSITION                 0x0000000B
#define _DMAINT3_CHSEL3_MASK                     0x00000800
#define _DMAINT3_CHSEL3_LENGTH                   0x00000001

#define _DMAINT3_CHSEL4_POSITION                 0x0000000C
#define _DMAINT3_CHSEL4_MASK                     0x00001000
#define _DMAINT3_CHSEL4_LENGTH                   0x00000001

#define _DMAINT3_CHSEL5_POSITION                 0x0000000D
#define _DMAINT3_CHSEL5_MASK                     0x00002000
#define _DMAINT3_CHSEL5_LENGTH                   0x00000001

#define _DMAINT3_CHSEL6_POSITION                 0x0000000E
#define _DMAINT3_CHSEL6_MASK                     0x00004000
#define _DMAINT3_CHSEL6_LENGTH                   0x00000001

#define _ADCON1L_ADSIDL_POSITION                 0x0000000D
#define _ADCON1L_ADSIDL_MASK                     0x00002000
#define _ADCON1L_ADSIDL_LENGTH                   0x00000001

#define _ADCON1L_ADON_POSITION                   0x0000000F
#define _ADCON1L_ADON_MASK                       0x00008000
#define _ADCON1L_ADON_LENGTH                     0x00000001

#define _ADCON1H_SHRRES_POSITION                 0x00000005
#define _ADCON1H_SHRRES_MASK                     0x00000060
#define _ADCON1H_SHRRES_LENGTH                   0x00000002

#define _ADCON1H_FORM_POSITION                   0x00000007
#define _ADCON1H_FORM_MASK                       0x00000080
#define _ADCON1H_FORM_LENGTH                     0x00000001

#define _ADCON1H_SHRRES0_POSITION                0x00000005
#define _ADCON1H_SHRRES0_MASK                    0x00000020
#define _ADCON1H_SHRRES0_LENGTH                  0x00000001

#define _ADCON1H_SHRRES1_POSITION                0x00000006
#define _ADCON1H_SHRRES1_MASK                    0x00000040
#define _ADCON1H_SHRRES1_LENGTH                  0x00000001

#define _ADCON2L_SHRADCS_POSITION                0x00000000
#define _ADCON2L_SHRADCS_MASK                    0x0000007F
#define _ADCON2L_SHRADCS_LENGTH                  0x00000007

#define _ADCON2L_SHREISEL_POSITION               0x00000008
#define _ADCON2L_SHREISEL_MASK                   0x00000700
#define _ADCON2L_SHREISEL_LENGTH                 0x00000003

#define _ADCON2L_PTGEN_POSITION                  0x0000000B
#define _ADCON2L_PTGEN_MASK                      0x00000800
#define _ADCON2L_PTGEN_LENGTH                    0x00000001

#define _ADCON2L_EIEN_POSITION                   0x0000000C
#define _ADCON2L_EIEN_MASK                       0x00001000
#define _ADCON2L_EIEN_LENGTH                     0x00000001

#define _ADCON2L_REFERCIE_POSITION               0x0000000E
#define _ADCON2L_REFERCIE_MASK                   0x00004000
#define _ADCON2L_REFERCIE_LENGTH                 0x00000001

#define _ADCON2L_REFCIE_POSITION                 0x0000000F
#define _ADCON2L_REFCIE_MASK                     0x00008000
#define _ADCON2L_REFCIE_LENGTH                   0x00000001

#define _ADCON2L_SHRADCS0_POSITION               0x00000000
#define _ADCON2L_SHRADCS0_MASK                   0x00000001
#define _ADCON2L_SHRADCS0_LENGTH                 0x00000001

#define _ADCON2L_SHRADCS1_POSITION               0x00000001
#define _ADCON2L_SHRADCS1_MASK                   0x00000002
#define _ADCON2L_SHRADCS1_LENGTH                 0x00000001

