gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
#define _ADCON2L_SHRADCS2_POSITION               0x00000002
#define _ADCON2L_SHRADCS2_MASK                   0x00000004
#define _ADCON2L_SHRADCS2_LENGTH                 0x00000001

#define _ADCON2L_SHRADCS3_POSITION               0x00000003
#define _ADCON2L_SHRADCS3_MASK                   0x00000008
#define _ADCON2L_SHRADCS3_LENGTH                 0x00000001

#define _ADCON2L_SHRADCS4_POSITION               0x00000004
#define _ADCON2L_SHRADCS4_MASK                   0x00000010
#define _ADCON2L_SHRADCS4_LENGTH                 0x00000001

#define _ADCON2L_SHRADCS5_POSITION               0x00000005
#define _ADCON2L_SHRADCS5_MASK                   0x00000020
#define _ADCON2L_SHRADCS5_LENGTH                 0x00000001

#define _ADCON2L_SHRADCS6_POSITION               0x00000006
#define _ADCON2L_SHRADCS6_MASK                   0x00000040
#define _ADCON2L_SHRADCS6_LENGTH                 0x00000001

#define _ADCON2L_SHREISEL0_POSITION              0x00000008
#define _ADCON2L_SHREISEL0_MASK                  0x00000100
#define _ADCON2L_SHREISEL0_LENGTH                0x00000001

#define _ADCON2L_SHREISEL1_POSITION              0x00000009
#define _ADCON2L_SHREISEL1_MASK                  0x00000200
#define _ADCON2L_SHREISEL1_LENGTH                0x00000001

#define _ADCON2L_SHREISEL2_POSITION              0x0000000A
#define _ADCON2L_SHREISEL2_MASK                  0x00000400
#define _ADCON2L_SHREISEL2_LENGTH                0x00000001

#define _ADCON2H_SHRSAMC_POSITION                0x00000000
#define _ADCON2H_SHRSAMC_MASK                    0x000003FF
#define _ADCON2H_SHRSAMC_LENGTH                  0x0000000A

#define _ADCON2H_REFERR_POSITION                 0x0000000E
#define _ADCON2H_REFERR_MASK                     0x00004000
#define _ADCON2H_REFERR_LENGTH                   0x00000001

#define _ADCON2H_REFRDY_POSITION                 0x0000000F
#define _ADCON2H_REFRDY_MASK                     0x00008000
#define _ADCON2H_REFRDY_LENGTH                   0x00000001

#define _ADCON2H_SHRSAMC0_POSITION               0x00000000
#define _ADCON2H_SHRSAMC0_MASK                   0x00000001
#define _ADCON2H_SHRSAMC0_LENGTH                 0x00000001

#define _ADCON2H_SHRSAMC1_POSITION               0x00000001
#define _ADCON2H_SHRSAMC1_MASK                   0x00000002
#define _ADCON2H_SHRSAMC1_LENGTH                 0x00000001

#define _ADCON2H_SHRSAMC2_POSITION               0x00000002
#define _ADCON2H_SHRSAMC2_MASK                   0x00000004
#define _ADCON2H_SHRSAMC2_LENGTH                 0x00000001

#define _ADCON2H_SHRSAMC3_POSITION               0x00000003
#define _ADCON2H_SHRSAMC3_MASK                   0x00000008
#define _ADCON2H_SHRSAMC3_LENGTH                 0x00000001

#define _ADCON2H_SHRSAMC4_POSITION               0x00000004
#define _ADCON2H_SHRSAMC4_MASK                   0x00000010
#define _ADCON2H_SHRSAMC4_LENGTH                 0x00000001

#define _ADCON2H_SHRSAMC5_POSITION               0x00000005
#define _ADCON2H_SHRSAMC5_MASK                   0x00000020
#define _ADCON2H_SHRSAMC5_LENGTH                 0x00000001

#define _ADCON2H_SHRSAMC6_POSITION               0x00000006
#define _ADCON2H_SHRSAMC6_MASK                   0x00000040
#define _ADCON2H_SHRSAMC6_LENGTH                 0x00000001

#define _ADCON2H_SHRSAMC7_POSITION               0x00000007
#define _ADCON2H_SHRSAMC7_MASK                   0x00000080
#define _ADCON2H_SHRSAMC7_LENGTH                 0x00000001

#define _ADCON2H_SHRSAMC8_POSITION               0x00000008
#define _ADCON2H_SHRSAMC8_MASK                   0x00000100
#define _ADCON2H_SHRSAMC8_LENGTH                 0x00000001

#define _ADCON2H_SHRSAMC9_POSITION               0x00000009
#define _ADCON2H_SHRSAMC9_MASK                   0x00000200
#define _ADCON2H_SHRSAMC9_LENGTH                 0x00000001

#define _ADCON3L_CNVCHSEL_POSITION               0x00000000
#define _ADCON3L_CNVCHSEL_MASK                   0x0000003F
#define _ADCON3L_CNVCHSEL_LENGTH                 0x00000006

#define _ADCON3L_SWCTRG_POSITION                 0x00000006
#define _ADCON3L_SWCTRG_MASK                     0x00000040
#define _ADCON3L_SWCTRG_LENGTH                   0x00000001

#define _ADCON3L_SWLCTRG_POSITION                0x00000007
#define _ADCON3L_SWLCTRG_MASK                    0x00000080
#define _ADCON3L_SWLCTRG_LENGTH                  0x00000001

#define _ADCON3L_CNVRTCH_POSITION                0x00000008
#define _ADCON3L_CNVRTCH_MASK                    0x00000100
#define _ADCON3L_CNVRTCH_LENGTH                  0x00000001

#define _ADCON3L_SHRSAMP_POSITION                0x00000009
#define _ADCON3L_SHRSAMP_MASK                    0x00000200
#define _ADCON3L_SHRSAMP_LENGTH                  0x00000001

#define _ADCON3L_SUSPRDY_POSITION                0x0000000A
#define _ADCON3L_SUSPRDY_MASK                    0x00000400
#define _ADCON3L_SUSPRDY_LENGTH                  0x00000001

#define _ADCON3L_SUSPCIE_POSITION                0x0000000B
#define _ADCON3L_SUSPCIE_MASK                    0x00000800
#define _ADCON3L_SUSPCIE_LENGTH                  0x00000001

#define _ADCON3L_SUSPEND_POSITION                0x0000000C
#define _ADCON3L_SUSPEND_MASK                    0x00001000
#define _ADCON3L_SUSPEND_LENGTH                  0x00000001

#define _ADCON3L_REFSEL_POSITION                 0x0000000D
#define _ADCON3L_REFSEL_MASK                     0x0000E000
#define _ADCON3L_REFSEL_LENGTH                   0x00000003

#define _ADCON3L_CNVCHSEL0_POSITION              0x00000000
#define _ADCON3L_CNVCHSEL0_MASK                  0x00000001
#define _ADCON3L_CNVCHSEL0_LENGTH                0x00000001

#define _ADCON3L_CNVCHSEL1_POSITION              0x00000001
#define _ADCON3L_CNVCHSEL1_MASK                  0x00000002
#define _ADCON3L_CNVCHSEL1_LENGTH                0x00000001

#define _ADCON3L_CNVCHSEL2_POSITION              0x00000002
#define _ADCON3L_CNVCHSEL2_MASK                  0x00000004
#define _ADCON3L_CNVCHSEL2_LENGTH                0x00000001

#define _ADCON3L_CNVCHSEL3_POSITION              0x00000003
#define _ADCON3L_CNVCHSEL3_MASK                  0x00000008
#define _ADCON3L_CNVCHSEL3_LENGTH                0x00000001

