gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
#define _ADIEL_IE11_POSITION                     0x0000000B
#define _ADIEL_IE11_MASK                         0x00000800
#define _ADIEL_IE11_LENGTH                       0x00000001

#define _ADIEL_IE12_POSITION                     0x0000000C
#define _ADIEL_IE12_MASK                         0x00001000
#define _ADIEL_IE12_LENGTH                       0x00000001

#define _ADIEL_IE13_POSITION                     0x0000000D
#define _ADIEL_IE13_MASK                         0x00002000
#define _ADIEL_IE13_LENGTH                       0x00000001

#define _ADIEL_IE14_POSITION                     0x0000000E
#define _ADIEL_IE14_MASK                         0x00004000
#define _ADIEL_IE14_LENGTH                       0x00000001

#define _ADIEL_IE15_POSITION                     0x0000000F
#define _ADIEL_IE15_MASK                         0x00008000
#define _ADIEL_IE15_LENGTH                       0x00000001

#define _ADIEH_IE16_POSITION                     0x00000000
#define _ADIEH_IE16_MASK                         0x00000001
#define _ADIEH_IE16_LENGTH                       0x00000001

#define _ADIEH_IE17_POSITION                     0x00000001
#define _ADIEH_IE17_MASK                         0x00000002
#define _ADIEH_IE17_LENGTH                       0x00000001

#define _ADIEH_IE18_POSITION                     0x00000002
#define _ADIEH_IE18_MASK                         0x00000004
#define _ADIEH_IE18_LENGTH                       0x00000001

#define _ADIEH_IE24_POSITION                     0x00000008
#define _ADIEH_IE24_MASK                         0x00000100
#define _ADIEH_IE24_LENGTH                       0x00000001

#define _ADIEH_IE25_POSITION                     0x00000009
#define _ADIEH_IE25_MASK                         0x00000200
#define _ADIEH_IE25_LENGTH                       0x00000001

#define _ADSTATL_AN0RDY_POSITION                 0x00000000
#define _ADSTATL_AN0RDY_MASK                     0x00000001
#define _ADSTATL_AN0RDY_LENGTH                   0x00000001

#define _ADSTATL_AN1RDY_POSITION                 0x00000001
#define _ADSTATL_AN1RDY_MASK                     0x00000002
#define _ADSTATL_AN1RDY_LENGTH                   0x00000001

#define _ADSTATL_AN2RDY_POSITION                 0x00000002
#define _ADSTATL_AN2RDY_MASK                     0x00000004
#define _ADSTATL_AN2RDY_LENGTH                   0x00000001

#define _ADSTATL_AN3RDY_POSITION                 0x00000003
#define _ADSTATL_AN3RDY_MASK                     0x00000008
#define _ADSTATL_AN3RDY_LENGTH                   0x00000001

#define _ADSTATL_AN4RDY_POSITION                 0x00000004
#define _ADSTATL_AN4RDY_MASK                     0x00000010
#define _ADSTATL_AN4RDY_LENGTH                   0x00000001

#define _ADSTATL_AN5RDY_POSITION                 0x00000005
#define _ADSTATL_AN5RDY_MASK                     0x00000020
#define _ADSTATL_AN5RDY_LENGTH                   0x00000001

#define _ADSTATL_AN6RDY_POSITION                 0x00000006
#define _ADSTATL_AN6RDY_MASK                     0x00000040
#define _ADSTATL_AN6RDY_LENGTH                   0x00000001

#define _ADSTATL_AN7RDY_POSITION                 0x00000007
#define _ADSTATL_AN7RDY_MASK                     0x00000080
#define _ADSTATL_AN7RDY_LENGTH                   0x00000001

#define _ADSTATL_AN8RDY_POSITION                 0x00000008
#define _ADSTATL_AN8RDY_MASK                     0x00000100
#define _ADSTATL_AN8RDY_LENGTH                   0x00000001

#define _ADSTATL_AN9RDY_POSITION                 0x00000009
#define _ADSTATL_AN9RDY_MASK                     0x00000200
#define _ADSTATL_AN9RDY_LENGTH                   0x00000001

#define _ADSTATL_AN10RDY_POSITION                0x0000000A
#define _ADSTATL_AN10RDY_MASK                    0x00000400
#define _ADSTATL_AN10RDY_LENGTH                  0x00000001

#define _ADSTATL_AN11RDY_POSITION                0x0000000B
#define _ADSTATL_AN11RDY_MASK                    0x00000800
#define _ADSTATL_AN11RDY_LENGTH                  0x00000001

#define _ADSTATL_AN12RDY_POSITION                0x0000000C
#define _ADSTATL_AN12RDY_MASK                    0x00001000
#define _ADSTATL_AN12RDY_LENGTH                  0x00000001

#define _ADSTATL_AN13RDY_POSITION                0x0000000D
#define _ADSTATL_AN13RDY_MASK                    0x00002000
#define _ADSTATL_AN13RDY_LENGTH                  0x00000001

#define _ADSTATL_AN14RDY_POSITION                0x0000000E
#define _ADSTATL_AN14RDY_MASK                    0x00004000
#define _ADSTATL_AN14RDY_LENGTH                  0x00000001

#define _ADSTATL_AN15RDY_POSITION                0x0000000F
#define _ADSTATL_AN15RDY_MASK                    0x00008000
#define _ADSTATL_AN15RDY_LENGTH                  0x00000001

#define _ADSTATH_AN16RDY_POSITION                0x00000000
#define _ADSTATH_AN16RDY_MASK                    0x00000001
#define _ADSTATH_AN16RDY_LENGTH                  0x00000001

#define _ADSTATH_AN17RDY_POSITION                0x00000001
#define _ADSTATH_AN17RDY_MASK                    0x00000002
#define _ADSTATH_AN17RDY_LENGTH                  0x00000001

#define _ADSTATH_AN18RDY_POSITION                0x00000002
#define _ADSTATH_AN18RDY_MASK                    0x00000004
#define _ADSTATH_AN18RDY_LENGTH                  0x00000001

#define _ADSTATH_AN24RDY_POSITION                0x00000008
#define _ADSTATH_AN24RDY_MASK                    0x00000100
#define _ADSTATH_AN24RDY_LENGTH                  0x00000001

#define _ADSTATH_AN25RDY_POSITION                0x00000009
#define _ADSTATH_AN25RDY_MASK                    0x00000200
#define _ADSTATH_AN25RDY_LENGTH                  0x00000001

#define _ADCMP0ENL_CMPEN0_POSITION               0x00000000
#define _ADCMP0ENL_CMPEN0_MASK                   0x00000001
#define _ADCMP0ENL_CMPEN0_LENGTH                 0x00000001

#define _ADCMP0ENL_CMPEN1_POSITION               0x00000001
#define _ADCMP0ENL_CMPEN1_MASK                   0x00000002
#define _ADCMP0ENL_CMPEN1_LENGTH                 0x00000001

#define _ADCMP0ENL_CMPEN2_POSITION               0x00000002
#define _ADCMP0ENL_CMPEN2_MASK                   0x00000004
#define _ADCMP0ENL_CMPEN2_LENGTH                 0x00000001

#define _ADCMP0ENL_CMPEN3_POSITION               0x00000003
#define _ADCMP0ENL_CMPEN3_MASK                   0x00000008
#define _ADCMP0ENL_CMPEN3_LENGTH                 0x00000001

#define _ADCMP0ENL_CMPEN4_POSITION               0x00000004
#define _ADCMP0ENL_CMPEN4_MASK                   0x00000010
#define _ADCMP0ENL_CMPEN4_LENGTH                 0x00000001

