gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
#define _ADFL0CON_OVRSAM_POSITION                0x0000000A
#define _ADFL0CON_OVRSAM_MASK                    0x00001C00
#define _ADFL0CON_OVRSAM_LENGTH                  0x00000003

#define _ADFL0CON_MODE_POSITION                  0x0000000D
#define _ADFL0CON_MODE_MASK                      0x00006000
#define _ADFL0CON_MODE_LENGTH                    0x00000002

#define _ADFL0CON_FLEN_POSITION                  0x0000000F
#define _ADFL0CON_FLEN_MASK                      0x00008000
#define _ADFL0CON_FLEN_LENGTH                    0x00000001

#define _ADFL0CON_FLCHSEL0_POSITION              0x00000000
#define _ADFL0CON_FLCHSEL0_MASK                  0x00000001
#define _ADFL0CON_FLCHSEL0_LENGTH                0x00000001

#define _ADFL0CON_FLCHSEL1_POSITION              0x00000001
#define _ADFL0CON_FLCHSEL1_MASK                  0x00000002
#define _ADFL0CON_FLCHSEL1_LENGTH                0x00000001

#define _ADFL0CON_FLCHSEL2_POSITION              0x00000002
#define _ADFL0CON_FLCHSEL2_MASK                  0x00000004
#define _ADFL0CON_FLCHSEL2_LENGTH                0x00000001

#define _ADFL0CON_FLCHSEL3_POSITION              0x00000003
#define _ADFL0CON_FLCHSEL3_MASK                  0x00000008
#define _ADFL0CON_FLCHSEL3_LENGTH                0x00000001

#define _ADFL0CON_FLCHSEL4_POSITION              0x00000004
#define _ADFL0CON_FLCHSEL4_MASK                  0x00000010
#define _ADFL0CON_FLCHSEL4_LENGTH                0x00000001

#define _ADFL0CON_OVRSAM0_POSITION               0x0000000A
#define _ADFL0CON_OVRSAM0_MASK                   0x00000400
#define _ADFL0CON_OVRSAM0_LENGTH                 0x00000001

#define _ADFL0CON_OVRSAM1_POSITION               0x0000000B
#define _ADFL0CON_OVRSAM1_MASK                   0x00000800
#define _ADFL0CON_OVRSAM1_LENGTH                 0x00000001

#define _ADFL0CON_OVRSAM2_POSITION               0x0000000C
#define _ADFL0CON_OVRSAM2_MASK                   0x00001000
#define _ADFL0CON_OVRSAM2_LENGTH                 0x00000001

#define _ADFL1CON_FLCHSEL_POSITION               0x00000000
#define _ADFL1CON_FLCHSEL_MASK                   0x0000001F
#define _ADFL1CON_FLCHSEL_LENGTH                 0x00000005

#define _ADFL1CON_RDY_POSITION                   0x00000008
#define _ADFL1CON_RDY_MASK                       0x00000100
#define _ADFL1CON_RDY_LENGTH                     0x00000001

#define _ADFL1CON_IE_POSITION                    0x00000009
#define _ADFL1CON_IE_MASK                        0x00000200
#define _ADFL1CON_IE_LENGTH                      0x00000001

#define _ADFL1CON_OVRSAM_POSITION                0x0000000A
#define _ADFL1CON_OVRSAM_MASK                    0x00001C00
#define _ADFL1CON_OVRSAM_LENGTH                  0x00000003

#define _ADFL1CON_MODE_POSITION                  0x0000000D
#define _ADFL1CON_MODE_MASK                      0x00006000
#define _ADFL1CON_MODE_LENGTH                    0x00000002

#define _ADFL1CON_FLEN_POSITION                  0x0000000F
#define _ADFL1CON_FLEN_MASK                      0x00008000
#define _ADFL1CON_FLEN_LENGTH                    0x00000001

#define _ADFL1CON_FLCHSEL0_POSITION              0x00000000
#define _ADFL1CON_FLCHSEL0_MASK                  0x00000001
#define _ADFL1CON_FLCHSEL0_LENGTH                0x00000001

#define _ADFL1CON_FLCHSEL1_POSITION              0x00000001
#define _ADFL1CON_FLCHSEL1_MASK                  0x00000002
#define _ADFL1CON_FLCHSEL1_LENGTH                0x00000001

#define _ADFL1CON_FLCHSEL2_POSITION              0x00000002
#define _ADFL1CON_FLCHSEL2_MASK                  0x00000004
#define _ADFL1CON_FLCHSEL2_LENGTH                0x00000001

#define _ADFL1CON_FLCHSEL3_POSITION              0x00000003
#define _ADFL1CON_FLCHSEL3_MASK                  0x00000008
#define _ADFL1CON_FLCHSEL3_LENGTH                0x00000001

#define _ADFL1CON_FLCHSEL4_POSITION              0x00000004
#define _ADFL1CON_FLCHSEL4_MASK                  0x00000010
#define _ADFL1CON_FLCHSEL4_LENGTH                0x00000001

#define _ADFL1CON_OVRSAM0_POSITION               0x0000000A
#define _ADFL1CON_OVRSAM0_MASK                   0x00000400
#define _ADFL1CON_OVRSAM0_LENGTH                 0x00000001

#define _ADFL1CON_OVRSAM1_POSITION               0x0000000B
#define _ADFL1CON_OVRSAM1_MASK                   0x00000800
#define _ADFL1CON_OVRSAM1_LENGTH                 0x00000001

#define _ADFL1CON_OVRSAM2_POSITION               0x0000000C
#define _ADFL1CON_OVRSAM2_MASK                   0x00001000
#define _ADFL1CON_OVRSAM2_LENGTH                 0x00000001

#define _ADFL2CON_FLCHSEL_POSITION               0x00000000
#define _ADFL2CON_FLCHSEL_MASK                   0x0000001F
#define _ADFL2CON_FLCHSEL_LENGTH                 0x00000005

#define _ADFL2CON_RDY_POSITION                   0x00000008
#define _ADFL2CON_RDY_MASK                       0x00000100
#define _ADFL2CON_RDY_LENGTH                     0x00000001

#define _ADFL2CON_IE_POSITION                    0x00000009
#define _ADFL2CON_IE_MASK                        0x00000200
#define _ADFL2CON_IE_LENGTH                      0x00000001

#define _ADFL2CON_OVRSAM_POSITION                0x0000000A
#define _ADFL2CON_OVRSAM_MASK                    0x00001C00
#define _ADFL2CON_OVRSAM_LENGTH                  0x00000003

#define _ADFL2CON_MODE_POSITION                  0x0000000D
#define _ADFL2CON_MODE_MASK                      0x00006000
#define _ADFL2CON_MODE_LENGTH                    0x00000002

#define _ADFL2CON_FLEN_POSITION                  0x0000000F
#define _ADFL2CON_FLEN_MASK                      0x00008000
#define _ADFL2CON_FLEN_LENGTH                    0x00000001

#define _ADFL2CON_FLCHSEL0_POSITION              0x00000000
#define _ADFL2CON_FLCHSEL0_MASK                  0x00000001
#define _ADFL2CON_FLCHSEL0_LENGTH                0x00000001

#define _ADFL2CON_FLCHSEL1_POSITION              0x00000001
#define _ADFL2CON_FLCHSEL1_MASK                  0x00000002
#define _ADFL2CON_FLCHSEL1_LENGTH                0x00000001

#define _ADFL2CON_FLCHSEL2_POSITION              0x00000002
#define _ADFL2CON_FLCHSEL2_MASK                  0x00000004
#define _ADFL2CON_FLCHSEL2_LENGTH                0x00000001

#define _ADFL2CON_FLCHSEL3_POSITION              0x00000003
#define _ADFL2CON_FLCHSEL3_MASK                  0x00000008
#define _ADFL2CON_FLCHSEL3_LENGTH                0x00000001

#define _ADFL2CON_FLCHSEL4_POSITION              0x00000004
#define _ADFL2CON_FLCHSEL4_MASK                  0x00000010
#define _ADFL2CON_FLCHSEL4_LENGTH                0x00000001

#define _ADFL2CON_OVRSAM0_POSITION               0x0000000A
#define _ADFL2CON_OVRSAM0_MASK                   0x00000400
#define _ADFL2CON_OVRSAM0_LENGTH                 0x00000001

