gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
#define _ADFL2CON_OVRSAM1_POSITION               0x0000000B
#define _ADFL2CON_OVRSAM1_MASK                   0x00000800
#define _ADFL2CON_OVRSAM1_LENGTH                 0x00000001

#define _ADFL2CON_OVRSAM2_POSITION               0x0000000C
#define _ADFL2CON_OVRSAM2_MASK                   0x00001000
#define _ADFL2CON_OVRSAM2_LENGTH                 0x00000001

#define _ADFL3CON_FLCHSEL_POSITION               0x00000000
#define _ADFL3CON_FLCHSEL_MASK                   0x0000001F
#define _ADFL3CON_FLCHSEL_LENGTH                 0x00000005

#define _ADFL3CON_RDY_POSITION                   0x00000008
#define _ADFL3CON_RDY_MASK                       0x00000100
#define _ADFL3CON_RDY_LENGTH                     0x00000001

#define _ADFL3CON_IE_POSITION                    0x00000009
#define _ADFL3CON_IE_MASK                        0x00000200
#define _ADFL3CON_IE_LENGTH                      0x00000001

#define _ADFL3CON_OVRSAM_POSITION                0x0000000A
#define _ADFL3CON_OVRSAM_MASK                    0x00001C00
#define _ADFL3CON_OVRSAM_LENGTH                  0x00000003

#define _ADFL3CON_MODE_POSITION                  0x0000000D
#define _ADFL3CON_MODE_MASK                      0x00006000
#define _ADFL3CON_MODE_LENGTH                    0x00000002

#define _ADFL3CON_FLEN_POSITION                  0x0000000F
#define _ADFL3CON_FLEN_MASK                      0x00008000
#define _ADFL3CON_FLEN_LENGTH                    0x00000001

#define _ADFL3CON_FLCHSEL0_POSITION              0x00000000
#define _ADFL3CON_FLCHSEL0_MASK                  0x00000001
#define _ADFL3CON_FLCHSEL0_LENGTH                0x00000001

#define _ADFL3CON_FLCHSEL1_POSITION              0x00000001
#define _ADFL3CON_FLCHSEL1_MASK                  0x00000002
#define _ADFL3CON_FLCHSEL1_LENGTH                0x00000001

#define _ADFL3CON_FLCHSEL2_POSITION              0x00000002
#define _ADFL3CON_FLCHSEL2_MASK                  0x00000004
#define _ADFL3CON_FLCHSEL2_LENGTH                0x00000001

#define _ADFL3CON_FLCHSEL3_POSITION              0x00000003
#define _ADFL3CON_FLCHSEL3_MASK                  0x00000008
#define _ADFL3CON_FLCHSEL3_LENGTH                0x00000001

#define _ADFL3CON_FLCHSEL4_POSITION              0x00000004
#define _ADFL3CON_FLCHSEL4_MASK                  0x00000010
#define _ADFL3CON_FLCHSEL4_LENGTH                0x00000001

#define _ADFL3CON_OVRSAM0_POSITION               0x0000000A
#define _ADFL3CON_OVRSAM0_MASK                   0x00000400
#define _ADFL3CON_OVRSAM0_LENGTH                 0x00000001

#define _ADFL3CON_OVRSAM1_POSITION               0x0000000B
#define _ADFL3CON_OVRSAM1_MASK                   0x00000800
#define _ADFL3CON_OVRSAM1_LENGTH                 0x00000001

#define _ADFL3CON_OVRSAM2_POSITION               0x0000000C
#define _ADFL3CON_OVRSAM2_MASK                   0x00001000
#define _ADFL3CON_OVRSAM2_LENGTH                 0x00000001

#define _ADTRIG0L_TRGSRC0_POSITION               0x00000000
#define _ADTRIG0L_TRGSRC0_MASK                   0x0000001F
#define _ADTRIG0L_TRGSRC0_LENGTH                 0x00000005

#define _ADTRIG0L_TRGSRC1_POSITION               0x00000008
#define _ADTRIG0L_TRGSRC1_MASK                   0x00001F00
#define _ADTRIG0L_TRGSRC1_LENGTH                 0x00000005

#define _ADTRIG0L_TRIGSRC00_POSITION             0x00000000
#define _ADTRIG0L_TRIGSRC00_MASK                 0x00000001
#define _ADTRIG0L_TRIGSRC00_LENGTH               0x00000001

#define _ADTRIG0L_TRIGSRC01_POSITION             0x00000001
#define _ADTRIG0L_TRIGSRC01_MASK                 0x00000002
#define _ADTRIG0L_TRIGSRC01_LENGTH               0x00000001

#define _ADTRIG0L_TRIGSRC02_POSITION             0x00000002
#define _ADTRIG0L_TRIGSRC02_MASK                 0x00000004
#define _ADTRIG0L_TRIGSRC02_LENGTH               0x00000001

#define _ADTRIG0L_TRIGSRC03_POSITION             0x00000003
#define _ADTRIG0L_TRIGSRC03_MASK                 0x00000008
#define _ADTRIG0L_TRIGSRC03_LENGTH               0x00000001

#define _ADTRIG0L_TRIGSRC04_POSITION             0x00000004
#define _ADTRIG0L_TRIGSRC04_MASK                 0x00000010
#define _ADTRIG0L_TRIGSRC04_LENGTH               0x00000001

#define _ADTRIG0L_TRGSRC10_POSITION              0x00000008
#define _ADTRIG0L_TRGSRC10_MASK                  0x00000100
#define _ADTRIG0L_TRGSRC10_LENGTH                0x00000001

#define _ADTRIG0L_TRGSRC11_POSITION              0x00000009
#define _ADTRIG0L_TRGSRC11_MASK                  0x00000200
#define _ADTRIG0L_TRGSRC11_LENGTH                0x00000001

#define _ADTRIG0L_TRGSRC12_POSITION              0x0000000A
#define _ADTRIG0L_TRGSRC12_MASK                  0x00000400
#define _ADTRIG0L_TRGSRC12_LENGTH                0x00000001

#define _ADTRIG0L_TRGSRC13_POSITION              0x0000000B
#define _ADTRIG0L_TRGSRC13_MASK                  0x00000800
#define _ADTRIG0L_TRGSRC13_LENGTH                0x00000001

#define _ADTRIG0L_TRGSRC14_POSITION              0x0000000C
#define _ADTRIG0L_TRGSRC14_MASK                  0x00001000
#define _ADTRIG0L_TRGSRC14_LENGTH                0x00000001

#define _ADTRIG0L_TRGSRC00_POSITION              0x00000000
#define _ADTRIG0L_TRGSRC00_MASK                  0x00000001
#define _ADTRIG0L_TRGSRC00_LENGTH                0x00000001

#define _ADTRIG0L_TRGSRC01_POSITION              0x00000001
#define _ADTRIG0L_TRGSRC01_MASK                  0x00000002
#define _ADTRIG0L_TRGSRC01_LENGTH                0x00000001

#define _ADTRIG0L_TRGSRC02_POSITION              0x00000002
#define _ADTRIG0L_TRGSRC02_MASK                  0x00000004
#define _ADTRIG0L_TRGSRC02_LENGTH                0x00000001

#define _ADTRIG0L_TRGSRC03_POSITION              0x00000003
#define _ADTRIG0L_TRGSRC03_MASK                  0x00000008
#define _ADTRIG0L_TRGSRC03_LENGTH                0x00000001

#define _ADTRIG0L_TRGSRC04_POSITION              0x00000004
#define _ADTRIG0L_TRGSRC04_MASK                  0x00000010
#define _ADTRIG0L_TRGSRC04_LENGTH                0x00000001

#define _ADTRIG0H_TRGSRC2_POSITION               0x00000000
#define _ADTRIG0H_TRGSRC2_MASK                   0x0000001F
#define _ADTRIG0H_TRGSRC2_LENGTH                 0x00000005

#define _ADTRIG0H_TRGSRC3_POSITION               0x00000008
#define _ADTRIG0H_TRGSRC3_MASK                   0x00001F00
#define _ADTRIG0H_TRGSRC3_LENGTH                 0x00000005

#define _ADTRIG0H_TRIGSRC20_POSITION             0x00000000
#define _ADTRIG0H_TRIGSRC20_MASK                 0x00000001
#define _ADTRIG0H_TRIGSRC20_LENGTH               0x00000001

#define _ADTRIG0H_TRIGSRC21_POSITION             0x00000001
#define _ADTRIG0H_TRIGSRC21_MASK                 0x00000002
#define _ADTRIG0H_TRIGSRC21_LENGTH               0x00000001

#define _ADTRIG0H_TRIGSRC22_POSITION             0x00000002
#define _ADTRIG0H_TRIGSRC22_MASK                 0x00000004
#define _ADTRIG0H_TRIGSRC22_LENGTH               0x00000001

