gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
#define _DAC2DATH_DACDATH_POSITION               0x00000000
#define _DAC2DATH_DACDATH_MASK                   0x00000FFF
#define _DAC2DATH_DACDATH_LENGTH                 0x0000000C

#define _DAC2DATH_DACDATH0_POSITION              0x00000000
#define _DAC2DATH_DACDATH0_MASK                  0x00000001
#define _DAC2DATH_DACDATH0_LENGTH                0x00000001

#define _DAC2DATH_DACDATH1_POSITION              0x00000001
#define _DAC2DATH_DACDATH1_MASK                  0x00000002
#define _DAC2DATH_DACDATH1_LENGTH                0x00000001

#define _DAC2DATH_DACDATH2_POSITION              0x00000002
#define _DAC2DATH_DACDATH2_MASK                  0x00000004
#define _DAC2DATH_DACDATH2_LENGTH                0x00000001

#define _DAC2DATH_DACDATH3_POSITION              0x00000003
#define _DAC2DATH_DACDATH3_MASK                  0x00000008
#define _DAC2DATH_DACDATH3_LENGTH                0x00000001

#define _DAC2DATH_DACDATH4_POSITION              0x00000004
#define _DAC2DATH_DACDATH4_MASK                  0x00000010
#define _DAC2DATH_DACDATH4_LENGTH                0x00000001

#define _DAC2DATH_DACDATH5_POSITION              0x00000005
#define _DAC2DATH_DACDATH5_MASK                  0x00000020
#define _DAC2DATH_DACDATH5_LENGTH                0x00000001

#define _DAC2DATH_DACDATH6_POSITION              0x00000006
#define _DAC2DATH_DACDATH6_MASK                  0x00000040
#define _DAC2DATH_DACDATH6_LENGTH                0x00000001

#define _DAC2DATH_DACDATH7_POSITION              0x00000007
#define _DAC2DATH_DACDATH7_MASK                  0x00000080
#define _DAC2DATH_DACDATH7_LENGTH                0x00000001

#define _DAC2DATH_DACDATH8_POSITION              0x00000008
#define _DAC2DATH_DACDATH8_MASK                  0x00000100
#define _DAC2DATH_DACDATH8_LENGTH                0x00000001

#define _DAC2DATH_DACDATH9_POSITION              0x00000009
#define _DAC2DATH_DACDATH9_MASK                  0x00000200
#define _DAC2DATH_DACDATH9_LENGTH                0x00000001

#define _DAC2DATH_DACDATH10_POSITION             0x0000000A
#define _DAC2DATH_DACDATH10_MASK                 0x00000400
#define _DAC2DATH_DACDATH10_LENGTH               0x00000001

#define _DAC2DATH_DACDATH11_POSITION             0x0000000B
#define _DAC2DATH_DACDATH11_MASK                 0x00000800
#define _DAC2DATH_DACDATH11_LENGTH               0x00000001

#define _SLP2CONL_SLPSTRT_POSITION               0x00000000
#define _SLP2CONL_SLPSTRT_MASK                   0x0000000F
#define _SLP2CONL_SLPSTRT_LENGTH                 0x00000004

#define _SLP2CONL_SLPSTOPB_POSITION              0x00000004
#define _SLP2CONL_SLPSTOPB_MASK                  0x000000F0
#define _SLP2CONL_SLPSTOPB_LENGTH                0x00000004

#define _SLP2CONL_SLPSTOPA_POSITION              0x00000008
#define _SLP2CONL_SLPSTOPA_MASK                  0x00000F00
#define _SLP2CONL_SLPSTOPA_LENGTH                0x00000004

#define _SLP2CONL_HCFSEL_POSITION                0x0000000C
#define _SLP2CONL_HCFSEL_MASK                    0x0000F000
#define _SLP2CONL_HCFSEL_LENGTH                  0x00000004

#define _SLP2CONL_SLPSTRT0_POSITION              0x00000000
#define _SLP2CONL_SLPSTRT0_MASK                  0x00000001
#define _SLP2CONL_SLPSTRT0_LENGTH                0x00000001

#define _SLP2CONL_SLPSTRT1_POSITION              0x00000001
#define _SLP2CONL_SLPSTRT1_MASK                  0x00000002
#define _SLP2CONL_SLPSTRT1_LENGTH                0x00000001

#define _SLP2CONL_SLPSTRT2_POSITION              0x00000002
#define _SLP2CONL_SLPSTRT2_MASK                  0x00000004
#define _SLP2CONL_SLPSTRT2_LENGTH                0x00000001

#define _SLP2CONL_SLPSTRT3_POSITION              0x00000003
#define _SLP2CONL_SLPSTRT3_MASK                  0x00000008
#define _SLP2CONL_SLPSTRT3_LENGTH                0x00000001

#define _SLP2CONL_SLPSTOPB0_POSITION             0x00000004
#define _SLP2CONL_SLPSTOPB0_MASK                 0x00000010
#define _SLP2CONL_SLPSTOPB0_LENGTH               0x00000001

#define _SLP2CONL_SLPSTOPB1_POSITION             0x00000005
#define _SLP2CONL_SLPSTOPB1_MASK                 0x00000020
#define _SLP2CONL_SLPSTOPB1_LENGTH               0x00000001

#define _SLP2CONL_SLPSTOPB2_POSITION             0x00000006
#define _SLP2CONL_SLPSTOPB2_MASK                 0x00000040
#define _SLP2CONL_SLPSTOPB2_LENGTH               0x00000001

#define _SLP2CONL_SLPSTOPB3_POSITION             0x00000007
#define _SLP2CONL_SLPSTOPB3_MASK                 0x00000080
#define _SLP2CONL_SLPSTOPB3_LENGTH               0x00000001

#define _SLP2CONL_SLPSTOPA0_POSITION             0x00000008
#define _SLP2CONL_SLPSTOPA0_MASK                 0x00000100
#define _SLP2CONL_SLPSTOPA0_LENGTH               0x00000001

#define _SLP2CONL_SLPSTOPA1_POSITION             0x00000009
#define _SLP2CONL_SLPSTOPA1_MASK                 0x00000200
#define _SLP2CONL_SLPSTOPA1_LENGTH               0x00000001

#define _SLP2CONL_SLPSTOPA2_POSITION             0x0000000A
#define _SLP2CONL_SLPSTOPA2_MASK                 0x00000400
#define _SLP2CONL_SLPSTOPA2_LENGTH               0x00000001

#define _SLP2CONL_SLPSTOPA3_POSITION             0x0000000B
#define _SLP2CONL_SLPSTOPA3_MASK                 0x00000800
#define _SLP2CONL_SLPSTOPA3_LENGTH               0x00000001

#define _SLP2CONL_HCFSEL0_POSITION               0x0000000C
#define _SLP2CONL_HCFSEL0_MASK                   0x00001000
#define _SLP2CONL_HCFSEL0_LENGTH                 0x00000001

#define _SLP2CONL_HCFSEL1_POSITION               0x0000000D
#define _SLP2CONL_HCFSEL1_MASK                   0x00002000
#define _SLP2CONL_HCFSEL1_LENGTH                 0x00000001

#define _SLP2CONL_HCFSEL2_POSITION               0x0000000E
#define _SLP2CONL_HCFSEL2_MASK                   0x00004000
#define _SLP2CONL_HCFSEL2_LENGTH                 0x00000001

#define _SLP2CONL_HCFSEL3_POSITION               0x0000000F
#define _SLP2CONL_HCFSEL3_MASK                   0x00008000
#define _SLP2CONL_HCFSEL3_LENGTH                 0x00000001

#define _SLP2CONH_PSE_POSITION                   0x00000009
#define _SLP2CONH_PSE_MASK                       0x00000200
#define _SLP2CONH_PSE_LENGTH                     0x00000001

#define _SLP2CONH_TWME_POSITION                  0x0000000A
#define _SLP2CONH_TWME_MASK                      0x00000400
#define _SLP2CONH_TWME_LENGTH                    0x00000001

#define _SLP2CONH_HME_POSITION                   0x0000000B
#define _SLP2CONH_HME_MASK                       0x00000800
#define _SLP2CONH_HME_LENGTH                     0x00000001

#define _SLP2CONH_SLOPEN_POSITION                0x0000000F
#define _SLP2CONH_SLOPEN_MASK                    0x00008000
#define _SLP2CONH_SLOPEN_LENGTH                  0x00000001

#define _SLP2DAT_SLPDAT_POSITION                 0x00000000
#define _SLP2DAT_SLPDAT_MASK                     0x0000FFFF
#define _SLP2DAT_SLPDAT_LENGTH                   0x00000010

