gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
#define _SLP3CONL_SLPSTRT0_POSITION              0x00000000
#define _SLP3CONL_SLPSTRT0_MASK                  0x00000001
#define _SLP3CONL_SLPSTRT0_LENGTH                0x00000001

#define _SLP3CONL_SLPSTRT1_POSITION              0x00000001
#define _SLP3CONL_SLPSTRT1_MASK                  0x00000002
#define _SLP3CONL_SLPSTRT1_LENGTH                0x00000001

#define _SLP3CONL_SLPSTRT2_POSITION              0x00000002
#define _SLP3CONL_SLPSTRT2_MASK                  0x00000004
#define _SLP3CONL_SLPSTRT2_LENGTH                0x00000001

#define _SLP3CONL_SLPSTRT3_POSITION              0x00000003
#define _SLP3CONL_SLPSTRT3_MASK                  0x00000008
#define _SLP3CONL_SLPSTRT3_LENGTH                0x00000001

#define _SLP3CONL_SLPSTOPB0_POSITION             0x00000004
#define _SLP3CONL_SLPSTOPB0_MASK                 0x00000010
#define _SLP3CONL_SLPSTOPB0_LENGTH               0x00000001

#define _SLP3CONL_SLPSTOPB1_POSITION             0x00000005
#define _SLP3CONL_SLPSTOPB1_MASK                 0x00000020
#define _SLP3CONL_SLPSTOPB1_LENGTH               0x00000001

#define _SLP3CONL_SLPSTOPB2_POSITION             0x00000006
#define _SLP3CONL_SLPSTOPB2_MASK                 0x00000040
#define _SLP3CONL_SLPSTOPB2_LENGTH               0x00000001

#define _SLP3CONL_SLPSTOPB3_POSITION             0x00000007
#define _SLP3CONL_SLPSTOPB3_MASK                 0x00000080
#define _SLP3CONL_SLPSTOPB3_LENGTH               0x00000001

#define _SLP3CONL_SLPSTOPA0_POSITION             0x00000008
#define _SLP3CONL_SLPSTOPA0_MASK                 0x00000100
#define _SLP3CONL_SLPSTOPA0_LENGTH               0x00000001

#define _SLP3CONL_SLPSTOPA1_POSITION             0x00000009
#define _SLP3CONL_SLPSTOPA1_MASK                 0x00000200
#define _SLP3CONL_SLPSTOPA1_LENGTH               0x00000001

#define _SLP3CONL_SLPSTOPA2_POSITION             0x0000000A
#define _SLP3CONL_SLPSTOPA2_MASK                 0x00000400
#define _SLP3CONL_SLPSTOPA2_LENGTH               0x00000001

#define _SLP3CONL_SLPSTOPA3_POSITION             0x0000000B
#define _SLP3CONL_SLPSTOPA3_MASK                 0x00000800
#define _SLP3CONL_SLPSTOPA3_LENGTH               0x00000001

#define _SLP3CONL_HCFSEL0_POSITION               0x0000000C
#define _SLP3CONL_HCFSEL0_MASK                   0x00001000
#define _SLP3CONL_HCFSEL0_LENGTH                 0x00000001

#define _SLP3CONL_HCFSEL1_POSITION               0x0000000D
#define _SLP3CONL_HCFSEL1_MASK                   0x00002000
#define _SLP3CONL_HCFSEL1_LENGTH                 0x00000001

#define _SLP3CONL_HCFSEL2_POSITION               0x0000000E
#define _SLP3CONL_HCFSEL2_MASK                   0x00004000
#define _SLP3CONL_HCFSEL2_LENGTH                 0x00000001

#define _SLP3CONL_HCFSEL3_POSITION               0x0000000F
#define _SLP3CONL_HCFSEL3_MASK                   0x00008000
#define _SLP3CONL_HCFSEL3_LENGTH                 0x00000001

#define _SLP3CONH_PSE_POSITION                   0x00000009
#define _SLP3CONH_PSE_MASK                       0x00000200
#define _SLP3CONH_PSE_LENGTH                     0x00000001

#define _SLP3CONH_TWME_POSITION                  0x0000000A
#define _SLP3CONH_TWME_MASK                      0x00000400
#define _SLP3CONH_TWME_LENGTH                    0x00000001

#define _SLP3CONH_HME_POSITION                   0x0000000B
#define _SLP3CONH_HME_MASK                       0x00000800
#define _SLP3CONH_HME_LENGTH                     0x00000001

#define _SLP3CONH_SLOPEN_POSITION                0x0000000F
#define _SLP3CONH_SLOPEN_MASK                    0x00008000
#define _SLP3CONH_SLOPEN_LENGTH                  0x00000001

#define _SLP3DAT_SLPDAT_POSITION                 0x00000000
#define _SLP3DAT_SLPDAT_MASK                     0x0000FFFF
#define _SLP3DAT_SLPDAT_LENGTH                   0x00000010

#define _SLP3DAT_SLPDAT0_POSITION                0x00000000
#define _SLP3DAT_SLPDAT0_MASK                    0x00000001
#define _SLP3DAT_SLPDAT0_LENGTH                  0x00000001

#define _SLP3DAT_SLPDAT1_POSITION                0x00000001
#define _SLP3DAT_SLPDAT1_MASK                    0x00000002
#define _SLP3DAT_SLPDAT1_LENGTH                  0x00000001

#define _SLP3DAT_SLPDAT2_POSITION                0x00000002
#define _SLP3DAT_SLPDAT2_MASK                    0x00000004
#define _SLP3DAT_SLPDAT2_LENGTH                  0x00000001

#define _SLP3DAT_SLPDAT3_POSITION                0x00000003
#define _SLP3DAT_SLPDAT3_MASK                    0x00000008
#define _SLP3DAT_SLPDAT3_LENGTH                  0x00000001

#define _SLP3DAT_SLPDAT4_POSITION                0x00000004
#define _SLP3DAT_SLPDAT4_MASK                    0x00000010
#define _SLP3DAT_SLPDAT4_LENGTH                  0x00000001

#define _SLP3DAT_SLPDAT5_POSITION                0x00000005
#define _SLP3DAT_SLPDAT5_MASK                    0x00000020
#define _SLP3DAT_SLPDAT5_LENGTH                  0x00000001

#define _SLP3DAT_SLPDAT6_POSITION                0x00000006
#define _SLP3DAT_SLPDAT6_MASK                    0x00000040
#define _SLP3DAT_SLPDAT6_LENGTH                  0x00000001

#define _SLP3DAT_SLPDAT7_POSITION                0x00000007
#define _SLP3DAT_SLPDAT7_MASK                    0x00000080
#define _SLP3DAT_SLPDAT7_LENGTH                  0x00000001

#define _SLP3DAT_SLPDAT8_POSITION                0x00000008
#define _SLP3DAT_SLPDAT8_MASK                    0x00000100
#define _SLP3DAT_SLPDAT8_LENGTH                  0x00000001

#define _SLP3DAT_SLPDAT9_POSITION                0x00000009
#define _SLP3DAT_SLPDAT9_MASK                    0x00000200
#define _SLP3DAT_SLPDAT9_LENGTH                  0x00000001

#define _SLP3DAT_SLPDAT10_POSITION               0x0000000A
#define _SLP3DAT_SLPDAT10_MASK                   0x00000400
#define _SLP3DAT_SLPDAT10_LENGTH                 0x00000001

#define _SLP3DAT_SLPDAT11_POSITION               0x0000000B
#define _SLP3DAT_SLPDAT11_MASK                   0x00000800
#define _SLP3DAT_SLPDAT11_LENGTH                 0x00000001

#define _SLP3DAT_SLPDAT12_POSITION               0x0000000C
#define _SLP3DAT_SLPDAT12_MASK                   0x00001000
#define _SLP3DAT_SLPDAT12_LENGTH                 0x00000001

