gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
#define _SLP3DAT_SLPDAT13_POSITION               0x0000000D
#define _SLP3DAT_SLPDAT13_MASK                   0x00002000
#define _SLP3DAT_SLPDAT13_LENGTH                 0x00000001

#define _SLP3DAT_SLPDAT14_POSITION               0x0000000E
#define _SLP3DAT_SLPDAT14_MASK                   0x00004000
#define _SLP3DAT_SLPDAT14_LENGTH                 0x00000001

#define _SLP3DAT_SLPDAT15_POSITION               0x0000000F
#define _SLP3DAT_SLPDAT15_MASK                   0x00008000
#define _SLP3DAT_SLPDAT15_LENGTH                 0x00000001

#define _VREGCON_VREG1OV_POSITION                0x00000000
#define _VREGCON_VREG1OV_MASK                    0x00000003
#define _VREGCON_VREG1OV_LENGTH                  0x00000002

#define _VREGCON_VREG2OV_POSITION                0x00000002
#define _VREGCON_VREG2OV_MASK                    0x0000000C
#define _VREGCON_VREG2OV_LENGTH                  0x00000002

#define _VREGCON_VREG3OV_POSITION                0x00000004
#define _VREGCON_VREG3OV_MASK                    0x00000030
#define _VREGCON_VREG3OV_LENGTH                  0x00000002

#define _VREGCON_LPWREN_POSITION                 0x0000000F
#define _VREGCON_LPWREN_MASK                     0x00008000
#define _VREGCON_LPWREN_LENGTH                   0x00000001

#define _RPCON_IOLOCK_POSITION                   0x0000000B
#define _RPCON_IOLOCK_MASK                       0x00000800
#define _RPCON_IOLOCK_LENGTH                     0x00000001

#define _RPINR0_INT1R_POSITION                   0x00000008
#define _RPINR0_INT1R_MASK                       0x0000FF00
#define _RPINR0_INT1R_LENGTH                     0x00000008

#define _RPINR1_INT2R_POSITION                   0x00000000
#define _RPINR1_INT2R_MASK                       0x000000FF
#define _RPINR1_INT2R_LENGTH                     0x00000008

#define _RPINR1_INT3R_POSITION                   0x00000008
#define _RPINR1_INT3R_MASK                       0x0000FF00
#define _RPINR1_INT3R_LENGTH                     0x00000008

#define _RPINR2_T1CKR_POSITION                   0x00000008
#define _RPINR2_T1CKR_MASK                       0x0000FF00
#define _RPINR2_T1CKR_LENGTH                     0x00000008

#define _RPINR3_TCKI1R_POSITION                  0x00000000
#define _RPINR3_TCKI1R_MASK                      0x000000FF
#define _RPINR3_TCKI1R_LENGTH                    0x00000008

#define _RPINR3_ICM1R_POSITION                   0x00000008
#define _RPINR3_ICM1R_MASK                       0x0000FF00
#define _RPINR3_ICM1R_LENGTH                     0x00000008

#define _RPINR4_TCKI2R_POSITION                  0x00000000
#define _RPINR4_TCKI2R_MASK                      0x000000FF
#define _RPINR4_TCKI2R_LENGTH                    0x00000008

#define _RPINR4_ICM2R_POSITION                   0x00000008
#define _RPINR4_ICM2R_MASK                       0x0000FF00
#define _RPINR4_ICM2R_LENGTH                     0x00000008

#define _RPINR5_TCKI3R_POSITION                  0x00000000
#define _RPINR5_TCKI3R_MASK                      0x000000FF
#define _RPINR5_TCKI3R_LENGTH                    0x00000008

#define _RPINR5_ICM3R_POSITION                   0x00000008
#define _RPINR5_ICM3R_MASK                       0x0000FF00
#define _RPINR5_ICM3R_LENGTH                     0x00000008

#define _RPINR6_TCKI4R_POSITION                  0x00000000
#define _RPINR6_TCKI4R_MASK                      0x000000FF
#define _RPINR6_TCKI4R_LENGTH                    0x00000008

#define _RPINR6_ICM4R_POSITION                   0x00000008
#define _RPINR6_ICM4R_MASK                       0x0000FF00
#define _RPINR6_ICM4R_LENGTH                     0x00000008

#define _RPINR7_TCKI5R_POSITION                  0x00000000
#define _RPINR7_TCKI5R_MASK                      0x000000FF
#define _RPINR7_TCKI5R_LENGTH                    0x00000008

#define _RPINR7_ICM5R_POSITION                   0x00000008
#define _RPINR7_ICM5R_MASK                       0x0000FF00
#define _RPINR7_ICM5R_LENGTH                     0x00000008

#define _RPINR8_TCKI6R_POSITION                  0x00000000
#define _RPINR8_TCKI6R_MASK                      0x000000FF
#define _RPINR8_TCKI6R_LENGTH                    0x00000008

#define _RPINR8_ICM6R_POSITION                   0x00000008
#define _RPINR8_ICM6R_MASK                       0x0000FF00
#define _RPINR8_ICM6R_LENGTH                     0x00000008

#define _RPINR9_TCKI7R_POSITION                  0x00000000
#define _RPINR9_TCKI7R_MASK                      0x000000FF
#define _RPINR9_TCKI7R_LENGTH                    0x00000008

#define _RPINR9_ICM7R_POSITION                   0x00000008
#define _RPINR9_ICM7R_MASK                       0x0000FF00
#define _RPINR9_ICM7R_LENGTH                     0x00000008

#define _RPINR10_TCKI8R_POSITION                 0x00000000
#define _RPINR10_TCKI8R_MASK                     0x000000FF
#define _RPINR10_TCKI8R_LENGTH                   0x00000008

#define _RPINR10_ICM8R_POSITION                  0x00000008
#define _RPINR10_ICM8R_MASK                      0x0000FF00
#define _RPINR10_ICM8R_LENGTH                    0x00000008

#define _RPINR11_OCFAR_POSITION                  0x00000000
#define _RPINR11_OCFAR_MASK                      0x000000FF
#define _RPINR11_OCFAR_LENGTH                    0x00000008

#define _RPINR11_OCFBR_POSITION                  0x00000008
#define _RPINR11_OCFBR_MASK                      0x0000FF00
#define _RPINR11_OCFBR_LENGTH                    0x00000008

#define _RPINR12_PCI8R_POSITION                  0x00000000
#define _RPINR12_PCI8R_MASK                      0x000000FF
#define _RPINR12_PCI8R_LENGTH                    0x00000008

#define _RPINR12_PCI9R_POSITION                  0x00000008
#define _RPINR12_PCI9R_MASK                      0x0000FF00
#define _RPINR12_PCI9R_LENGTH                    0x00000008

#define _RPINR13_PCI10R_POSITION                 0x00000000
#define _RPINR13_PCI10R_MASK                     0x000000FF
#define _RPINR13_PCI10R_LENGTH                   0x00000008

#define _RPINR13_PCI11R_POSITION                 0x00000008
#define _RPINR13_PCI11R_MASK                     0x0000FF00
#define _RPINR13_PCI11R_LENGTH                   0x00000008

