gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
#define _RPINR14_QEIA1R_POSITION                 0x00000000
#define _RPINR14_QEIA1R_MASK                     0x000000FF
#define _RPINR14_QEIA1R_LENGTH                   0x00000008

#define _RPINR14_QEIB1R_POSITION                 0x00000008
#define _RPINR14_QEIB1R_MASK                     0x0000FF00
#define _RPINR14_QEIB1R_LENGTH                   0x00000008

#define _RPINR15_QEINDX1R_POSITION               0x00000000
#define _RPINR15_QEINDX1R_MASK                   0x000000FF
#define _RPINR15_QEINDX1R_LENGTH                 0x00000008

#define _RPINR15_QEIHOM1R_POSITION               0x00000008
#define _RPINR15_QEIHOM1R_MASK                   0x0000FF00
#define _RPINR15_QEIHOM1R_LENGTH                 0x00000008

#define _RPINR16_QEIA2R_POSITION                 0x00000000
#define _RPINR16_QEIA2R_MASK                     0x000000FF
#define _RPINR16_QEIA2R_LENGTH                   0x00000008

#define _RPINR16_QEIB2R_POSITION                 0x00000008
#define _RPINR16_QEIB2R_MASK                     0x0000FF00
#define _RPINR16_QEIB2R_LENGTH                   0x00000008

#define _RPINR17_QEINDX2R_POSITION               0x00000000
#define _RPINR17_QEINDX2R_MASK                   0x000000FF
#define _RPINR17_QEINDX2R_LENGTH                 0x00000008

#define _RPINR17_QEIHOM2R_POSITION               0x00000008
#define _RPINR17_QEIHOM2R_MASK                   0x0000FF00
#define _RPINR17_QEIHOM2R_LENGTH                 0x00000008

#define _RPINR18_U1RXR_POSITION                  0x00000000
#define _RPINR18_U1RXR_MASK                      0x000000FF
#define _RPINR18_U1RXR_LENGTH                    0x00000008

#define _RPINR18_U1DSRR_POSITION                 0x00000008
#define _RPINR18_U1DSRR_MASK                     0x0000FF00
#define _RPINR18_U1DSRR_LENGTH                   0x00000008

#define _RPINR19_U2RXR_POSITION                  0x00000000
#define _RPINR19_U2RXR_MASK                      0x000000FF
#define _RPINR19_U2RXR_LENGTH                    0x00000008

#define _RPINR19_U2DSRR_POSITION                 0x00000008
#define _RPINR19_U2DSRR_MASK                     0x0000FF00
#define _RPINR19_U2DSRR_LENGTH                   0x00000008

#define _RPINR20_SDI1R_POSITION                  0x00000000
#define _RPINR20_SDI1R_MASK                      0x000000FF
#define _RPINR20_SDI1R_LENGTH                    0x00000008

#define _RPINR20_SCK1R_POSITION                  0x00000008
#define _RPINR20_SCK1R_MASK                      0x0000FF00
#define _RPINR20_SCK1R_LENGTH                    0x00000008

#define _RPINR21_SS1R_POSITION                   0x00000000
#define _RPINR21_SS1R_MASK                       0x000000FF
#define _RPINR21_SS1R_LENGTH                     0x00000008

#define _RPINR21_REFOIR_POSITION                 0x00000008
#define _RPINR21_REFOIR_MASK                     0x0000FF00
#define _RPINR21_REFOIR_LENGTH                   0x00000008

#define _RPINR22_SDI2R_POSITION                  0x00000000
#define _RPINR22_SDI2R_MASK                      0x000000FF
#define _RPINR22_SDI2R_LENGTH                    0x00000008

#define _RPINR22_SCK2R_POSITION                  0x00000008
#define _RPINR22_SCK2R_MASK                      0x0000FF00
#define _RPINR22_SCK2R_LENGTH                    0x00000008

#define _RPINR23_SS2R_POSITION                   0x00000000
#define _RPINR23_SS2R_MASK                       0x000000FF
#define _RPINR23_SS2R_LENGTH                     0x00000008

#define _RPINR26_CAN1RXR_POSITION                0x00000000
#define _RPINR26_CAN1RXR_MASK                    0x000000FF
#define _RPINR26_CAN1RXR_LENGTH                  0x00000008

#define _RPINR27_U3RXR_POSITION                  0x00000000
#define _RPINR27_U3RXR_MASK                      0x000000FF
#define _RPINR27_U3RXR_LENGTH                    0x00000008

#define _RPINR27_U3DSRR_POSITION                 0x00000008
#define _RPINR27_U3DSRR_MASK                     0x0000FF00
#define _RPINR27_U3DSRR_LENGTH                   0x00000008

#define _RPINR29_SDI3R_POSITION                  0x00000000
#define _RPINR29_SDI3R_MASK                      0x000000FF
#define _RPINR29_SDI3R_LENGTH                    0x00000008

#define _RPINR29_SCK3R_POSITION                  0x00000008
#define _RPINR29_SCK3R_MASK                      0x0000FF00
#define _RPINR29_SCK3R_LENGTH                    0x00000008

#define _RPINR30_SS3R_POSITION                   0x00000000
#define _RPINR30_SS3R_MASK                       0x000000FF
#define _RPINR30_SS3R_LENGTH                     0x00000008

#define _RPINR32_TCKI9R_POSITION                 0x00000008
#define _RPINR32_TCKI9R_MASK                     0x0000FF00
#define _RPINR32_TCKI9R_LENGTH                   0x00000008

#define _RPINR33_ICM9R_POSITION                  0x00000000
#define _RPINR33_ICM9R_MASK                      0x000000FF
#define _RPINR33_ICM9R_LENGTH                    0x00000008

#define _RPINR37_OCFCR_POSITION                  0x00000000
#define _RPINR37_OCFCR_MASK                      0x000000FF
#define _RPINR37_OCFCR_LENGTH                    0x00000008

#define _RPINR37_PCI17R_POSITION                 0x00000008
#define _RPINR37_PCI17R_MASK                     0x0000FF00
#define _RPINR37_PCI17R_LENGTH                   0x00000008

#define _RPINR38_PCI18R_POSITION                 0x00000000
#define _RPINR38_PCI18R_MASK                     0x000000FF
#define _RPINR38_PCI18R_LENGTH                   0x00000008

#define _RPINR42_PCI12R_POSITION                 0x00000000
#define _RPINR42_PCI12R_MASK                     0x000000FF
#define _RPINR42_PCI12R_LENGTH                   0x00000008

#define _RPINR42_PCI13R_POSITION                 0x00000008
#define _RPINR42_PCI13R_MASK                     0x0000FF00
#define _RPINR42_PCI13R_LENGTH                   0x00000008

#define _RPINR43_PCI14R_POSITION                 0x00000000
#define _RPINR43_PCI14R_MASK                     0x000000FF
#define _RPINR43_PCI14R_LENGTH                   0x00000008

#define _RPINR43_PCI15R_POSITION                 0x00000008
#define _RPINR43_PCI15R_MASK                     0x0000FF00
#define _RPINR43_PCI15R_LENGTH                   0x00000008

#define _RPINR44_PCI16R_POSITION                 0x00000000
#define _RPINR44_PCI16R_MASK                     0x000000FF
#define _RPINR44_PCI16R_LENGTH                   0x00000008

#define _RPINR44_SENT1R_POSITION                 0x00000008
#define _RPINR44_SENT1R_MASK                     0x0000FF00
#define _RPINR44_SENT1R_LENGTH                   0x00000008

#define _RPINR45_SENT2R_POSITION                 0x00000000
#define _RPINR45_SENT2R_MASK                     0x000000FF
#define _RPINR45_SENT2R_LENGTH                   0x00000008

#define _RPINR45_CLCINAR_POSITION                0x00000008
#define _RPINR45_CLCINAR_MASK                    0x0000FF00
#define _RPINR45_CLCINAR_LENGTH                  0x00000008

#define _RPINR46_CLCINBR_POSITION                0x00000000
#define _RPINR46_CLCINBR_MASK                    0x000000FF
#define _RPINR46_CLCINBR_LENGTH                  0x00000008

