gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
#define _CNCONC_ON_POSITION                      0x0000000F
#define _CNCONC_ON_MASK                          0x00008000
#define _CNCONC_ON_LENGTH                        0x00000001

#define _CNEN0C_CNEN0C0_POSITION                 0x00000000
#define _CNEN0C_CNEN0C0_MASK                     0x00000001
#define _CNEN0C_CNEN0C0_LENGTH                   0x00000001

#define _CNEN0C_CNEN0C1_POSITION                 0x00000001
#define _CNEN0C_CNEN0C1_MASK                     0x00000002
#define _CNEN0C_CNEN0C1_LENGTH                   0x00000001

#define _CNEN0C_CNEN0C2_POSITION                 0x00000002
#define _CNEN0C_CNEN0C2_MASK                     0x00000004
#define _CNEN0C_CNEN0C2_LENGTH                   0x00000001

#define _CNEN0C_CNEN0C3_POSITION                 0x00000003
#define _CNEN0C_CNEN0C3_MASK                     0x00000008
#define _CNEN0C_CNEN0C3_LENGTH                   0x00000001

#define _CNEN0C_CNEN0C4_POSITION                 0x00000004
#define _CNEN0C_CNEN0C4_MASK                     0x00000010
#define _CNEN0C_CNEN0C4_LENGTH                   0x00000001

#define _CNEN0C_CNEN0C5_POSITION                 0x00000005
#define _CNEN0C_CNEN0C5_MASK                     0x00000020
#define _CNEN0C_CNEN0C5_LENGTH                   0x00000001

#define _CNEN0C_CNEN0C6_POSITION                 0x00000006
#define _CNEN0C_CNEN0C6_MASK                     0x00000040
#define _CNEN0C_CNEN0C6_LENGTH                   0x00000001

#define _CNEN0C_CNEN0C7_POSITION                 0x00000007
#define _CNEN0C_CNEN0C7_MASK                     0x00000080
#define _CNEN0C_CNEN0C7_LENGTH                   0x00000001

#define _CNEN0C_CNEN0C8_POSITION                 0x00000008
#define _CNEN0C_CNEN0C8_MASK                     0x00000100
#define _CNEN0C_CNEN0C8_LENGTH                   0x00000001

#define _CNEN0C_CNEN0C9_POSITION                 0x00000009
#define _CNEN0C_CNEN0C9_MASK                     0x00000200
#define _CNEN0C_CNEN0C9_LENGTH                   0x00000001

#define _CNEN0C_CNEN0C10_POSITION                0x0000000A
#define _CNEN0C_CNEN0C10_MASK                    0x00000400
#define _CNEN0C_CNEN0C10_LENGTH                  0x00000001

#define _CNEN0C_CNEN0C11_POSITION                0x0000000B
#define _CNEN0C_CNEN0C11_MASK                    0x00000800
#define _CNEN0C_CNEN0C11_LENGTH                  0x00000001

#define _CNEN0C_CNEN0C12_POSITION                0x0000000C
#define _CNEN0C_CNEN0C12_MASK                    0x00001000
#define _CNEN0C_CNEN0C12_LENGTH                  0x00000001

#define _CNEN0C_CNEN0C13_POSITION                0x0000000D
#define _CNEN0C_CNEN0C13_MASK                    0x00002000
#define _CNEN0C_CNEN0C13_LENGTH                  0x00000001

#define _CNSTATC_CNSTATC0_POSITION               0x00000000
#define _CNSTATC_CNSTATC0_MASK                   0x00000001
#define _CNSTATC_CNSTATC0_LENGTH                 0x00000001

#define _CNSTATC_CNSTATC1_POSITION               0x00000001
#define _CNSTATC_CNSTATC1_MASK                   0x00000002
#define _CNSTATC_CNSTATC1_LENGTH                 0x00000001

#define _CNSTATC_CNSTATC2_POSITION               0x00000002
#define _CNSTATC_CNSTATC2_MASK                   0x00000004
#define _CNSTATC_CNSTATC2_LENGTH                 0x00000001

#define _CNSTATC_CNSTATC3_POSITION               0x00000003
#define _CNSTATC_CNSTATC3_MASK                   0x00000008
#define _CNSTATC_CNSTATC3_LENGTH                 0x00000001

#define _CNSTATC_CNSTATC4_POSITION               0x00000004
#define _CNSTATC_CNSTATC4_MASK                   0x00000010
#define _CNSTATC_CNSTATC4_LENGTH                 0x00000001

#define _CNSTATC_CNSTATC5_POSITION               0x00000005
#define _CNSTATC_CNSTATC5_MASK                   0x00000020
#define _CNSTATC_CNSTATC5_LENGTH                 0x00000001

#define _CNSTATC_CNSTATC6_POSITION               0x00000006
#define _CNSTATC_CNSTATC6_MASK                   0x00000040
#define _CNSTATC_CNSTATC6_LENGTH                 0x00000001

#define _CNSTATC_CNSTATC7_POSITION               0x00000007
#define _CNSTATC_CNSTATC7_MASK                   0x00000080
#define _CNSTATC_CNSTATC7_LENGTH                 0x00000001

#define _CNSTATC_CNSTATC8_POSITION               0x00000008
#define _CNSTATC_CNSTATC8_MASK                   0x00000100
#define _CNSTATC_CNSTATC8_LENGTH                 0x00000001

#define _CNSTATC_CNSTATC9_POSITION               0x00000009
#define _CNSTATC_CNSTATC9_MASK                   0x00000200
#define _CNSTATC_CNSTATC9_LENGTH                 0x00000001

#define _CNSTATC_CNSTATC10_POSITION              0x0000000A
#define _CNSTATC_CNSTATC10_MASK                  0x00000400
#define _CNSTATC_CNSTATC10_LENGTH                0x00000001

#define _CNSTATC_CNSTATC11_POSITION              0x0000000B
#define _CNSTATC_CNSTATC11_MASK                  0x00000800
#define _CNSTATC_CNSTATC11_LENGTH                0x00000001

#define _CNSTATC_CNSTATC12_POSITION              0x0000000C
#define _CNSTATC_CNSTATC12_MASK                  0x00001000
#define _CNSTATC_CNSTATC12_LENGTH                0x00000001

#define _CNSTATC_CNSTATC13_POSITION              0x0000000D
#define _CNSTATC_CNSTATC13_MASK                  0x00002000
#define _CNSTATC_CNSTATC13_LENGTH                0x00000001

#define _CNEN1C_CNEN1C0_POSITION                 0x00000000
#define _CNEN1C_CNEN1C0_MASK                     0x00000001
#define _CNEN1C_CNEN1C0_LENGTH                   0x00000001

#define _CNEN1C_CNEN1C1_POSITION                 0x00000001
#define _CNEN1C_CNEN1C1_MASK                     0x00000002
#define _CNEN1C_CNEN1C1_LENGTH                   0x00000001

#define _CNEN1C_CNEN1C2_POSITION                 0x00000002
#define _CNEN1C_CNEN1C2_MASK                     0x00000004
#define _CNEN1C_CNEN1C2_LENGTH                   0x00000001

#define _CNEN1C_CNEN1C3_POSITION                 0x00000003
#define _CNEN1C_CNEN1C3_MASK                     0x00000008
#define _CNEN1C_CNEN1C3_LENGTH                   0x00000001

#define _CNEN1C_CNEN1C4_POSITION                 0x00000004
#define _CNEN1C_CNEN1C4_MASK                     0x00000010
#define _CNEN1C_CNEN1C4_LENGTH                   0x00000001

#define _CNEN1C_CNEN1C5_POSITION                 0x00000005
#define _CNEN1C_CNEN1C5_MASK                     0x00000020
#define _CNEN1C_CNEN1C5_LENGTH                   0x00000001

#define _CNEN1C_CNEN1C6_POSITION                 0x00000006
#define _CNEN1C_CNEN1C6_MASK                     0x00000040
#define _CNEN1C_CNEN1C6_LENGTH                   0x00000001

