gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
#define _CNEN1C_CNEN1C7_POSITION                 0x00000007
#define _CNEN1C_CNEN1C7_MASK                     0x00000080
#define _CNEN1C_CNEN1C7_LENGTH                   0x00000001

#define _CNEN1C_CNEN1C8_POSITION                 0x00000008
#define _CNEN1C_CNEN1C8_MASK                     0x00000100
#define _CNEN1C_CNEN1C8_LENGTH                   0x00000001

#define _CNEN1C_CNEN1C9_POSITION                 0x00000009
#define _CNEN1C_CNEN1C9_MASK                     0x00000200
#define _CNEN1C_CNEN1C9_LENGTH                   0x00000001

#define _CNEN1C_CNEN1C10_POSITION                0x0000000A
#define _CNEN1C_CNEN1C10_MASK                    0x00000400
#define _CNEN1C_CNEN1C10_LENGTH                  0x00000001

#define _CNEN1C_CNEN1C11_POSITION                0x0000000B
#define _CNEN1C_CNEN1C11_MASK                    0x00000800
#define _CNEN1C_CNEN1C11_LENGTH                  0x00000001

#define _CNEN1C_CNEN1C12_POSITION                0x0000000C
#define _CNEN1C_CNEN1C12_MASK                    0x00001000
#define _CNEN1C_CNEN1C12_LENGTH                  0x00000001

#define _CNEN1C_CNEN1C13_POSITION                0x0000000D
#define _CNEN1C_CNEN1C13_MASK                    0x00002000
#define _CNEN1C_CNEN1C13_LENGTH                  0x00000001

#define _CNFC_CNFC0_POSITION                     0x00000000
#define _CNFC_CNFC0_MASK                         0x00000001
#define _CNFC_CNFC0_LENGTH                       0x00000001

#define _CNFC_CNFC1_POSITION                     0x00000001
#define _CNFC_CNFC1_MASK                         0x00000002
#define _CNFC_CNFC1_LENGTH                       0x00000001

#define _CNFC_CNFC2_POSITION                     0x00000002
#define _CNFC_CNFC2_MASK                         0x00000004
#define _CNFC_CNFC2_LENGTH                       0x00000001

#define _CNFC_CNFC3_POSITION                     0x00000003
#define _CNFC_CNFC3_MASK                         0x00000008
#define _CNFC_CNFC3_LENGTH                       0x00000001

#define _CNFC_CNFC4_POSITION                     0x00000004
#define _CNFC_CNFC4_MASK                         0x00000010
#define _CNFC_CNFC4_LENGTH                       0x00000001

#define _CNFC_CNFC5_POSITION                     0x00000005
#define _CNFC_CNFC5_MASK                         0x00000020
#define _CNFC_CNFC5_LENGTH                       0x00000001

#define _CNFC_CNFC6_POSITION                     0x00000006
#define _CNFC_CNFC6_MASK                         0x00000040
#define _CNFC_CNFC6_LENGTH                       0x00000001

#define _CNFC_CNFC7_POSITION                     0x00000007
#define _CNFC_CNFC7_MASK                         0x00000080
#define _CNFC_CNFC7_LENGTH                       0x00000001

#define _CNFC_CNFC8_POSITION                     0x00000008
#define _CNFC_CNFC8_MASK                         0x00000100
#define _CNFC_CNFC8_LENGTH                       0x00000001

#define _CNFC_CNFC9_POSITION                     0x00000009
#define _CNFC_CNFC9_MASK                         0x00000200
#define _CNFC_CNFC9_LENGTH                       0x00000001

#define _CNFC_CNFC10_POSITION                    0x0000000A
#define _CNFC_CNFC10_MASK                        0x00000400
#define _CNFC_CNFC10_LENGTH                      0x00000001

#define _CNFC_CNFC11_POSITION                    0x0000000B
#define _CNFC_CNFC11_MASK                        0x00000800
#define _CNFC_CNFC11_LENGTH                      0x00000001

#define _CNFC_CNFC12_POSITION                    0x0000000C
#define _CNFC_CNFC12_MASK                        0x00001000
#define _CNFC_CNFC12_LENGTH                      0x00000001

#define _CNFC_CNFC13_POSITION                    0x0000000D
#define _CNFC_CNFC13_MASK                        0x00002000
#define _CNFC_CNFC13_LENGTH                      0x00000001

#define _ANSELD_ANSELD10_POSITION                0x0000000A
#define _ANSELD_ANSELD10_MASK                    0x00000400
#define _ANSELD_ANSELD10_LENGTH                  0x00000001

#define _ANSELD_ANSELD13_POSITION                0x0000000D
#define _ANSELD_ANSELD13_MASK                    0x00002000
#define _ANSELD_ANSELD13_LENGTH                  0x00000001

#define _TRISD_TRISD1_POSITION                   0x00000001
#define _TRISD_TRISD1_MASK                       0x00000002
#define _TRISD_TRISD1_LENGTH                     0x00000001

#define _TRISD_TRISD8_POSITION                   0x00000008
#define _TRISD_TRISD8_MASK                       0x00000100
#define _TRISD_TRISD8_LENGTH                     0x00000001

#define _TRISD_TRISD10_POSITION                  0x0000000A
#define _TRISD_TRISD10_MASK                      0x00000400
#define _TRISD_TRISD10_LENGTH                    0x00000001

#define _TRISD_TRISD13_POSITION                  0x0000000D
#define _TRISD_TRISD13_MASK                      0x00002000
#define _TRISD_TRISD13_LENGTH                    0x00000001

#define _PORTD_RD1_POSITION                      0x00000001
#define _PORTD_RD1_MASK                          0x00000002
#define _PORTD_RD1_LENGTH                        0x00000001

#define _PORTD_RD8_POSITION                      0x00000008
#define _PORTD_RD8_MASK                          0x00000100
#define _PORTD_RD8_LENGTH                        0x00000001

#define _PORTD_RD10_POSITION                     0x0000000A
#define _PORTD_RD10_MASK                         0x00000400
#define _PORTD_RD10_LENGTH                       0x00000001

#define _PORTD_RD13_POSITION                     0x0000000D
#define _PORTD_RD13_MASK                         0x00002000
#define _PORTD_RD13_LENGTH                       0x00000001

#define _LATD_LATD1_POSITION                     0x00000001
#define _LATD_LATD1_MASK                         0x00000002
#define _LATD_LATD1_LENGTH                       0x00000001

#define _LATD_LATD8_POSITION                     0x00000008
#define _LATD_LATD8_MASK                         0x00000100
#define _LATD_LATD8_LENGTH                       0x00000001

#define _LATD_LATD10_POSITION                    0x0000000A
#define _LATD_LATD10_MASK                        0x00000400
#define _LATD_LATD10_LENGTH                      0x00000001

#define _LATD_LATD13_POSITION                    0x0000000D
#define _LATD_LATD13_MASK                        0x00002000
#define _LATD_LATD13_LENGTH                      0x00000001

