gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
#define _ODCD_ODCD1_POSITION                     0x00000001
#define _ODCD_ODCD1_MASK                         0x00000002
#define _ODCD_ODCD1_LENGTH                       0x00000001

#define _ODCD_ODCD8_POSITION                     0x00000008
#define _ODCD_ODCD8_MASK                         0x00000100
#define _ODCD_ODCD8_LENGTH                       0x00000001

#define _ODCD_ODCD10_POSITION                    0x0000000A
#define _ODCD_ODCD10_MASK                        0x00000400
#define _ODCD_ODCD10_LENGTH                      0x00000001

#define _ODCD_ODCD13_POSITION                    0x0000000D
#define _ODCD_ODCD13_MASK                        0x00002000
#define _ODCD_ODCD13_LENGTH                      0x00000001

#define _CNPUD_CNPUD1_POSITION                   0x00000001
#define _CNPUD_CNPUD1_MASK                       0x00000002
#define _CNPUD_CNPUD1_LENGTH                     0x00000001

#define _CNPUD_CNPUD8_POSITION                   0x00000008
#define _CNPUD_CNPUD8_MASK                       0x00000100
#define _CNPUD_CNPUD8_LENGTH                     0x00000001

#define _CNPUD_CNPUD10_POSITION                  0x0000000A
#define _CNPUD_CNPUD10_MASK                      0x00000400
#define _CNPUD_CNPUD10_LENGTH                    0x00000001

#define _CNPUD_CNPUD13_POSITION                  0x0000000D
#define _CNPUD_CNPUD13_MASK                      0x00002000
#define _CNPUD_CNPUD13_LENGTH                    0x00000001

#define _CNPDD_CNPDD1_POSITION                   0x00000001
#define _CNPDD_CNPDD1_MASK                       0x00000002
#define _CNPDD_CNPDD1_LENGTH                     0x00000001

#define _CNPDD_CNPDD8_POSITION                   0x00000008
#define _CNPDD_CNPDD8_MASK                       0x00000100
#define _CNPDD_CNPDD8_LENGTH                     0x00000001

#define _CNPDD_CNPDD10_POSITION                  0x0000000A
#define _CNPDD_CNPDD10_MASK                      0x00000400
#define _CNPDD_CNPDD10_LENGTH                    0x00000001

#define _CNPDD_CNPDD13_POSITION                  0x0000000D
#define _CNPDD_CNPDD13_MASK                      0x00002000
#define _CNPDD_CNPDD13_LENGTH                    0x00000001

#define _CNCOND_CNSTYLE_POSITION                 0x0000000B
#define _CNCOND_CNSTYLE_MASK                     0x00000800
#define _CNCOND_CNSTYLE_LENGTH                   0x00000001

#define _CNCOND_ON_POSITION                      0x0000000F
#define _CNCOND_ON_MASK                          0x00008000
#define _CNCOND_ON_LENGTH                        0x00000001

#define _CNEN0D_CNEN0D1_POSITION                 0x00000001
#define _CNEN0D_CNEN0D1_MASK                     0x00000002
#define _CNEN0D_CNEN0D1_LENGTH                   0x00000001

#define _CNEN0D_CNEN0D8_POSITION                 0x00000008
#define _CNEN0D_CNEN0D8_MASK                     0x00000100
#define _CNEN0D_CNEN0D8_LENGTH                   0x00000001

#define _CNEN0D_CNEN0D10_POSITION                0x0000000A
#define _CNEN0D_CNEN0D10_MASK                    0x00000400
#define _CNEN0D_CNEN0D10_LENGTH                  0x00000001

#define _CNEN0D_CNEN0D13_POSITION                0x0000000D
#define _CNEN0D_CNEN0D13_MASK                    0x00002000
#define _CNEN0D_CNEN0D13_LENGTH                  0x00000001

#define _CNSTATD_CNSTATD1_POSITION               0x00000001
#define _CNSTATD_CNSTATD1_MASK                   0x00000002
#define _CNSTATD_CNSTATD1_LENGTH                 0x00000001

#define _CNSTATD_CNSTATD8_POSITION               0x00000008
#define _CNSTATD_CNSTATD8_MASK                   0x00000100
#define _CNSTATD_CNSTATD8_LENGTH                 0x00000001

#define _CNSTATD_CNSTATD10_POSITION              0x0000000A
#define _CNSTATD_CNSTATD10_MASK                  0x00000400
#define _CNSTATD_CNSTATD10_LENGTH                0x00000001

#define _CNSTATD_CNSTATD13_POSITION              0x0000000D
#define _CNSTATD_CNSTATD13_MASK                  0x00002000
#define _CNSTATD_CNSTATD13_LENGTH                0x00000001

#define _CNEN1D_CNEN1D1_POSITION                 0x00000001
#define _CNEN1D_CNEN1D1_MASK                     0x00000002
#define _CNEN1D_CNEN1D1_LENGTH                   0x00000001

#define _CNEN1D_CNEN1D8_POSITION                 0x00000008
#define _CNEN1D_CNEN1D8_MASK                     0x00000100
#define _CNEN1D_CNEN1D8_LENGTH                   0x00000001

#define _CNEN1D_CNEN1D10_POSITION                0x0000000A
#define _CNEN1D_CNEN1D10_MASK                    0x00000400
#define _CNEN1D_CNEN1D10_LENGTH                  0x00000001

#define _CNEN1D_CNEN1D13_POSITION                0x0000000D
#define _CNEN1D_CNEN1D13_MASK                    0x00002000
#define _CNEN1D_CNEN1D13_LENGTH                  0x00000001

#define _CNFD_CNFD1_POSITION                     0x00000001
#define _CNFD_CNFD1_MASK                         0x00000002
#define _CNFD_CNFD1_LENGTH                       0x00000001

#define _CNFD_CNFD8_POSITION                     0x00000008
#define _CNFD_CNFD8_MASK                         0x00000100
#define _CNFD_CNFD8_LENGTH                       0x00000001

#define _CNFD_CNFD10_POSITION                    0x0000000A
#define _CNFD_CNFD10_MASK                        0x00000400
#define _CNFD_CNFD10_LENGTH                      0x00000001

#define _CNFD_CNFD13_POSITION                    0x0000000D
#define _CNFD_CNFD13_MASK                        0x00002000
#define _CNFD_CNFD13_LENGTH                      0x00000001

#define _MBISTCON_MBISTEN_POSITION               0x00000000
#define _MBISTCON_MBISTEN_MASK                   0x00000001
#define _MBISTCON_MBISTEN_LENGTH                 0x00000001

#define _MBISTCON_MBISTSTAT_POSITION             0x00000004
#define _MBISTCON_MBISTSTAT_MASK                 0x00000010
#define _MBISTCON_MBISTSTAT_LENGTH               0x00000001

#define _MBISTCON_MBISTDONE_POSITION             0x00000007
#define _MBISTCON_MBISTDONE_MASK                 0x00000080
#define _MBISTCON_MBISTDONE_LENGTH               0x00000001

#define _MBISTCON_FLTINJ_POSITION                0x00000008
#define _MBISTCON_FLTINJ_MASK                    0x00000100
#define _MBISTCON_FLTINJ_LENGTH                  0x00000001

#define _U3MODE_MOD_POSITION                     0x00000000
#define _U3MODE_MOD_MASK                         0x0000000F
#define _U3MODE_MOD_LENGTH                       0x00000004

