gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
#define _I2C3CONH_SBCDE_POSITION                 0x00000002
#define _I2C3CONH_SBCDE_MASK                     0x00000004
#define _I2C3CONH_SBCDE_LENGTH                   0x00000001

#define _I2C3CONH_SDAHT_POSITION                 0x00000003
#define _I2C3CONH_SDAHT_MASK                     0x00000008
#define _I2C3CONH_SDAHT_LENGTH                   0x00000001

#define _I2C3CONH_BOEN_POSITION                  0x00000004
#define _I2C3CONH_BOEN_MASK                      0x00000010
#define _I2C3CONH_BOEN_LENGTH                    0x00000001

#define _I2C3CONH_SCIE_POSITION                  0x00000005
#define _I2C3CONH_SCIE_MASK                      0x00000020
#define _I2C3CONH_SCIE_LENGTH                    0x00000001

#define _I2C3CONH_PCIE_POSITION                  0x00000006
#define _I2C3CONH_PCIE_MASK                      0x00000040
#define _I2C3CONH_PCIE_LENGTH                    0x00000001

#define _I2C3STAT_TBF_POSITION                   0x00000000
#define _I2C3STAT_TBF_MASK                       0x00000001
#define _I2C3STAT_TBF_LENGTH                     0x00000001

#define _I2C3STAT_RBF_POSITION                   0x00000001
#define _I2C3STAT_RBF_MASK                       0x00000002
#define _I2C3STAT_RBF_LENGTH                     0x00000001

#define _I2C3STAT_R_W_POSITION                   0x00000002
#define _I2C3STAT_R_W_MASK                       0x00000004
#define _I2C3STAT_R_W_LENGTH                     0x00000001

#define _I2C3STAT_S_POSITION                     0x00000003
#define _I2C3STAT_S_MASK                         0x00000008
#define _I2C3STAT_S_LENGTH                       0x00000001

#define _I2C3STAT_P_POSITION                     0x00000004
#define _I2C3STAT_P_MASK                         0x00000010
#define _I2C3STAT_P_LENGTH                       0x00000001

#define _I2C3STAT_D_A_POSITION                   0x00000005
#define _I2C3STAT_D_A_MASK                       0x00000020
#define _I2C3STAT_D_A_LENGTH                     0x00000001

#define _I2C3STAT_I2COV_POSITION                 0x00000006
#define _I2C3STAT_I2COV_MASK                     0x00000040
#define _I2C3STAT_I2COV_LENGTH                   0x00000001

#define _I2C3STAT_IWCOL_POSITION                 0x00000007
#define _I2C3STAT_IWCOL_MASK                     0x00000080
#define _I2C3STAT_IWCOL_LENGTH                   0x00000001

#define _I2C3STAT_ADD10_POSITION                 0x00000008
#define _I2C3STAT_ADD10_MASK                     0x00000100
#define _I2C3STAT_ADD10_LENGTH                   0x00000001

#define _I2C3STAT_GCSTAT_POSITION                0x00000009
#define _I2C3STAT_GCSTAT_MASK                    0x00000200
#define _I2C3STAT_GCSTAT_LENGTH                  0x00000001

#define _I2C3STAT_BCL_POSITION                   0x0000000A
#define _I2C3STAT_BCL_MASK                       0x00000400
#define _I2C3STAT_BCL_LENGTH                     0x00000001

#define _I2C3STAT_ACKTIM_POSITION                0x0000000D
#define _I2C3STAT_ACKTIM_MASK                    0x00002000
#define _I2C3STAT_ACKTIM_LENGTH                  0x00000001

#define _I2C3STAT_TRSTAT_POSITION                0x0000000E
#define _I2C3STAT_TRSTAT_MASK                    0x00004000
#define _I2C3STAT_TRSTAT_LENGTH                  0x00000001

#define _I2C3STAT_ACKSTAT_POSITION               0x0000000F
#define _I2C3STAT_ACKSTAT_MASK                   0x00008000
#define _I2C3STAT_ACKSTAT_LENGTH                 0x00000001

#define _I2C3ADD_ADD_POSITION                    0x00000000
#define _I2C3ADD_ADD_MASK                        0x000003FF
#define _I2C3ADD_ADD_LENGTH                      0x0000000A

#define _I2C3MSK_AMSK_POSITION                   0x00000000
#define _I2C3MSK_AMSK_MASK                       0x000003FF
#define _I2C3MSK_AMSK_LENGTH                     0x0000000A

#define _I2C3MSK_AMSK0_POSITION                  0x00000000
#define _I2C3MSK_AMSK0_MASK                      0x00000001
#define _I2C3MSK_AMSK0_LENGTH                    0x00000001

#define _I2C3MSK_AMSK1_POSITION                  0x00000001
#define _I2C3MSK_AMSK1_MASK                      0x00000002
#define _I2C3MSK_AMSK1_LENGTH                    0x00000001

#define _I2C3MSK_AMSK2_POSITION                  0x00000002
#define _I2C3MSK_AMSK2_MASK                      0x00000004
#define _I2C3MSK_AMSK2_LENGTH                    0x00000001

#define _I2C3MSK_AMSK3_POSITION                  0x00000003
#define _I2C3MSK_AMSK3_MASK                      0x00000008
#define _I2C3MSK_AMSK3_LENGTH                    0x00000001

#define _I2C3MSK_AMSK4_POSITION                  0x00000004
#define _I2C3MSK_AMSK4_MASK                      0x00000010
#define _I2C3MSK_AMSK4_LENGTH                    0x00000001

#define _I2C3MSK_AMSK5_POSITION                  0x00000005
#define _I2C3MSK_AMSK5_MASK                      0x00000020
#define _I2C3MSK_AMSK5_LENGTH                    0x00000001

#define _I2C3MSK_AMSK6_POSITION                  0x00000006
#define _I2C3MSK_AMSK6_MASK                      0x00000040
#define _I2C3MSK_AMSK6_LENGTH                    0x00000001

#define _I2C3MSK_AMSK7_POSITION                  0x00000007
#define _I2C3MSK_AMSK7_MASK                      0x00000080
#define _I2C3MSK_AMSK7_LENGTH                    0x00000001

#define _I2C3MSK_AMSK8_POSITION                  0x00000008
#define _I2C3MSK_AMSK8_MASK                      0x00000100
#define _I2C3MSK_AMSK8_LENGTH                    0x00000001

#define _I2C3MSK_AMSK9_POSITION                  0x00000009
#define _I2C3MSK_AMSK9_MASK                      0x00000200
#define _I2C3MSK_AMSK9_LENGTH                    0x00000001

#define _I2C3TRN_I2CTXDATA_POSITION              0x00000000
#define _I2C3TRN_I2CTXDATA_MASK                  0x000000FF
#define _I2C3TRN_I2CTXDATA_LENGTH                0x00000008

#define _I2C3RCV_I2CRXDATA_POSITION              0x00000000
#define _I2C3RCV_I2CRXDATA_MASK                  0x000000FF
#define _I2C3RCV_I2CRXDATA_LENGTH                0x00000008

#define _RCON_POR_POSITION                       0x00000000
#define _RCON_POR_MASK                           0x00000001
#define _RCON_POR_LENGTH                         0x00000001

