gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
#define _WDTCONL_ON_POSITION                     0x0000000F
#define _WDTCONL_ON_MASK                         0x00008000
#define _WDTCONL_ON_LENGTH                       0x00000001

#define _REFOCON1_ROSEL_POSITION                 0x00000000
#define _REFOCON1_ROSEL_MASK                     0x0000000F
#define _REFOCON1_ROSEL_LENGTH                   0x00000004

#define _REFOCON1_ROACTIVE_POSITION              0x00000008
#define _REFOCON1_ROACTIVE_MASK                  0x00000100
#define _REFOCON1_ROACTIVE_LENGTH                0x00000001

#define _REFOCON1_ROSWEN_POSITION                0x00000009
#define _REFOCON1_ROSWEN_MASK                    0x00000200
#define _REFOCON1_ROSWEN_LENGTH                  0x00000001

#define _REFOCON1_ROSLP_POSITION                 0x0000000B
#define _REFOCON1_ROSLP_MASK                     0x00000800
#define _REFOCON1_ROSLP_LENGTH                   0x00000001

#define _REFOCON1_ROOUT_POSITION                 0x0000000C
#define _REFOCON1_ROOUT_MASK                     0x00001000
#define _REFOCON1_ROOUT_LENGTH                   0x00000001

#define _REFOCON1_ROSIDL_POSITION                0x0000000D
#define _REFOCON1_ROSIDL_MASK                    0x00002000
#define _REFOCON1_ROSIDL_LENGTH                  0x00000001

#define _REFOCON1_ROEN_POSITION                  0x0000000F
#define _REFOCON1_ROEN_MASK                      0x00008000
#define _REFOCON1_ROEN_LENGTH                    0x00000001

#define _REFOCON1_ROSEL0_POSITION                0x00000000
#define _REFOCON1_ROSEL0_MASK                    0x00000001
#define _REFOCON1_ROSEL0_LENGTH                  0x00000001

#define _REFOCON1_ROSEL1_POSITION                0x00000001
#define _REFOCON1_ROSEL1_MASK                    0x00000002
#define _REFOCON1_ROSEL1_LENGTH                  0x00000001

#define _REFOCON1_ROSEL2_POSITION                0x00000002
#define _REFOCON1_ROSEL2_MASK                    0x00000004
#define _REFOCON1_ROSEL2_LENGTH                  0x00000001

#define _REFOCON1_ROSEL3_POSITION                0x00000003
#define _REFOCON1_ROSEL3_MASK                    0x00000008
#define _REFOCON1_ROSEL3_LENGTH                  0x00000001

#define _REFOCONL_ROSEL_POSITION                 0x00000000
#define _REFOCONL_ROSEL_MASK                     0x0000000F
#define _REFOCONL_ROSEL_LENGTH                   0x00000004

#define _REFOCONL_ROACTIVE_POSITION              0x00000008
#define _REFOCONL_ROACTIVE_MASK                  0x00000100
#define _REFOCONL_ROACTIVE_LENGTH                0x00000001

#define _REFOCONL_ROSWEN_POSITION                0x00000009
#define _REFOCONL_ROSWEN_MASK                    0x00000200
#define _REFOCONL_ROSWEN_LENGTH                  0x00000001

#define _REFOCONL_ROSLP_POSITION                 0x0000000B
#define _REFOCONL_ROSLP_MASK                     0x00000800
#define _REFOCONL_ROSLP_LENGTH                   0x00000001

#define _REFOCONL_ROOUT_POSITION                 0x0000000C
#define _REFOCONL_ROOUT_MASK                     0x00001000
#define _REFOCONL_ROOUT_LENGTH                   0x00000001

#define _REFOCONL_ROSIDL_POSITION                0x0000000D
#define _REFOCONL_ROSIDL_MASK                    0x00002000
#define _REFOCONL_ROSIDL_LENGTH                  0x00000001

#define _REFOCONL_ROEN_POSITION                  0x0000000F
#define _REFOCONL_ROEN_MASK                      0x00008000
#define _REFOCONL_ROEN_LENGTH                    0x00000001

#define _REFOCONL_ROSEL0_POSITION                0x00000000
#define _REFOCONL_ROSEL0_MASK                    0x00000001
#define _REFOCONL_ROSEL0_LENGTH                  0x00000001

#define _REFOCONL_ROSEL1_POSITION                0x00000001
#define _REFOCONL_ROSEL1_MASK                    0x00000002
#define _REFOCONL_ROSEL1_LENGTH                  0x00000001

#define _REFOCONL_ROSEL2_POSITION                0x00000002
#define _REFOCONL_ROSEL2_MASK                    0x00000004
#define _REFOCONL_ROSEL2_LENGTH                  0x00000001

#define _REFOCONL_ROSEL3_POSITION                0x00000003
#define _REFOCONL_ROSEL3_MASK                    0x00000008
#define _REFOCONL_ROSEL3_LENGTH                  0x00000001

#define _REFOCON2_RODIV_POSITION                 0x00000000
#define _REFOCON2_RODIV_MASK                     0x00007FFF
#define _REFOCON2_RODIV_LENGTH                   0x0000000F

#define _REFOCON2_RODIV0_POSITION                0x00000000
#define _REFOCON2_RODIV0_MASK                    0x00000001
#define _REFOCON2_RODIV0_LENGTH                  0x00000001

#define _REFOCON2_RODIV1_POSITION                0x00000001
#define _REFOCON2_RODIV1_MASK                    0x00000002
#define _REFOCON2_RODIV1_LENGTH                  0x00000001

#define _REFOCON2_RODIV2_POSITION                0x00000002
#define _REFOCON2_RODIV2_MASK                    0x00000004
#define _REFOCON2_RODIV2_LENGTH                  0x00000001

#define _REFOCON2_RODIV3_POSITION                0x00000003
#define _REFOCON2_RODIV3_MASK                    0x00000008
#define _REFOCON2_RODIV3_LENGTH                  0x00000001

#define _REFOCON2_RODIV4_POSITION                0x00000004
#define _REFOCON2_RODIV4_MASK                    0x00000010
#define _REFOCON2_RODIV4_LENGTH                  0x00000001

#define _REFOCON2_RODIV5_POSITION                0x00000005
#define _REFOCON2_RODIV5_MASK                    0x00000020
#define _REFOCON2_RODIV5_LENGTH                  0x00000001

#define _REFOCON2_RODIV6_POSITION                0x00000006
#define _REFOCON2_RODIV6_MASK                    0x00000040
#define _REFOCON2_RODIV6_LENGTH                  0x00000001

#define _REFOCON2_RODIV7_POSITION                0x00000007
#define _REFOCON2_RODIV7_MASK                    0x00000080
#define _REFOCON2_RODIV7_LENGTH                  0x00000001

#define _REFOCON2_RODIV8_POSITION                0x00000008
#define _REFOCON2_RODIV8_MASK                    0x00000100
#define _REFOCON2_RODIV8_LENGTH                  0x00000001

#define _REFOCON2_RODIV9_POSITION                0x00000009
#define _REFOCON2_RODIV9_MASK                    0x00000200
#define _REFOCON2_RODIV9_LENGTH                  0x00000001

#define _REFOCON2_RODIV10_POSITION               0x0000000A
#define _REFOCON2_RODIV10_MASK                   0x00000400
#define _REFOCON2_RODIV10_LENGTH                 0x00000001

