gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
#define _REFOCON2_RODIV11_POSITION               0x0000000B
#define _REFOCON2_RODIV11_MASK                   0x00000800
#define _REFOCON2_RODIV11_LENGTH                 0x00000001

#define _REFOCON2_RODIV12_POSITION               0x0000000C
#define _REFOCON2_RODIV12_MASK                   0x00001000
#define _REFOCON2_RODIV12_LENGTH                 0x00000001

#define _REFOCON2_RODIV13_POSITION               0x0000000D
#define _REFOCON2_RODIV13_MASK                   0x00002000
#define _REFOCON2_RODIV13_LENGTH                 0x00000001

#define _REFOCON2_RODIV14_POSITION               0x0000000E
#define _REFOCON2_RODIV14_MASK                   0x00004000
#define _REFOCON2_RODIV14_LENGTH                 0x00000001

#define _REFOCONH_RODIV_POSITION                 0x00000000
#define _REFOCONH_RODIV_MASK                     0x00007FFF
#define _REFOCONH_RODIV_LENGTH                   0x0000000F

#define _REFOCONH_RODIV0_POSITION                0x00000000
#define _REFOCONH_RODIV0_MASK                    0x00000001
#define _REFOCONH_RODIV0_LENGTH                  0x00000001

#define _REFOCONH_RODIV1_POSITION                0x00000001
#define _REFOCONH_RODIV1_MASK                    0x00000002
#define _REFOCONH_RODIV1_LENGTH                  0x00000001

#define _REFOCONH_RODIV2_POSITION                0x00000002
#define _REFOCONH_RODIV2_MASK                    0x00000004
#define _REFOCONH_RODIV2_LENGTH                  0x00000001

#define _REFOCONH_RODIV3_POSITION                0x00000003
#define _REFOCONH_RODIV3_MASK                    0x00000008
#define _REFOCONH_RODIV3_LENGTH                  0x00000001

#define _REFOCONH_RODIV4_POSITION                0x00000004
#define _REFOCONH_RODIV4_MASK                    0x00000010
#define _REFOCONH_RODIV4_LENGTH                  0x00000001

#define _REFOCONH_RODIV5_POSITION                0x00000005
#define _REFOCONH_RODIV5_MASK                    0x00000020
#define _REFOCONH_RODIV5_LENGTH                  0x00000001

#define _REFOCONH_RODIV6_POSITION                0x00000006
#define _REFOCONH_RODIV6_MASK                    0x00000040
#define _REFOCONH_RODIV6_LENGTH                  0x00000001

#define _REFOCONH_RODIV7_POSITION                0x00000007
#define _REFOCONH_RODIV7_MASK                    0x00000080
#define _REFOCONH_RODIV7_LENGTH                  0x00000001

#define _REFOCONH_RODIV8_POSITION                0x00000008
#define _REFOCONH_RODIV8_MASK                    0x00000100
#define _REFOCONH_RODIV8_LENGTH                  0x00000001

#define _REFOCONH_RODIV9_POSITION                0x00000009
#define _REFOCONH_RODIV9_MASK                    0x00000200
#define _REFOCONH_RODIV9_LENGTH                  0x00000001

#define _REFOCONH_RODIV10_POSITION               0x0000000A
#define _REFOCONH_RODIV10_MASK                   0x00000400
#define _REFOCONH_RODIV10_LENGTH                 0x00000001

#define _REFOCONH_RODIV11_POSITION               0x0000000B
#define _REFOCONH_RODIV11_MASK                   0x00000800
#define _REFOCONH_RODIV11_LENGTH                 0x00000001

#define _REFOCONH_RODIV12_POSITION               0x0000000C
#define _REFOCONH_RODIV12_MASK                   0x00001000
#define _REFOCONH_RODIV12_LENGTH                 0x00000001

#define _REFOCONH_RODIV13_POSITION               0x0000000D
#define _REFOCONH_RODIV13_MASK                   0x00002000
#define _REFOCONH_RODIV13_LENGTH                 0x00000001

#define _REFOCONH_RODIV14_POSITION               0x0000000E
#define _REFOCONH_RODIV14_MASK                   0x00004000
#define _REFOCONH_RODIV14_LENGTH                 0x00000001

#define _REFOTRIMH_ROTRIM_POSITION               0x00000007
#define _REFOTRIMH_ROTRIM_MASK                   0x0000FF80
#define _REFOTRIMH_ROTRIM_LENGTH                 0x00000009

#define _PCTRAPH_PCTRAPH_POSITION                0x00000000
#define _PCTRAPH_PCTRAPH_MASK                    0x000000FF
#define _PCTRAPH_PCTRAPH_LENGTH                  0x00000008

#define _FEXH_FEXL_POSITION                      0x00000000
#define _FEXH_FEXL_MASK                          0x000000FF
#define _FEXH_FEXL_LENGTH                        0x00000008

#define _FEX2H_FEX2H_POSITION                    0x00000000
#define _FEX2H_FEX2H_MASK                        0x000000FF
#define _FEX2H_FEX2H_LENGTH                      0x00000008

#define _DPCH_DPCH_POSITION                      0x00000000
#define _DPCH_DPCH_MASK                          0x000000FF
#define _DPCH_DPCH_LENGTH                        0x00000008

#define _APPS_APIFUL_POSITION                    0x00000000
#define _APPS_APIFUL_MASK                        0x00000001
#define _APPS_APIFUL_LENGTH                      0x00000001

#define _APPS_APIOV_POSITION                     0x00000001
#define _APPS_APIOV_MASK                         0x00000002
#define _APPS_APIOV_LENGTH                       0x00000001

#define _APPS_APOFUL_POSITION                    0x00000002
#define _APPS_APOFUL_MASK                        0x00000004
#define _APPS_APOFUL_LENGTH                      0x00000001

#define _APPS_APOOV_POSITION                     0x00000003
#define _APPS_APOOV_MASK                         0x00000008
#define _APPS_APOOV_LENGTH                       0x00000001

#define _APPS_STRFUL_POSITION                    0x00000004
#define _APPS_STRFUL_MASK                        0x00000010
#define _APPS_STRFUL_LENGTH                      0x00000001



/* -------------------------------------------------------- */
/* Macros for setting device configuration registers        */
/* -------------------------------------------------------- */

/* Fuses that are always present */

/* Register FBOOT (0x801800)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FBOOT;
#define _FBOOT(x) __attribute__((address(0x801800),deprecated_definition("consider migrating to #pragma config"),section("__FBOOT.sec"),space(prog))) __prog__ uint16_t _FBOOT = (x);

/*
** Only one invocation of FBOOT should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FBOOT.
** Multiple options may be combined, as shown:
**
** _FBOOT( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Device Boot Mode Configuration:
**     BTMODE_DUALPRIV      Device is in Dual Partition Privilege mode
**     BTMODE_DUALPROT      Device is in Dual Partition Protected mode
**     BTMODE_DUAL          Device is in Dual Partition mode
**     BTMODE_SINGLE        Device is in Single Boot (legacy) mode
**
*/

