gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
#define RCLKSEL_FCY          0xFFBF
#define RCLKSEL_FRC          0xFFDF
#define RCLKSEL_LPRC         0xFFFF

#define WINDIS_OFF           0xFF7F
#define WINDIS_ON            0xFFFF

#define WDTWIN_WIN75         0xFCFF
#define WDTWIN_WIN50         0xFDFF
#define WDTWIN_WIN37         0xFEFF
#define WDTWIN_WIN25         0xFFFF

#define SWDTPS_PS1           0x83FF
#define SWDTPS_PS2           0x87FF
#define SWDTPS_PS4           0x8BFF
#define SWDTPS_PS8           0x8FFF
#define SWDTPS_PS16          0x93FF
#define SWDTPS_PS32          0x97FF
#define SWDTPS_PS64          0x9BFF
#define SWDTPS_PS128         0x9FFF
#define SWDTPS_PS256         0xA3FF
#define SWDTPS_PS512         0xA7FF
#define SWDTPS_PS1024        0xABFF
#define SWDTPS_PS2048        0xAFFF
#define SWDTPS_PS4096        0xB3FF
#define SWDTPS_PS8192        0xB7FF
#define SWDTPS_PS16384       0xBBFF
#define SWDTPS_PS32768       0xBFFF
#define SWDTPS_PS65536       0xC3FF
#define SWDTPS_PS131072      0xC7FF
#define SWDTPS_PS262144      0xCBFF
#define SWDTPS_PS524288      0xCFFF
#define SWDTPS_PS1048576     0xD3FF

#define FWDTEN_ON_SW         0x7FFF
#define FWDTEN_ON            0xFFFF

/* Register FPOR (0x2bf24)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FPOR;
#define _FPOR(x) __attribute__((address(0x2bf24),deprecated_definition("consider migrating to #pragma config"),section("__FPOR.sec"),space(prog))) __prog__ uint16_t _FPOR = (x);

/*
** Only one invocation of FPOR should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FPOR.
** Multiple options may be combined, as shown:
**
** _FPOR( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Memory BIST Feature Disable:
**     BISTDIS_ENABLED      mBIST on reset feature enabled
**     BISTDIS_DISABLED     mBIST on reset feature disabled
**
*/

#define BISTDIS_ENABLED      0x0000
#define BISTDIS_DISABLED     0x0040

/* Register FICD (0x2bf28)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FICD;
#define _FICD(x) __attribute__((address(0x2bf28),deprecated_definition("consider migrating to #pragma config"),section("__FICD.sec"),space(prog))) __prog__ uint16_t _FICD = (x);

/*
** Only one invocation of FICD should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FICD.
** Multiple options may be combined, as shown:
**
** _FICD( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   ICD Communication Channel Select bits:
**     ICS_NONE             Reserved, do not use
**     ICS_PGD3             Communicate on PGC3 and PGD3
**     ICS_PGD2             Communicate on PGC2 and PGD2
**     ICS_PGD1             Communicate on PGC1 and PGD1
**
**   JTAG Enable bit:
**     JTAGEN_OFF           JTAG is disabled
**     JTAGEN_ON            JTAG is enabled
**
**   BOOTSWP instruction disable bit:
**     NOBTSWP_ENABLED      BOOTSWP instruction is enabled
**     NOBTSWP_DISABLED     BOOTSWP instruction is disabled
**
*/

#define ICS_NONE             0x80A0
#define ICS_PGD3             0x80A1
#define ICS_PGD2             0x80A2
#define ICS_PGD1             0x80A3

#define JTAGEN_OFF           0x8083
#define JTAGEN_ON            0x80A3

#define NOBTSWP_ENABLED      0x00A3
#define NOBTSWP_DISABLED     0x80A3

/* Register FDMTIVTL (0x2bf2c)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FDMTIVTL;
#define _FDMTIVTL(x) __attribute__((address(0x2bf2c),deprecated_definition("consider migrating to #pragma config"),section("__FDMTIVTL.sec"),space(prog))) __prog__ uint16_t _FDMTIVTL = (x);

/*
** Only one invocation of FDMTIVTL should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FDMTIVTL.
** Multiple options may be combined, as shown:
**
** _FDMTIVTL( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Dead Man Timer Interval low word:
**     DMTIVTL_DMTIVTL      Lower 16 bits of 32 bitDMT window interval (0-0xFFFF)
**
*/

#define DMTIVTL_DMTIVTL      0x0000

/* Register FDMTIVTH (0x2bf30)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FDMTIVTH;
#define _FDMTIVTH(x) __attribute__((address(0x2bf30),deprecated_definition("consider migrating to #pragma config"),section("__FDMTIVTH.sec"),space(prog))) __prog__ uint16_t _FDMTIVTH = (x);

/*
** Only one invocation of FDMTIVTH should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FDMTIVTH.
** Multiple options may be combined, as shown:
**
** _FDMTIVTH( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Dead Man Timer Interval high word:
**     DMTIVTH_DMTIVTH      Uper 16 bits of 32 bitDMT window interval (0-0xFFFF)
**
*/

#define DMTIVTH_DMTIVTH      0x0000

/* Register FDMTCNTL (0x2bf34)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FDMTCNTL;
#define _FDMTCNTL(x) __attribute__((address(0x2bf34),deprecated_definition("consider migrating to #pragma config"),section("__FDMTCNTL.sec"),space(prog))) __prog__ uint16_t _FDMTCNTL = (x);

/*
** Only one invocation of FDMTCNTL should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FDMTCNTL.
** Multiple options may be combined, as shown:
**
** _FDMTCNTL( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Lower 16 bits of 32 bit DMT instruction count time-out value (0-0xFFFF):
**     DMTCNTL_DMTCNTL      Lower 16 bits of 32 bit DMT instruction count time-out value (0-0xFFFF)
**
*/

#define DMTCNTL_DMTCNTL      0x0000

/* Register FDMTCNTH (0x2bf38)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FDMTCNTH;
#define _FDMTCNTH(x) __attribute__((address(0x2bf38),deprecated_definition("consider migrating to #pragma config"),section("__FDMTCNTH.sec"),space(prog))) __prog__ uint16_t _FDMTCNTH = (x);

