gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
/*
** Only one invocation of FDMTCNTH should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FDMTCNTH.
** Multiple options may be combined, as shown:
**
** _FDMTCNTH( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Upper 16 bits of 32 bit DMT instruction count time-out value (0-0xFFFF):
**     DMTCNTH_DMTCNTH      Upper 16 bits of 32 bit DMT instruction count time-out value (0-0xFFFF)
**
*/

#define DMTCNTH_DMTCNTH      0x0000

/* Register FDMT (0x2bf3c)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FDMT;
#define _FDMT(x) __attribute__((address(0x2bf3c),deprecated_definition("consider migrating to #pragma config"),section("__FDMT.sec"),space(prog))) __prog__ uint16_t _FDMT = (x);

/*
** Only one invocation of FDMT should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FDMT.
** Multiple options may be combined, as shown:
**
** _FDMT( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Dead Man Timer Disable bit:
**     DMTDIS_ON            Dead Man Timer is Enabled and cannot be disabled by software
**     DMTDIS_OFF           Dead Man Timer is Disabled and can be enabled by software
**
*/

#define DMTDIS_ON            0x0000
#define DMTDIS_OFF           0x0001

/* Register FDEVOPT (0x2bf40)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FDEVOPT;
#define _FDEVOPT(x) __attribute__((address(0x2bf40),deprecated_definition("consider migrating to #pragma config"),section("__FDEVOPT.sec"),space(prog))) __prog__ uint16_t _FDEVOPT = (x);

/*
** Only one invocation of FDEVOPT should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FDEVOPT.
** Multiple options may be combined, as shown:
**
** _FDEVOPT( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Alternate I2C1 Pin bit:
**     ALTI2C1_ON           I2C1 mapped to ASDA1/ASCL1 pins
**     ALTI2C1_OFF          I2C1 mapped to SDA1/SCL1 pins
**
**   Alternate I2C2 Pin bit:
**     ALTI2C2_ON           I2C2 mapped to ASDA2/ASCL2 pins
**     ALTI2C2_OFF          I2C2 mapped to SDA2/SCL2 pins
**
**   Alternate I2C3 Pin bit:
**     ALTI2C3_ON           I2C3 mapped to ASDA3/ASCL3 pins
**     ALTI2C3_OFF          I2C3 mapped to SDA3/SCL3 pins
**
**   SM Bus Enable:
**     SMBEN_STANDARD       Standard I2C input threshold operation
**     SMBEN_SMBUS          SMBus input threshold is enabled
**
**   SPI2 Pin Select bit:
**     SPI2PIN_DEDICATED    SPI2 uses dedicated I/O pins
**     SPI2PIN_PPS          SPI2 uses I/O remap (PPS) pins
**
*/

#define ALTI2C1_ON           0x2730
#define ALTI2C1_OFF          0x2738

#define ALTI2C2_ON           0x2728
#define ALTI2C2_OFF          0x2738

#define ALTI2C3_ON           0x2718
#define ALTI2C3_OFF          0x2738

#define SMBEN_STANDARD       0x2338
#define SMBEN_SMBUS          0x2738

#define SPI2PIN_DEDICATED    0x0738
#define SPI2PIN_PPS          0x2738

/* Register FALTREG (0x2bf44)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FALTREG;
#define _FALTREG(x) __attribute__((address(0x2bf44),deprecated_definition("consider migrating to #pragma config"),section("__FALTREG.sec"),space(prog))) __prog__ uint16_t _FALTREG = (x);

/*
** Only one invocation of FALTREG should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FALTREG.
** Multiple options may be combined, as shown:
**
** _FALTREG( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Specifies Interrupt Priority Level (IPL) Associated to Alternate Working Register 1 bits:
**     CTXT1_IPL1           Alternate Register set assigned to IPL level 1
**     CTXT1_IPL2           Alternate Register set assigned to IPL level 2
**     CTXT1_IPL3           Alternate Register set assigned to IPL level 3
**     CTXT1_IPL4           Alternate Register set assigned to IPL level 4
**     CTXT1_IPL5           Alternate Register set assigned to IPL level 5
**     CTXT1_IPL6           Alternate Register set assigned to IPL level 6
**     CTXT1_IPL7           Alternate Register set assigned to IPL level 7
**     CTXT1_OFF            Not Assigned
**
**   Specifies Interrupt Priority Level (IPL) Associated to Alternate Working Register 2 bits:
**     CTXT2_IPL1           Alternate Register set assigned to IPL level 1
**     CTXT2_IPL2           Alternate Register set assigned to IPL level 2
**     CTXT2_IPL3           Alternate Register set assigned to IPL level 3
**     CTXT2_IPL4           Alternate Register set assigned to IPL level 4
**     CTXT2_IPL5           Alternate Register set assigned to IPL level 5
**     CTXT2_IPL6           Alternate Register set assigned to IPL level 6
**     CTXT2_IPL7           Alternate Register set assigned to IPL level 7
**     CTXT2_OFF            Not Assigned
**
**   Specifies Interrupt Priority Level (IPL) Associated to Alternate Working Register 3 bits:
**     CTXT3_IPL1           Alternate Register set assigned to IPL level 1
**     CTXT3_IPL2           Alternate Register set assigned to IPL level 2
**     CTXT3_IPL3           Alternate Register set assigned to IPL level 3
**     CTXT3_IPL4           Alternate Register set assigned to IPL level 4
**     CTXT3_IPL5           Alternate Register set assigned to IPL level 5
**     CTXT3_IPL6           Alternate Register set assigned to IPL level 6
**     CTXT3_IPL7           Alternate Register set assigned to IPL level 7
**     CTXT3_OFF            Not Assigned
**
**   Specifies Interrupt Priority Level (IPL) Associated to Alternate Working Register 4 bits:
**     CTXT4_IPL1           Alternate Register set assigned to IPL level 1
**     CTXT4_IPL2           Alternate Register set assigned to IPL level 2
**     CTXT4_IPL3           Alternate Register set assigned to IPL level 3
**     CTXT4_IPL4           Alternate Register set assigned to IPL level 4
**     CTXT4_IPL5           Alternate Register set assigned to IPL level 5
**     CTXT4_IPL6           Alternate Register set assigned to IPL level 6
**     CTXT4_IPL7           Alternate Register set assigned to IPL level 7
**     CTXT4_OFF            Not Assigned
**
*/

#define CTXT1_IPL1           0x7770
#define CTXT1_IPL2           0x7771
#define CTXT1_IPL3           0x7772
#define CTXT1_IPL4           0x7773
#define CTXT1_IPL5           0x7774
#define CTXT1_IPL6           0x7775
#define CTXT1_IPL7           0x7776
#define CTXT1_OFF            0x7777

#define CTXT2_IPL1           0x7707
#define CTXT2_IPL2           0x7717
#define CTXT2_IPL3           0x7727
#define CTXT2_IPL4           0x7737
#define CTXT2_IPL5           0x7747
#define CTXT2_IPL6           0x7757
#define CTXT2_IPL7           0x7767
#define CTXT2_OFF            0x7777

#define CTXT3_IPL1           0x7077
#define CTXT3_IPL2           0x7177
#define CTXT3_IPL3           0x7277
#define CTXT3_IPL4           0x7377
#define CTXT3_IPL5           0x7477
#define CTXT3_IPL6           0x7577
#define CTXT3_IPL7           0x7677
#define CTXT3_OFF            0x7777

#define CTXT4_IPL1           0x0777
#define CTXT4_IPL2           0x1777
#define CTXT4_IPL3           0x2777
#define CTXT4_IPL4           0x3777
#define CTXT4_IPL5           0x4777
#define CTXT4_IPL6           0x5777
#define CTXT4_IPL7           0x6777
#define CTXT4_OFF            0x7777

/* Register FBTSEQ (0x2bffc)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FBTSEQ;
#define _FBTSEQ(x) __attribute__((address(0x2bffc),deprecated_definition("consider migrating to #pragma config"),section("__FBTSEQ.sec"),space(prog))) __prog__ uint16_t _FBTSEQ = (x);

