gitromrein/dina_pdsv_master/firmware.x/p33CK256MP505.h
/*
** Only one invocation of FBTSEQ should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FBTSEQ.
** Multiple options may be combined, as shown:
**
** _FBTSEQ( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Relative value defining which partition will be active after device Reset; the partition containing a lower boot number will be active:
**     BSEQ_BSEQ            Boot Sequence Number bits
**
**   The one's complement of BSEQ; must be calculated by the user and written during device programming.:
**     IBSEQ_IBSEQ          Inverse Boot Sequence Number bits
**
*/

#define BSEQ_BSEQ            0xF000

#define IBSEQ_IBSEQ          0xFF0FFF

#endif



/*
 * Flash Programming Information
 */

#undef _FLASH_PAGE
#define _FLASH_PAGE 0x400

#undef _FLASH_ROW
#define _FLASH_ROW 0x80

/*
 * Memory Segments Sizes
 */


/*
 * Memory Segments Sizes that are always present
 */

#define __AIVT_BASE 0x0
#define __AIVT_LENGTH 0x200

#define __IWRI1_BASE 0x801034
#define __IWRI1_LENGTH 0x4

#define __IWRI2_BASE 0x801038
#define __IWRI2_LENGTH 0x4

#define __FBOOT_BASE 0x801800
#define __FBOOT_LENGTH 0x2

#define __DEVID_BASE 0xff0000
#define __DEVID_LENGTH 0x4


/*
 * Single panel memory sizes
 */

#ifndef __DUAL_PARTITION
#define __AIVT_BASE 0x0
#define __AIVT_LENGTH 0x200

#define __RESET_BASE 0x0
#define __RESET_LENGTH 0x4

#define __IVT_BASE 0x4
#define __IVT_LENGTH 0x1fc

#define __PROGRAM_BASE 0x200
#define __PROGRAM_LENGTH 0x2bd00

#define __FSEC_BASE 0x2bf00
#define __FSEC_LENGTH 0x2

#define __FBSLIM_BASE 0x2bf10
#define __FBSLIM_LENGTH 0x2

#define __FSIGN_BASE 0x2bf14
#define __FSIGN_LENGTH 0x2

#define __FOSCSEL_BASE 0x2bf18
#define __FOSCSEL_LENGTH 0x2

#define __FOSC_BASE 0x2bf1c
#define __FOSC_LENGTH 0x2

#define __FWDT_BASE 0x2bf20
#define __FWDT_LENGTH 0x2

#define __FPOR_BASE 0x2bf24
#define __FPOR_LENGTH 0x2

#define __FICD_BASE 0x2bf28
#define __FICD_LENGTH 0x2

#define __FDMTIVTL_BASE 0x2bf2c
#define __FDMTIVTL_LENGTH 0x2

#define __FDMTIVTH_BASE 0x2bf30
#define __FDMTIVTH_LENGTH 0x2

#define __FDMTCNTL_BASE 0x2bf34
#define __FDMTCNTL_LENGTH 0x2

#define __FDMTCNTH_BASE 0x2bf38
#define __FDMTCNTH_LENGTH 0x2

#define __FDMT_BASE 0x2bf3c
#define __FDMT_LENGTH 0x2

#define __FDEVOPT_BASE 0x2bf40
#define __FDEVOPT_LENGTH 0x2

#define __FALTREG_BASE 0x2bf44
#define __FALTREG_LENGTH 0x2

#define __FBTSEQ_BASE 0x2bffc
#define __FBTSEQ_LENGTH 0x2

#endif


/*
 * Dual panel memory sizes
 */

#ifdef __DUAL_PARTITION
#define __AIVT_BASE 0x0
#define __AIVT_LENGTH 0x200

#define __RESET_BASE 0x0
#define __RESET_LENGTH 0x4

#define __IVT_BASE 0x4
#define __IVT_LENGTH 0x1fc

#define __PROGRAM_BASE 0x200
#define __PROGRAM_LENGTH 0x15d00

#define __FSEC_BASE 0x15f00
#define __FSEC_LENGTH 0x2

#define __FBSLIM_BASE 0x15f10
#define __FBSLIM_LENGTH 0x2

#define __FSIGN_BASE 0x15f14
#define __FSIGN_LENGTH 0x2

#define __FOSCSEL_BASE 0x15f18
#define __FOSCSEL_LENGTH 0x2

#define __FOSC_BASE 0x15f1c
#define __FOSC_LENGTH 0x2

#define __FWDT_BASE 0x15f20
#define __FWDT_LENGTH 0x2

#define __FPOR_BASE 0x15f24
#define __FPOR_LENGTH 0x2

#define __FICD_BASE 0x15f28
#define __FICD_LENGTH 0x2

#define __FDMTIVTL_BASE 0x15f2c
#define __FDMTIVTL_LENGTH 0x2

#define __FDMTIVTH_BASE 0x15f30
#define __FDMTIVTH_LENGTH 0x2

#define __FDMTCNTL_BASE 0x15f34
#define __FDMTCNTL_LENGTH 0x2

#define __FDMTCNTH_BASE 0x15f38
#define __FDMTCNTH_LENGTH 0x2

#define __FDMT_BASE 0x15f3c
#define __FDMT_LENGTH 0x2

#define __FDEVOPT_BASE 0x15f40
#define __FDEVOPT_LENGTH 0x2

#define __FALTREG_BASE 0x15f44
#define __FALTREG_LENGTH 0x2

#define __FBTSEQ_BASE 0x15ffc
#define __FBTSEQ_LENGTH 0x2

#endif

#define __SFRS_BASE 0x0
#define __SFRS_LENGTH 0x1000

#define __DATA_BASE 0x1000
#define __DATA_LENGTH 0x6000


/*
 * PPS Remapping Pin Names
 */

#define _RPOUT_U1TX 1
#define _RPOUT_U1RTS 2
#define _RPOUT_U2TX 3
#define _RPOUT_U2RTS 4
#define _RPOUT_SDO1 5
#define _RPOUT_SCK1OUT 6
#define _RPOUT_SS1OUT 7
#define _RPOUT_SDO2 8
#define _RPOUT_SCK2OUT 9
#define _RPOUT_SS2OUT 10
#define _RPOUT_SDO3 11
#define _RPOUT_SCK3OUT 12
#define _RPOUT_SS3OUT 13
#define _RPOUT_REFO1 14
#define _RPOUT_OCM1 15
#define _RPOUT_OCM2 16
#define _RPOUT_OCM3 17
#define _RPOUT_OCM4 18
#define _RPOUT_OCM5 19
#define _RPOUT_OCM6 20
#define _RPOUT_CAN1TX 21
#define _RPOUT_CMP1 23
#define _RPOUT_CMP2 24
#define _RPOUT_CMP3 25
#define _RPOUT_U3TX 27
#define _RPOUT_U3RTS 28
#define _RPOUT_PWM4H 34
#define _RPOUT_PWM4L 35
#define _RPOUT_PWMEA 36
#define _RPOUT_PWMEB 37
#define _RPOUT_QEICCMP1 38
#define _RPOUT_QEICCMP2 39
#define _RPOUT_CLC1OUT 40
#define _RPOUT_CLC2OUT 41
#define _RPOUT_OCM7 42
#define _RPOUT_OCM8 43
#define _RPOUT_PWMEC 44
#define _RPOUT_PWMED 45
#define _RPOUT_PTGTRG24 46
#define _RPOUT_PTGTRG25 47
#define _RPOUT_SENT1OUT 48
#define _RPOUT_SENT2OUT 49
#define _RPOUT_MCCP9A 50
#define _RPOUT_MCCP9B 51
#define _RPOUT_MCCP9C 52
#define _RPOUT_MCCP9D 53
#define _RPOUT_MCCP9E 54
#define _RPOUT_MCCP9F 55
#define _RPOUT_CLC3OUT 59
#define _RPOUT_CLC4OUT 60
#define _RPOUT_U1DTR 61
#define _RPOUT_U2DTR 62
#define _RPOUT_U3DTR 63

#endif
